{
"script": [
	{
		"key": "000-00",
		"scriptLines": [
			"You encounter a random encounter!", "Nothing to see here", "No wait lol there's a basic werebitch, RAWR."
		]
	},
	{
		"key": "000-01",
		"scriptLines": [
			"You lost! You get knotty werewolf cock! (up the butt)."
		]
	},
	{
		"key": "001-00",
		"scriptLines": [
			"You look around. There don't appear to be any harpies here.", "That being said, there's a rather pungent scent in the air, and you've been hearing squawks and the flappings of tremendous wings for a while.", "You look up and behind you to try to spot the source, but the sky is empty - however, when you turn back, you can plainly see a figure approaching rapidly, talons extended!"
		]
	},
	{
		"key": "001-01",
		"scriptLines": [
			"You deftly sidestep the harpy's dive, extending your arm to clothesline her in the process.", "The impact nearly drags you both to the ground, but the robust harpy seems relatively unharmed, though she crashes to the floor with her face in the dirt.", "It's time to act!" 
		]
	},
	{
		"key": "001-02",
		"scriptLines": [
			"You're manage to duck underneath the approaching figure, which has the unfortunate side effect of giving you a full view of her intentions.", "Her heavily foreskinned bird dick just narrowly misses its intended target - your mouth - and flies by as a blur.", "It's time to act!" 
		]
	},
	{
		"key": "001-03",
		"scriptLines": [
			"You're too slow to dodge the harpy!", "Her lower body crashes into your face at high speed - you're knocked to the ground, and your mouth, open in surprise, is filled!", "The harpy lets out an moaning screech, and her tongue lolls out in satisfaction!", "Before you even know what happened, you're tasting the worst the harpy has to offer - her slimy penis!", "It tastes like it's never been washed, and the harpy looks down at you with frenzy in her wild eyes; she obviously has taken a liking to your lips in an unfortunate way!", "Her talons grip your head and she gets ready to begin pistoning into your face.  It's time to act!"
		]
	},	
	{
		"key": "001-04",
		"scriptLines": [
			"You lost! The harpy mounts you! (up the butt)."
		]
	},		
	{
		"key": "002-00",
		"scriptLines": [
			"You encounter a slime with a pretty impressive booty!", "It looks like she doesn't want to fight."
		]
	},
	{
		"key": "002-01",
		"scriptLines": [
			"You lost! Slimetime!"
		]
	},	
	{
		"key": "003-00",
		"scriptLines": [
			"You're wandering in the forest - home of monsters and shadows alike.  The creatures of the woods can sometimes be hostile, so you're on your very best guard.", "The sound of a twig snapping jostles you into high alert, but you can't locate the source of the sound.", "You keep your ears pricked up, wary of unseen danger."
		]
	},
		{
		"key": "003-01",
		"scriptLines": [
			"You spot her before she reveals herself - judging by her appearance, you would guess that she's a lone brigand - you scan the area, but you don't detect the presence of any more of her merry band.", "You're fortunate - she didn't expect you to spot her, and she's caught unawares.  Will you charge at her or ready an arrow?"
		]
	},
	{
		"key": "003-02",
		"scriptLines": [
			"You feel a sharp pain in your back - you failed to spot the hidden danger, and it made itself known violently.  You spin to face the source of the pain - a woman, rough and worn, holding a red-tipped blade.  You adopt a fighting stance."
		]
	},
	{
		"key": "003-03",
		"scriptLines": [
			"Your lack of awareness costs you.  Your pants drop - something must have pulled them down!  Your unseen foe works quickly - and, unfortunately for you, their intentions are anything but benign.", "Your breath is caught in your throat as you feel something fat worm its way inside of you, taking the path of great resistance - you've been penetrated, anally.  What is no doubt an erect, spit-slick phallus is poking into your guts, putting a crushing pressure on your insides, and you hear a female, if throaty, voice speak.", "\"Phew.  It's my lucky day - that's some tight ass-pussy. You really need to pay more attention, boyo.  Just a warning for the future\", she says, gripping onto your shoulders, and though you can't see her face, you know she's smug about it.", "\"Now if you'll excuse me, I have some idiot-hero ass to blast.  Hooah!\""
		]
	},	
	{
		"key": "003-04",
		"scriptLines": [
			"You lost! The brigand has her way with you."
		]
	},	
	{
		"key": "004-00",
		"scriptLines": [
			"You encounter a woman sitting on a tree.", "On closer inspection, you notice that she's not sitting on the tree, but rather, is fused with it - could she be a dryad?", "As you approach her, you see that she is holding an apple that looks incredibly delicious."
		]
	},	
	{
		"key": "004-01",
		"scriptLines": [
			"You offer the dryad your apple in exchange for her apple."
		]
	},	
	{
		"key": "004-02",
		"scriptLines": [
			"You convince the dryad to offer up her apple."
		]
	},	
	{
		"key": "004-03",
		"scriptLines": [
			"The dryad is unconvinced by your offer."
		]
	}
]
}