{
"script": [
	{
		"key": "000-00",
		"scriptLines": [
			"There are wolves in the forest - you know, because you've been hearing them howl in the distance, and as you traverse the woods, you've been hearing the occasional growling - albeit higher pitched than you would expect.", 
			"The growling gets louder and louder, until, finally, a wolf emerges from the bushes... and she has big, fat boobs!",
		]
	},
	{
		"key": "000-01",
		"scriptLines": [
			"\"Grrr...\" she growls, holding up her clawed paws.  \"Just kidding,\" she says, dropping them to her skirt, \"I'm not gonna eat ya!  I just want to mate!\"",
			"You look her up and down.  \"Mate\"?  Her proportions are amazing - she's no slouch.  She's dressed like a nearby villager, but her clothes are in tatters.  You wonder what she is - maybe a werewolf?  It's possible her libido has been out of control since she was turned.",
			"You start to consider taking her up on her offer, but something about the way she's standing is a little... strange.  \"Oh... I get to mate, finally!\" she says, gripping onto her tattered skirt, which draws your attention to the anomaly.",
			"There's something... visibly growing in her skirt - it's made a rather pronounced bulge, and it's bulging more and more as she holds her skirt down with her paws and looks at you hungrily, knock-kneed.  At first you think it might be her tail, but it's obviously wagging excitedly behind her... and then the smell hits you.",
			"You cough.  It's such a strong scent it makes your eyes water.  Her eyes, on the other hand, are focused on you, unwavering, and her skirt is visibly wet - as she sways from side to side, you see that she's not wearing any underwear, so her rear is plainly visible as her skirt shifts over it.",
			"That detail soon solves the mystery, as the source of the mystery bulge spills out from under her skirt.  While you don't immediately recognize it, not being too familiar with canine anatomy, a part of you tightens up in fear instinctually.",
			"Up top, it seems the werewolf transformation gifted her a great, heaving set of knockers that wouldn't be out of place on any busty tavern wench, but down below, the transformation was a bit more... bestial.  And throbbing.",
			"It's dripping with liquid lust, and it's obvious that if she intends to \"mate\", that will be her weapon of choice.  You hurry to tell her that you're a male, and any \"mating\" would be rather unfruitful, but she drops to all fours, and lunges at you - too late for negotation!"
		]
	},	
	{
		"key": "000-02",
		"scriptLines": [
			"Now that her knotty wolf-cock has ended up exactly where she wanted it, her personality is much more subdued - although she's howling with delight and panting, so she still comes off as quite exciteable.  \"Mating!  Mating!\" she cries out, while you try not to cry out that your asshole is too small for her \"mating\"",
			"Of course, it's past your asshole now - stuck fast in your rectum, which feels the pressure as if you'd stuffed a melon in there. Your ass feels like it's on fire - her big, round, hard genital-adornment is far too big for your modestly-sized hole.",
			"Your fingers dig into the dirt, but you have no hope of dislodging the embedded sphere in your rectum.",
			"\"That's a good boy!  Good boy!\" she says, apparently aware that you're not exactly the ideal mating partner, \"you're going to have aaaaaaaaall my puppies!\"",
			"That doesn't sound good.",
			"\"There's so much... saved up!\" she declares, and you can almost -hear- the sloshing of her full doggy balls, \"so be a good boy and receive it all in your butt!\"",
			"Her powerful haunch lets her shove much more powerfully than a human could, but no matter how hard she shoves her thick dog dick into your unguarded bowels, it will be for naught.",
			"\"Woof, woof, I'm gonna fill you up!  I'm gonna spew it all out!\" she says, and you shift uncomfortably.  You can't get her off, well, you can't get her off of you, and you can't dislodge the knot - any second now, she's going to piss away her legacy, almost literally, in your bowels.",
			"\"Woof, woof!  Tighten up and receive it!\" she says, and you can hear from the strain in her voice that her knot is about to do its job.  You panic, your mind trying to find any way, any way at all, to avoid the anal goo catastrophe that's about to unfold.",
			"Your forehead is soaked with sweat, and though your listless, red face looks absolutely out of it, you know exactly what she's talking about.  Your stomach growls and your bowels tense preemptively.",
			"There's no way you're going to be able to get that -thing- out of you before your colon becomes the cozy new home to some very confused sperm - your own testicles twitch as you anticipate her pure semen enema.",
			"She howls, and you see white - and so would anyone taking a cursory look up your funhole.  It's hot and slimy and fills every nook and cranny as it spews out of her, and because of the knot, it's sealed inside your hot innards, bloating your intestines uncomfortably.",
			"She blasts a tremendous amount inside - it is obvious that not only is her inhuman capacity far greater, but that her breeding senses have made her save up as much as she can.  Without a doubt, such an insemination would have impregnated any female of her species - instead, an enormous jet of cum displaces any feces in your bowels and a deluge of same replaces it.",  
			"It slams into your stomach with good force, but falls just short of forcing you to ovulate.  She wastes her gooey breeding stock in your unfortunate abdomen, utterly filling every nook and cranny of it with her hot semen and all of her wasted, confused sperm that had prompted such misdirected lust to begin with.", 
			"She throws her leg over your body and faces away, but the knot keeps you tied together.",
			"\"Mating~, mating~ <3\" she sings, while juicing you anally with every ounce of her runny puppy goop.",
			"Your bowels are so bloated and stuffed with semen that any additional nut being pumped into your gut causes uncomfortable spasms, as your aching bowels try to accommodate thick semen where it won't cause too much painful stretching, in a direct reversal of the digestive process.  You want to relieve the pressure more than anything.",
			"After several minutes, she begins to tug on the thing connecting the two of you, and you get to experience the reverse of her penetration process.",
			"\"I mated with a human... how embarassing,\" she whines, tugging at the knot to try to free it, making you grit your teeth in agony. You eventually realize that aiding her by pushing is better than being stuck in impatient-werebitch hell, and through her efforts, the efforts of your bowels, and lubricated by her cum, it pops free, like a stuck cork.",
			"Your anus gapes widely, her doggy cum running out into mud on the ground, and you can feel the air rush in now that the knot isn't obstructing it."
			"You have no strength in your legs, and can't stand.  You're glad to hear, at least, that the wolfgirl who just completely obliterated your butthole is also somewhat embarrassed about the whole ordeal.  She fixes her skirt and bounds off, leaving you alone."
			"You drift asleep - too exhausted to continue.  After several hours, you wake, and are face to face with that very same wolfgirl, her eyes shining brightly, her smile more befitting a cat than a dog."
			"\"You're awake!  Woof woof!  Are you ready for more mating?!\" she says, excitedly, her voice wavering as if she can't contain her excitement.  Looking down past her face, you see her cock, just as erect as it was when you first saw it, and your stomach growls.",
			"At her mention of the word \"mating\", your nearly-closed asshole cramps up, knowing what its fate will be.",
			"It's still sore and awkwardly stretched out from your first \"mating\", and you highly doubt she'll see reason and understand why her peculiar method of \"mating\" won't result in offspring, and will continue to shove her flawed approach where it doesn't belong, resulting in little more than a waterlogged rectum and a useless, stretched out asshole.",
			"After another vigorous round of \"mating\", the wereslut keeps you are her mate - you try to reason with her that you can't brood her puppies, but she isn't hearing it.  She doubles up her efforts, so you stop goading her, but you can't escape, as by the time you recover from one \"mating\", the next is about to begin.",
			"Eventually it is no longer painful; instead, all that remains is the uncomfortable sensations of having something large and phallic shoved up your ass, something thick and rough sliding in and out of your rectum, and something thick and slimy pumped into your bowels.",
			"The unpleasant sensations of receptive anal sex become more and more familiar, until your goo-stuffed innards learn the best way to deal with it.",
			"Your adventure is over, but your ordeal has just begun."
		]
	},
	{
		"key": "001-00",
		"scriptLines": [
			"You look around. There don't appear to be any harpies here.", "That being said, there's a rather pungent scent in the air, and you've been hearing squawks and the flappings of tremendous wings for a while.", "You look up and behind you to try to spot the source, but the sky is empty - however, when you turn back, you can plainly see a figure approaching rapidly, talons extended!"
		]
	},
	{
		"key": "001-01",
		"scriptLines": [
			"You deftly sidestep the harpy's dive, extending your arm to clothesline her in the process.", "The impact nearly drags you both to the ground, but the robust harpy seems relatively unharmed, though she crashes to the floor with her face in the dirt.", "It's time to act!" 
		]
	},
	{
		"key": "001-02",
		"scriptLines": [
			"You're manage to duck underneath the approaching figure, which has the unfortunate side effect of giving you a full view of her intentions.", "Her heavily foreskinned bird dick just narrowly misses its intended target - your mouth - and flies by as a blur.", "It's time to act!" 
		]
	},
	{
		"key": "001-03",
		"scriptLines": [
			"You're too slow to dodge the harpy!", "Her lower body crashes into your face at high speed - you're knocked to the ground, and your mouth, open in surprise, is filled!", "The harpy lets out an moaning screech, and her tongue lolls out in satisfaction!", "Before you even know what happened, you're tasting the worst the harpy has to offer - her slimy penis!", "It tastes like it's never been washed, and the harpy looks down at you with frenzy in her wild eyes; she obviously has taken a liking to your lips in an unfortunate way!", "Her talons grip your head and she gets ready to begin pistoning into your face.  It's time to act!"
		]
	},	
	{
		"key": "001-04",
		"scriptLines": [
			"You lost! The harpy mounts you! (up the butt)."
		]
	},		
	{
		"key": "002-00",
		"scriptLines": [
			"You didn't expect to come across anyone this deep into the forest, but your eyes spot a female form... but, as the light passes through it, you realize that there's no way the thing before you is human.",
			"You approach cautiously - \"she\" isn't facing you.  Once you get closer, you try to discern more details.",
			"\"She\" has a rather sizable rear - one that you could get lost in, quite literally, as she appears to be made of... slime. Though you suppose she can take any shape, which makes her current one quite suspect.",
			"Before you can inspect further, she turns to face you, and, seeing you, jiggles excitedly. Her \"breasts\" are massive, far larger than any human woman would have, and they move quite... fluidly.",
			"\"Ooooooo... a human!  What brings you to my haunt?\" she asks, although as soon as she starts to approach... slithering across the ground, you reach for your weapon.",
			"\"What... are you?\" you ask, confused.",
			"\"That's a rather rude question, isn't it?\", she says, \"I'm a slime, obviously.  A sentient slime.\"",
			"Obviously.",
			"\"How are you... speaking?\" you ask.",
			"\"Oh... well, that's a rather embarrassing question...\" she says, looking flustered, although she's still a translucent blue.  \"As a non-sentient slime... consumes... sentient creatures, it starts to develop a mind of its own... that's me!\"",
			"You pick up your guard.  \"And am I next, then?\" you say, accusingly.",
			"\"No! I haven't digested many humans since I became, well, me.  Always in self-defense, of course,\" she adds, looking somewhat sullen. \"Sentient slime goo is an expensive commodity, or so I've come to learn. So I do have to fend off the occasional poacher\", she explains.",
			"\"Then why are you shaped like... that?\" you ask.",
			"\"Because I'm a girl slime, of course,\" she says, matter-of-factly.",
			"\"No, I mean... why like... -that-, in particular?\"",
			"\"Oh! You mean my luscious curves. You'll have to forgive me, I can be pretty... bubbly,\" she says, jiggling her... entire form. Though she says that, she seems surprisingly sharp.",
			"\"Yes, why?  Are you trying to entice men to their dooms?\", you ask, accusingly.",
			"\"Why? Are you enticed?\" she asks, wiggling her... \"hips\".",
			"She sees that you're not amused by her response, and sighs.",
			"\"I just prefer this form.  It keeps me... grounded,\" she says, shrugging, \"I have no interest in eating you, or, mmhm, engaging in other primal behaviors. We don't reproduce that way, you see,\", she says, patting the flat goo where her vagina would be.",
			"\"How... do you reproduce?\"",
			"\"My, what a personal question. Love darts, since you asked,\" she says, looking proud of herself.",
			"You look at her confused.",
			"\"Mmm, don't ask,\" she says, and you decide to drop that line of inquiry.",
			"\"And if I were to... want to... that would be my problem, then?\" you ask, hand still on your weapon.",
			"\"It wouldn't be a problem at all. You wouldn't be the first. Oh, but you think I ate them, don't you? No, not one. Some gave me gifts... others, I was just pleased to have the company.  It doesn't do anything for me, but it doesn't hurt me either. I flow like water,\", she says, smiling.",
			"What will you do?  Fight, fuck, or flee?"
		]
	},
	{
		"key": "002-01",
		"scriptLines": [
			"You defeat the slime, and she becomes visibly agitated - like she can't hold onto her form any longer."
			"\"I suppose you want to claim a trophy, don't you?  Well then, stab my core,\" she says, defeated.",
			"\"Your core?\"",
			"\"It's the only way to kill a slime.  Chopping us up to pieces does nothing; we'll just reform. If you destroy this, we're gone for good,\" she said, pointing to a jewel floating within her gelatinous form.",
			"\"Why are you telling me this?\"",
			"\"You'd find out anyway,\" she explains, sloshing a bit as she struggles to keep her voluptuous form, \"and I would rather have it done quickly than... the alternative.\"",
			"Do you stab her core?"
		]
	},	
	{
		"key": "002-02",
		"scriptLines": [
			"You attempt to destroy her core with a finishing blow!"
		]
	},	
	{
		"key": "002-03",
		"scriptLines": [
			"You successfully shatter the slime's core. In her last moments, she looks at you with... sadness, and then, her form is completely lost - the slime that was once her spreads out due solely to the force of gravity, and begins to denature and dim.",
			"You receive some worthless goo, and 1 XP."
		]
	},	
	{
		"key": "002-04",
		"scriptLines": [
			"You fail to shatter the slime's core - her slime hardens in such a way to deflect the blow, and then she lurches towards you, so that your wrist gets sucked inside of her. In the next few terrifying moments, she pulls the whole of you into herself.",
			"\"You're quite violent, aren't you?  Well, I won't turn down such a generously offered meal.  Hopefully you go to my chest or hips and not my belly,\" she says, ominously.",
			"You feel a wave of pressure within her, as if her slime was somehow changing in texture... and then your entire body becomes numb.",
			"\"I'm sorry, but I can't just let you kill me. I've done nothing wrong. You, on the contrary... you are dangerous,\" she says, but you can't say anything in response, her goo filling your mouth as you open it to scream.",
			"With a sudden existential terror, you realize what's happening.  She's digesting you. You struggle to move, even a little bit, but... nothing.  You're immobile within the slime.",
			"\"Don't worry, you'll just dissolve away.  I don't poop.  Oh, that's so embarassing to say.  Pretend you didn't hear it. Or, you know, disappear forever...\" she says, and in a matter of a few seconds, you obey - and you end your journey as an extra inch on the slime's impressive hips." 			
		]
	},	
	{
		"key": "002-05",
		"scriptLines": [
			"You put away your weapon. This slime is no danger to anyone who isn't already a danger to others themselves.  You turn away, but the slime stops you.",
			"\"Thank you for understanding. Please, have some slime,\" she says, and though you think to reject her... generous offer, she dumps about a pound of pristine goop into your hand.  You wrap it in some rags, and store it carefully in your bag.",
			"You nod to the slime, and begin to leave again.",
			"\"It won't spoil, not as long as I'm alive. Do with it what you will,\" she says, calling after you.  You receive some slime goo, and 2 XP."
		]
	},	
	{
		"key": "002-06",
		"scriptLines": [
			"The slime defeats you, and you feel a great sense of unease.",
			"\"Perfect.  I needed some 'me' time,\" she says, getting ready to do... something.",
			"\"What do you mean?\" you ask, worried.",			
			"\"I need to rejuvenate, and I need somewhere hot and dark for that,\" she says, and you have a dark premonition. \"Open wide!\" she demands."	
		]
	},	
	{
		"key": "002-07",
		"scriptLines": [
			"You open your mouth to speak... a costly mistake!",
			"You see the slime girl's face up close, and then, a moment later, it collides with yours - and your stomach is instantly full of slime girl goo, with pints being piped in by the second.",
			"In a matter of minutes, your stomach is pumped full near to bursting, and little of the mischevious slime girl is to be found spread on the ground around you - most of her being is swirling and rushing through your intestines, sitting heavily in your over-inflated belly.",
			"You can't even stand being that overburdened... so you sit there, for hours, with the googirl cramping your bowels."
		]
	},		
	{
		"key": "002-08",
		"scriptLines": [
			"You successfully flee, leaving the slow-moving slime behind you.  You receive 1 XP."
		]
	},		
	{
		"key": "002-09",
		"scriptLines": [
			"You turn to flee, but trip, your pants falling down!",
			"\"Don't mind if I do!\" you hear the slimegirl say from behind you... and then, you hear her glorpy form ascend into the air... and a moment later, what goes up comes down, and hard.",
			"The sudden rush into your bowels knocks the wind out of you, and the pumping continues, as she anchors her gooey form to the ground and pumps herself, \"face\"-first into your poor, unfortunate guts.",
			"In a matter of minutes, your stomach is pumped full near to bursting, and little of the mischevious slime girl is to be found spread on the ground around you - most of her being is swirling and rushing through your intestines, sitting heavily in your over-inflated belly.",
			"You can't even stand being that overburdened... so you sit there, for hours, with the googirl cramping your bowels."
		]
	},		
	
	{
		"key": "002-10",
		"scriptLines": [
			"You approach the slime tentatively, wary of her amorphous goop.  She smirks at you.", 
			"\"My name is Protea, if you're curious,\" she says, her hands tracing along her hips and down to her thighs, \"but you can call me Tea.\"",
			"\"Hi... Tea,\" you say, feeling weird about addressing a sentient slime in such a casual way. \"I'm Hiro. Are you sure you're not going to eat me?\"",
			"She jiggles again. \"No way. I like cute humans like you.  And it seems like... we're not going to have any problems getting along, are we?\" she asks, sloshing towards you until you can hear... well, not her breathing, but something.",
			"You reach out and touch her chest - your fingers sync in, but just barely, and there's a surprising amount of give.  You get the sense that she's intentionally keeping her form so that it feels how you expect it to feel.  To your relief, she doesn't suck you in.",
			"\"Mmmm... and do you want to come into me or... would you like me to fashion you up a male-human surrogate?  You wouldn't be the first to ask for that, either,\" she says, flatly.",
			"What do you do?"
		]
	},	
	{
		"key": "002-11",
		"scriptLines": [
			"\"I-I'd like to... come inside,\" you say, meekly.",
			"\"Mmm... okay. I'll let you in me. You're going to have to fight your way in, though~ <3\" she says, bringing her curvy, squishy body to yours."
		]
	},	
	{
		"key": "002-12",
		"scriptLines": [
			"\"I... um...\" you say, but the words won't come out.",
			"\"Mmmm... interesting. I kind of suspected; you get a knack for telling that when you're a slime as long as I've been,\" she says, and you see the slime in her nether regions, being what they are, starting to bulge out and harden.",
			"You stare at her in awe - if her preferences in regards to hips and bust are any indication, she has no problems exaggerating the human form.  Sure enough, the slimy bulge is nearly as thick as a fist and as long as elbow to wrist, and it's still forming and hardening.",
			"\"I assume that's where you want it. On me, that is. I know where you want it in the more... personal sense. I've had my slime in similar places before, after all,\" she says, putting the finishing touches on her slimy phallus-like protrusion. \"Now... turn around, love.\""			
		]
	},	
	{
		"key": "003-00",
		"scriptLines": [
			"You're wandering in the forest - home of monsters and shadows alike.  The creatures of the woods can sometimes be hostile, so you're on your very best guard.", "The sound of a twig snapping jostles you into high alert, but you can't locate the source of the sound.", "You keep your ears pricked up, wary of unseen danger."
		]
	},
		{
		"key": "003-01",
		"scriptLines": [
			"You spot her before she reveals herself - judging by her appearance, you would guess that she's a lone brigand - you scan the area, but you don't detect the presence of any more of her merry band.", "You're fortunate - she didn't expect you to spot her, and she's caught unawares.  Will you charge at her or ready an arrow?"
		]
	},
	{
		"key": "003-02",
		"scriptLines": [
			"You feel a sharp pain in your back - you failed to spot the hidden danger, and it made itself known violently.  You spin to face the source of the pain - a woman, rough and worn, holding a red-tipped blade.  You adopt a fighting stance."
		]
	},
	{
		"key": "003-03",
		"scriptLines": [
			"Your lack of awareness costs you.  Your pants drop - something must have pulled them down!  Your unseen foe works quickly - and, unfortunately for you, their intentions are anything but benign.", "Your breath is caught in your throat as you feel something fat worm its way inside of you, taking the path of great resistance - you've been penetrated, anally.  What is no doubt an erect, spit-slick phallus is poking into your guts, putting a crushing pressure on your insides, and you hear a female, if throaty, voice speak.", "\"Phew.  It's my lucky day - that's some tight ass-pussy. You really need to pay more attention, boyo.  Just a warning for the future\", she says, gripping onto your shoulders, and though you can't see her face, you know she's smug about it.", "\"Now if you'll excuse me, I have some idiot-hero ass to blast.  Hooah!\""
		]
	},	
	{
		"key": "003-04",
		"scriptLines": [
			"You lost! The brigand has her way with you."
		]
	},	
	{
		"key": "004-00",
		"scriptLines": [
			"You encounter a woman sitting on a tree.", "On closer inspection, you notice that she's not sitting on the tree, but rather, is fused with it - could she be a dryad?", "As you approach her, you see that she is holding an apple that looks incredibly delicious."
		]
	},	
	{
		"key": "004-01",
		"scriptLines": [
			"You offer the dryad your apple in exchange for her apple."
		]
	},	
	{
		"key": "004-02",
		"scriptLines": [
			"You convince the dryad to offer up her apple."
		]
	},	
	{
		"key": "004-03",
		"scriptLines": [
			"The dryad is unconvinced by your offer."
		]
	}
]
}