{
"script": [
	{
		"key": "INTRO",
		"scriptLines": [
			"Welcome to the world of Tales of Androgyny!", "This is a pre-alpha build - many systems and assets are not currently in place, so please don't expect this to be the full game experience!", "If you encounter any bugs, please let us know - leave a comment on our game page at itch.io, send us an email at majalistic@gmail.com, or message us on Patreon.  Thank you!", 
			"Some tutorial tips to follow - hold CTRL to skip and to select your game mode.",
			"Combat is stance based.  The three core stances are Balanced, Offensive, and Defensive.  Abilities that you can use are determined by stance, and using them may result in a new stance - for example, using Spring Attack in Balanced stance will leave you in Offensive for the next round, and using Cautious Attack will leave you in Defensive.",
			"Balanced stance is a staging stance - most abilities will move you into a new stance.  It has a balance of offensive and defensive abilities.",
			"Offensive stance has powerful abilities that can damage, unbalance, or otherwise upset your opponent, but at a high cost to stamina, stability, or both, or by lowering your defenses, depending on the ability.",
			"Defensive stance has defensive abilities, and can be used to weather an enemy's brutal attacks, or to get on more stable footing or catch a breather, in preparation of launching a new offensive, or to let an enemy tire themselves out before you subdue them.",
			"The core statistics are Strength, Endurance, Agility, Perception, Magic, Charisma.  All of a character's core statistics are used in determining encounter outcomes.  Your current statistic score is your base score and any more temporary modifiers, like being tired or injured.",
			"Running out of Stamina will cause you to momentarily black out, falling over - running out of Balance will similarly cause you to trip.  Try to use less strenuous abilities to preserve and recover stamina, and more stable abilities to remain balanced.",
			"You're looking mighty fine, by the way.  Please select your game mode."	
		]
	},
	{
		"key": "STORY-000",
		"scriptLines": [
			"...",
			"..",
			".",
			"The wind is warm and carries the smell of the sea and smoke alike; distant thunder comes not from the sky, but across leagues of night-black ocean.",
			
			"She peers over the void, lit up in reflection intermittently by the fires that consume an ancient fortress as it burns in the night, the occasional burst of sound carried on the wind reaching her, miles away, when the flames reach a munition store or chemist's laboratory or arcanist's cache.  Brickwork as old as time crumbles into the sea, the western battlements bleeding out stone, smoke, and the crimson remains of the slain.",

			"She sips from her goblet, similarly sanguineous, and lets out a sigh.",

			"The moon has never seemed so full as tonight, she muses to herself, and yet his armies lay broken, his dominion shattered, his very life, she relishes, like the moonlight reflected in her drink - insubstantial, and soon to be gone forever.  Because of her.  Her purple, stained-red lips stretch into a fanged smile, and she licks her teeth in satisfaction.",
			
			"This - she thinks to herself, as the fires rage on and the once great fortress sinks in large part into the sea - is what victory tastes like.",

			"With that, she presses the goblet to her lips and tilts her head back, draining the last of it.  The moonlight reflects off her eyes, deep and red as her drink, but as bright as the fires blazing in the summer breeze.",

			"She stands gracefully from her viewing seat of bone, and casts the goblet into the abyss, feeling free and merry.  She crosses her arms on her chest, grasping herself in excitement, her breath ragged and terse.",

			"She hears a whimper, and is suddenly reminded that she's not alone to bask in this momentous occasion - there is also... another.",

			"He was his lord's second in command - an effeminate youth who fell madly, brazenly in love with her, and who was instrumental in helping to bring about the night's key events.  He has to be rewarded, she realizes.",

			"He was promised her... affection, if only he turn traitor, and he'd performed his duties admirably, so she is in no position to refuse.  She'd strung him up earlier in the evening, suspended from the trees above with a rope each around his ankles and wrists, but when she approaches him, clearly drunk and eager to... canoodle, it pricks up immediately, even as he hangs there, immobilized and naked.",

			"\"My, my... someone is eager,\" she says, flicking it with her well-manicured finger.  \"I do believe... it's time.\"",

			"She runs her fingernail up and down it, as her hand roams down her body, to the underside of her cold iron girdle, where his \"reward\" was rapidly growing in size, much to his ignorance.",

			"She walks away from him, taking a deep breath of the refreshing smell of sea salt and smoky oblivion, allowing him to watch her hips sway as she approaches the cliffside, where her viewing seat has been erected, and procures from it a flask of a particular oil.  She sits on her viewing seat, mostly out of his view, and he whines his complaints about this arrangement through his gag.",

			"From his vantage, he can see her spread her legs, wide, her back arched, as she holds the flask high in the air, and then tilts it, pouring it down onto herself.  Indeed, she pours it directly into her girdle, where it slathers over her awakening beast while she moans in anticipation.",

			"With the flask expended, she lets it fall to the ground, and rises to her feet, nearly done with her final preparations of the night.",

			"She turns to face him and begins unfastening her girdle, so that it eventually hinges open, and then falls with a heavy crash behind her.  With the oversized moon at her back, he sees her in silhouette - but the perturbation is clear, even then: a jet black object of some size and evil shape, studded and flared, emerging from between her legs.",

			"It's slick with oil, and as she grabs hold of the ropes suspending his legs, it bobs ominously.  He stares at it, transfixed, horrified."

			"\"All that, only to get dicked in the end anyway.  I almost feel bad for you,\" she says, reaching down to stroke her black-as-pitch phallus, which glistens in the moonlight as it sticks out from her body.  Even as she tells this lie, she lines it up into position: his anus, spread and defenseless by the distant ropes that hold his legs apart.",

			"Her semen tanks are utterly full - she'd waited a long time since she'd seeded her plan, and in all of the preparations and planning, she'd not seeded anything else.  Unfortunately for him, she had also arranged to fix that as soon as her victory was assured.",

			"She grips his ankles - firmly, and he stares wide-eyed at the onyx thing pulsing with energy pressing up against his spread hole.",

			"She eases her hips forward, slowly, more, and more, and more... as he groans into the gag, feeling her push more and more of herself into him.  The monstrous, inhuman phallus stretches his insides in ways unthinkable, and his eyes, among other things, open as wide as they possibly can.",

			"She licks her canine tooth, and peers deeply into his eyes.",

			"Tonight, she thinks, is a good night.",
			"{ Tales of Androgyny }",
			"\n\n{ Tales of Androgyny }",
			"\n\n\n\n{ Tales of Androgyny }"
			]
	},
	{
		"key": "STORY-001",
		"scriptLines": [	
			"...",
			"..",
			".",
			"So it has come to this.",
			"The first fires of creation have died out, and all that remains are the embers and ash of what could have been greatness.",
			"It smolders, blackened, like dying coal, spent of life.",
			"The tears fall.  Your shoulders tremble.",
			"What could have been has been undone.  In all of the cosmos, of infinite possibilities, a singular truth has been revealed, and it it this:"
			"Breakfast... is ruined.",
			"You toss the burnt eggs into the same refuse pile that is your shrine to ruined meals and sigh.",
			"It's been almost two decades since the Moon Lord's defeat and life in the outskirts of Nadir... isn't great, but the constant raids by moonmen have ceased, and the wellwater has never tasted less putrid.",
			"Just the other day, that girl from the village even said your name - probably. And recently, all those forays into the village library have proved fruitful.  Not only have you gained useful knowledge to put your life as a peon into perspective, but you now know about the mating habits of ducks and...",
			"Maybe they haven't been so fruitful after all.",
			"You glance down at the dribbling eggs.  Is this all there is to life?  Failing to accomplish basic tasks and waiting to grow old?",
			"No.  No, that can't be it, you assure yourself, even as the last gooey-yet-burnt drippings of your failure slough off the walls of the dilapidated hut you call home and into that same pile of ruined breakfasts where you keep your genetic legacy.",
			"There is one thing that separates men from beasts, and you feel it strongly.  With renewed vigor, you throw open the door, well, flap, to your abode, and greet the sunshine of day; it's so bright that it hurts your eyes and you almost immediately give up."
		]
	},
	{
		"key": "STORY-002",
		"scriptLines": [	
			"But you don't - and that's what counts.  For the one thing that separates men from beasts?",
			"Denial.",
			"First things first - you have to go to him.  The man that's been waiting for you.  The man that taught your mother.  The legend of the nearby village, living alone in a cottage on the village outskirts - the place where your true destiny will first take root.",
			"You pack your things - there isn't much - and leave for the cottage on the outskirts."
		]
	},
	{
		"key": "STORY-003",
		"scriptLines": [	
			"After a short trek, encountering nobody along the way (thankfully), you see the cottage in the distance.  Smoke billows from the chimney slowly - a dim fire lit within.  As you approach the front door, you hear a faint, muffled voice; a man is speaking.",
			"You knock on the door, and the speech stops, only to be replaced with a fumbling of the lock and a louder, more resonant voice.",
		]
	},
	{
		"key": "STORY-003A",
		"scriptLines": [	
			"\"I've been waiting. It was only a matter of time,\" they say, unfastening the final lock, and pulling open the heavy oaken door, \"now, you can finally fulfill your destiny as...  who are you?\", the man standing in the doorway asks, once his eyes fall on you.\"",
			"You recognize him instantly, though he's aged years - years that have not been kind to him.  He was once a tall, proud, handsome man... now he's a tall, confused, kind-of-handsome-in-that-older-guy-way man, and he has clearly not been keeping up with the razor.",
			"You rally your resolve. \"I am the son of the hero that defeated the Moon Lord, and I...\" you say, but he holds up his hand.",
			"\"Hold on.  Moon Lord?  Why does that sound familiar?\" he says, scratching his beard pensively, \"Big guy?  Elephant head?  Breathes pure dark flame?\"",
			"You deflate slightly. \"No... I think that was the Dark Lord... the Moon Lord--\"",
			"\"--could conjure spiders by blinking, right?  A hundred feet tall, body made of corpses, wails of the legions of the damned whenever he spoke?\"",
			"\"No, that was the Marquis of Death, if you rem--\"",
			"\"Skeleton, big hands, spellcaster, huge fortress--\"",
			"\"Overlord.\"",
			"\"Lived in a palace on the moon, big snake...\"",
			"\"Moon serpent.\"",
			"\"But I'm getting closer, right?\"",
			"\"No. The Moon Lord terrorized our lands for centuries. He destroyed our village.  Twice.  He killed YOUR parents.\"",
			"\"Right, that guy.  What about him?\"",
			"\"Nothing!  Nothing about him!  My mother slew him, and...\"",
			"\"You've come to collect. Every day another poor schmoe is knocking on my door asking about a quest I put out years ago- look, there's a statute of limitations on this stuff.  I don't even have any more enchanted swords; you'll have to settle for like, enchanted silverware.\"",
			"\"I don't want... I'm not here to collect anything! You taught my mother how to fight... how to be a hero... and I want you to teach me, too!\" you say, loudly and clearly.",
			"He pauses, clearly deliberating... even as he slowly closes the door in your face.",
			"\"Wait, wait!  I'll pay you!\" you say, jamming your foot in the door.",
			"\"Will you?  What have you got?\", he asks, easing up, but not letting you pull the door open any more than it already is.",
			"\"Well... nothing, but... ow!\" you exclaim, as he kicks the toes of your boot in an attempt to dislodge it from the door.",
			"\"I'm tired of being paid nothing!  Folksy wisdom doesn't grow on trees, you know!  Take your \"Poon Lord\" talk and shove it!\"",
			"He finally kicks your boot free, and slams the door shut.  You stand, dumbfounded, unsure what to do next... but after a few moments, he opens the door again.",
			"\"Oh, are you still here? I thought the encounter was over\", he says, scratching his chest boorishly.",
			"\"Even if... even if I can't pay you now... one day...\" you say, on the verge of tears, and he sighs.",
			"\"One day you'll have a whole list of fantastic enemies, and one of them will slit my throat in my sleep.  Fine.  I welcome it,\" he says, stepping aside to let you in, \"but you get one consultation.  And I expect payment deferred.\"",
			"You enter the cottage, expecting to see the walls lined with weapons and trophies from various evil beasts - instead, you see tea cozies and tasteful wall rugs."
			"\"I'm a retiree.  I've got plenty of time to decorate,\" he explains, before sitting into a well-cushioned armchair, oofing all the way.", 
			"\"So... you trained my mother,\" you say, keeping on your feet, full of determination, even as he gestures for you to sit down. \"Now I want you to train me,\" you reaffirm, and he nods.",
			"\"What for?\" he asks, peering over his steeped fingers, \"What are you hoping to accomplish?\"",
			"You close your eyes. It's been so long. You were just a child, then... but not now. \"To defeat who even my mother could not,\" you say, will unwavering, unlike your voice.",
			"\"The Dragon God...\" he says, in disbelieving tones, sitting forward in his chair.",
			"\"No, the Demon King.\"",
			"\"Right, the Demon King...\" he says, in disbelieving tones, still sitting forward in his chair. \"That's... not gonna lie, that's not happening. Still, though, we all have dreams,\" he says, sitting back in his chair, arms on the armrests, relaxed.  \"Worth a shot.\"",
			"As reassuring as his words are, you feel a hint of trepidation.  You finally take his offer to sit, and he leans forward again to pour you some tea.  You take the floral cup he offers you and sip at it... it's long cold.  The fire is nearly extinguished.",
			"\"So you'll train me, then?\" you ask, and he nods, \"Like you trained my mother?\"",
			"\"I... wasn't your mother's trainer, per se.  I was -a- trainer, and she purchased my services once or twice... once...\" he says, trailing off, and you feel your heart sink.  \"B-but that still counts, right? Maybe without my help, she never would have killed the Moon Bug.\"",
			"\"Moon Lord.\"",
			"\"Right, that.  If I can help her kill the Worm Lord, I can help you kill the Demon King, theoretically.  Not a doubt in my mind,\" he says, although it's plain on his face that he's doubting even the basic premise of what he's saying, even putting aside what he said earlier.",
			"\"You'll help me? Even though I can't even pay you?\" you say, gratefully, and he clicks his tongue.",
			"\"Don't have to rub it in.  Yeah, I'll help you.  Right now.  Clock's ticking,\" he says, pointing to his clockpiece standing against the wall, which is... clearly broken.",
			"\"Do you really think, if I start now, I could... maybe, one day... defeat the Demon King?\" you ask, trying to cling to hope.",
			"\"Let me think... 'she slew a great demon in a faraway land.  What became of her afterwards, few know, not even her own son' - that's you, right? Or do I have the wrong Dune Fjord slaying mama?\" he says, apparently having finally recalled something about your mother and her story.",
			"You ignore his error and focus on what he's implying.  \"My mother was great and powerful.  I'm... me,\" you say, dejected, and he stands up - you're so surprised, you stand up as well, and he grasps your shoulders.",
			"\"Well, even she had to start somewhere.  She didn't simply take up the holy sword Irathel and march off to defeat the Moon Lord half-cocked.  She had to stab thousands of inconsequential slimes and fauna before that,\" he says, reassuring you.",
			"\"My mother didn't take up the holy sword Irathel at all.  That was her cohort, the Paladin of Drepnir,\" you say, correcting him.",
			"\"Holy sword, magic bracelet, whatever.  The point is that her magical items dropped off of some less powerful creatures, and the items she used to defeat those schlubs dropped off of even less powerful creatures, maybe even people.  In a world where the only way to get more powerful is to kill and steal, you have to start small,\" he says, his eyes full of kindness.",
			"\"I don't know if I have it in me,\" you say, hesitance gnawing at you.",
			"\"That's horse manure,\" he says, slapping your shoulder, painfully, \"If your mother could slay the Goon Lord, you can slay the Demon King.  Uh, 50/50 odds, at least.  Probably,\" he says, waving his hand about noncommitally.", 
			"\"You think so?\" you ask, and he... admittedly takes a second to answer.",
			"\"You're your mother's son. I'm sure you can take a life like the best of 'em.  And if you can't, a few hours bashing rats with a stick will get you up to speed,\" he says, confidently.  \"But first things first.  You'll need to pick a class.\"",
			"You blink.  \"A... class?  Like, the remedial kind, or...?\"",
			"\"No, no,\" he says, waving his hand dismissively, \"a hero class.  You know, what defines you as an adventurer.  It represents a lifetime of training, discipline, and learning, as well as your personal outlook, philosophy, and primary strategy.\"",
			"You nod along.  \"Uh... then... shouldn't I have selected my class, like, a long time ago?\"",
			"\"You'd think, right?  Anyway, just pick one.  This is important, and you shouldn't be reckless in choosing, but... I skipped lunch, and it's getting late, so, you know...\" he says, waving his hand along.",
			"\"I don't... I don't even know what the options are,\" you say, already losing your nerve.",
			"\"Oh, for the love of... alright, here I am, your glorified class selection menu.  Let's move this along.  Ready?  Here we go\", he says, holding his hands up in the approximation of a rectangle.",
			"\"WARRIOR\", he says, out loud, before pausing for effect.",
			"\"Warriors are martial adepts, boasting excellent fighting skills and physical fitness.  This is adventurer classic, but the classics are classics for a reason.\"",
			"\"Awesome!  Mom was really strong.  I like it,\" you say, and he scratches his chin, trying to avoid eye contact.",
			"\"Well, that's true, but... it doesn't really suit you.\"",
			"\"Why do you say that?\"",
			"\"Well... who's going to believe that someone that looks like you has a high STR score?\"",
			"\"That's...\"",
			"\"And besides, everyone picks Warrior.  It's like... vanilla ice cream.  You don't want to be boring, do you? Even if your mother was one, you've got to forge your own path.\"",
			"\"I... I guess you're right.\"",
			"\"Alright, next. ROGUE.\" he says, again, loudly, leaving an awkward silence lingering for a moment.",
			"\"Rogues are highly skilled, lightly armored combatants.  They represent the cream of the crop in terms of their agility. They're masters of outmaneuvering their opponents and avoiding potentially fatal blows.  Pretty nice, huh?\"",
			"\"Yeah!  I could use two weapons, and sneak behind enemies, and kill them before they even see me!  I wouldn't even have to be a good fighter.\"",
			"\"True, true... but you'd also have a bad reputation.  Would your mother really be proud if her son became a world class, back-stabbing murderer?\"",
			"\"...no, I guess not.  Fine.  Next.\"",
			"\"PALADIN. Formidable, stalwart, and holier-than-thee...\"",
			"\"Thou.\"",
			"\"Pardon?\"",
			"\"It's 'Holier-than-thou.'\"",
			"\"That doesn't seem right.  Really?\"",
			"\"I'm pretty sure.  If we go to the library, we could look it up.\"",
			"\"I mean, yeah, but... do you want to go all the way to the library just to see how people used to talk?\" he says, implying that it's a giant waste of time.",
			"\"It just sounds weird, is all,\" you say.",
			"\"...\"",
			"\"...\"",
			"\"ANYWAY, Paladin...\"",
			"\"Wouldn't the plural be 'Paladins'?\"",
			"\"PALADINS are resilient and heavily armored, and are capable of holy magicks.  Are you going to say something about how I spelled 'magick'?\"",
			"\"No... that... speaks for itself.\"",
			"\"...I'll give you a sovereign if you'll shut up and let me describe the Paladin.\"",
			"\"Done.\"",
			"{RECEIVED 1 GOLD SOVEREIGN}",
			"\"...and so, because of this, they're the most defensive class. For some reason, there's no playable Cleric or Healer class, so they're the only healers.  They adhere to a strict code of ethics, and are sworn in by vows to uphold law, no matter the circumstance.  Are you prepared to take those vows?\"", 
			"\"I'm more of a descriptivist myself, really.\"",
			"\"...\"",
			"\"RANGER. As their name suggests, they're unparalleled at ranged combat.  I could actually see you with a bow.\" he says, rubbing his chin under his beard.",
			"\"What's that supposed to mean?\"",
			"\"Nothing, you just seem like the type that would use a bow.\"",
			"\"Why do you say that?\"",
			"\"Because you're... uh...\"",
			"\"You know what?  Never mind.  I don't want to be a Ranger anyway.  Mom never used a bow.\"",
			"\"Right.  MAGE.  Mages wield the very nature of magic itself against their foes, and their power is legend, but their actual combat ability is without peer.  Because nobody's as bad at fighting as a mage.\"",
			"\"That's not like mom at all.  I think I'll pass, phenomenal cosmic power or no.\"",
			"\"That's probably a good call.  They're more of a party class, anyway.\"",
			"You sigh.  You wonder just how many classes there are... and if it will really make a difference if none of them suit you.  Maybe you should just be a warrior and try to make it work...",
			"He doesn't say anything for a bit.  He looks like he's thinking... about what, you're not sure.",
			"\"...ENCHANT...ER.  Enchanters... can do just about everything.  High-level Enchanters are among the most powerful and revered of all adventurers.  Their stats are balanced, they can wear most equipment, and they can use both light and dark magicks. One of your mom's closest allies was an Enchanter, even.\"",
			"\"...that sounds great.  Alright, I'll be an Enchanter.\"",
			"\"Just like that?  You don't want to look at their st...\"",
			"[You are now an Enchantress] [Level 1]",
			"\"Alright!  Class selected.  What next?\"",
			"\"Well, uh...  you should get familiar with your character information screen... uhm...\"",
			"\"Why are all of my stats so... low?\"",
			"\"They're... balanced.\"",
			"\"Wait, my Charisma is 7?!  What does that even do?\"",
			"\"Nothing, far as I can tell.  It's just, each class has one high stat.  Someone had to get the useless one.\"",
			"\"You said Enchanters were really good!\"",
			"\"I said 'high-level' Enchanters are among the most powerful and revered. Level 1 Enchanters are worse than worthless; nobody takes them seriously.  That's part of the reason why the high-level ones are respected - it takes a special individual to make the crappy starting class into something worthwhile.  Good luck.\"",
			"You feel... numb.  Dumbfounded.  Before you even know what's happening, you realize that he's led you to the door, where he then pushes you outside.",
			"\"W-wait!  What about my training?\" you ask, defiantly.",
			"\"That was it.  I'm just certified as a class-change trainer. Never got my skill training certification. Bad grades. One time, we snuck on top of the school and--\"",
			"\"THAT'S IT?  What am I supposed to do now?\" you ask, sounding more petulant than you intended.",
			"\"Now... well, first thing is getting supplies.  Better visit the Shop in town.  You'll know which one - it's the only one.  And you'll need someone to teach you magic, since an Enchantress without magic is just asking for it, but it's magic, so I ain't gotta explain... look, my tea's getting cold. Run along now.\"",
			"He slams the door shut.  You feel... different.  Certainly, you feel more in tune with the flowing of the air around you, and looking at your hands, there does seem to be a noticable... change in your appearance as well.  Supplies, he said... well, first thing's first.  Although, you suppose, this is now the second thing.",
			"As you walk away from the cottage towards the village proper, you start to wonder.",
			"To slay the Demon King... will that really improve the lives of the people you care most about?  You wonder.  You can barely remember it, but you've heard stories of what life was like under the Moon Lord's thumb... assuming it had a thumb, anyway.  The threat of the Demon King, by comparison, seems... remote.",
			"Well, your job as village layabout has come to an end, surely.  If you can give back to all the people who helped and supported you, then that's just what you're going to do.",
			"First, you set out for the village itself - knowing that the road to the Demon King's fortress, far in the northwest, beyond the mountains, will be daunting, you take your first true steps in that direction - to your first home, Nadir, and then beyond."
		]
	},
	{
		"key": "STORY-004",
		"scriptLines": [	
			"You return to the cottage, but find that he's no longer there.",
			"You wait around for a while, but he doesn't return - maybe he's out on the town, or foraging for squirrels to eat.",
			"You leave, disappointed."
		]
	},
	{
		"key": "STORY-005",
		"scriptLines": [
			"You enter the village of Nadir proper - the main street stretches before you, and you know the shop isn't far.  On your way to it, you happen across a trio of old, crusty men telling stories around a bonfire, although one of them doesn't say a word at all.  You walk past, nonchalantly, but listen in on their conversation, hiding behind a nearby retaining wall.",
			"\"Did ya hear about that adventurer boy what wandered into the orc camp down by Nagle's Crook?\" one man asks, although it's obvious from the reaction of the other two that they don't much know or care about it.",
			"\"Nah.  They kill 'em?\"",
			"\"Pahh, that'd be a borin' story, wouldnit?  Mighta been better for him, though.  Daft orcs couldn't tell 'em from a lass, so they blasted his ass six ways to sundown before he escaped.  Got back to town with enough orc jism up his butt to qualify as a caravan hisself!\"",
			"The man threw back his head in laughter, and his compatriot snickered, a grin visible beneath his mangy beard.",
			"\"Ya think that's funny?  A fresh-faced lad said he'd slay that ogre prince fella making trouble in the lowlands, and bring 'is head to the princess in exchange for her hand in joyous marriage 'n all that.\"",
			"He shakes his head, fighting back a fit of giggling.  Then he leans over and spits into a spittoon.",
			"\"Next time anyone saw 'im, he was dressed much the same as the princess whose royal pussy he'd been chasin' after - and the ogre prince was slippin' him a fat one under the skirts and up his arse.  Ever seen an ogre dick?  Me neither, but I reckon that boy ain't a happy wife.\"",
			"You feel a sinking feeling in your stomach.  Does that sort of thing really happen?  It can't be.  These old, dirty men must be telling tall baudy tales just to pass the time.  There's nothing more to it than that.",
			"\"I can do ya one better.  Hear about those shebitches that caught licker... lycra... the wolf sickness, y'know what I mean,\" he says, and you're not sure if the drunkenness has adled his brain or if it came pre-addled."
			"\"Yeah, what about 'em?\"",
			"\"Well, rumor 'as it they've got between their legs what an alpha male wolf's got between 'is.  An' they like to pounce on unsuspecting men and give 'em what for,\" he says, pantomiming with his hands what everyone listening could picture in their heads.",
			"\"Yah, so?  How does that compare to an ogre's fat one?\"",
			"\"Well, y'see,\" he replies, leaning in, conspiratorially, but stage-whispering loud enough that you can still easily hear, \"when a dog is givin' another dog the business, they don't wan' 'em to leave before the business is concluded, y'see.  So it swells up, big as a dogfruit... an' I just got the name,\" he says, wiping his mouth in disgust.\"",
			"\"Big as a dogfruit? Oof... tha' must be 'n ordeal.\"",
			"\"Yah, let me tell ya, from one man to another, if a she bitch is lookin' frisky and ye can't fight her off, ye best off swallowin' yer tongue.\"",
			"You back away from the two men, who seem awfully amused with themselves, and check that your training sword is where you left it.  It sounds like you'll be needing it to be sharp and at the ready, because the world is a dangerous... uh... the image of a noble knight swearing to slay the ogre prince flashes in your mind, and then...",
			"You shake your head.  The shop is just down this road.  You follow it, and spot the shop marked, well, 'Shop'.",
			"When you enter, you see that the shop has fruit laid out in baskets on tables and on counters, more fruit than anyone has ever had need for.  Since you get your food courtesy of the township, you've never had reason to step inside.",
			"Behind the counter, you see a fresh-faced girl who you've seen around town, but never spoken to."
		]
	},
	{
		"key": "STORY-006",
		"scriptLines": [
			"\"Hey there, what can I get for ya?\" she says, putting a basket full of apples down on the shop counter.",
			"You can't quite place her accent.  She hasn't looked over at you yet responding only to the sound of the shop door shutting behind you.",
			"\"Oh, you're new around here, aren't you?\" she asks, once she turns and sees your face.",
			"\"I've... lived here my whole life...\" you say, but she just smiles politely in response.  She wipes her hands - she'd clearly just been working in the apple grotto - and clears her throat.",
			"\"Name's Shopkeep.  You can call me Shopkeep,\" she says, full of energy. \"What would you like to buy?  Oh, and this cute thing isn't for sale,\" she says, gesturing to herself.",
			"\"I... didn't think that...\" you say, flustered, and she looks down at her dress and pulls on the hem, lifting it slightly.",
			"\"I made it myself.  It's my favorite dress.  Also my only one,\" she says, dropping the hem and shrugging. \"So, what'll it be?\"",
			"You wipe your brow.  Her dress, obviously.  It's your turn to clear your throat.  \"Hrm... what do you sell?\""
			"\"Oh, the usual,\" she says, although you're not sure what a 'shop' usually sells, \"apples, pomegranates, dogfruit, and other seasonal fruit and spices. Wait, are you an adventurer?\", she asks, eyes suddenly wide with excitement. At the mention of 'dogfruit', your sphincter tightens.",
			"You feel a swelling of pride. \"Why, yes, yes I am,\" you say, confidently.",
			"\"Well then. I sell swords, knives, axes, hammers, maces, flails, guns, bombs... did I say knives?  Knives,\" she says, smiling sweetly, even as she kicks the display behind her, which flips around to reveal... well, exactly what she'd said.  An arsenal.",
			"Your mouth hangs agape."
			"\"Oh, bows, also,\" she says, sensing your sudden anxiety, looking like she just remembered something, pointing over her shoulder at an array of short and longbows.",
			"\"No, no, I don't know how to... did you say bombs?  Uh... what kind of... swords do you have?\" you ask, trying to swallow your surprise.",
			"\"All kinds - longswords, shortswords, broadswords, bastardswords, single-edged, which are just knives, really, double-edged, good to wear gauntlets with those, falchions, scimitars, rapiers, mediumswords, machetes...\" she continues, listing them off without taking a breath.",
			"\"I think... uh... I think a longsword is fine.\"",
			"Her eyes light up. \"What kind?\"",
			"\"A pointy one, please,\" you say - you don't know the first thing about swords.",
			"\"Got ya!\" she says, turning on her heel to face the display of weapons... only to open a big iron chest, which you can see is actually filled to the brim with swords of all kinds - there must be dozens, thrown haphazardly inside.  She dons a pair of thick gloves and then dives in.",
			"You swallow, hard, as she searches deep in the chest... paying little mind to the fact that she's bending fully at the waist, and her skirt is not long enough to hide her panty-clad rear, which she wiggles at you in her search, either oblivious or uncaring.",
			"You wonder if she didn't measure her height properly, or if her rear wasn't quite so large when she sewed the dress... but it's hard to really think through hypothetical scenarios.", 
			"The fabric stretches thin over her admirably-sized bottom, but you don't have much time to gawk before she stands back up right, arms full of blades.",
			"\"These are all pointy, good for stabbing and eviscerating, and more importantly, they're nice and light, so even weaklings can use them,\" she says, chipper as ever.  She doesn't seem to mean any insult by it, so it seems like it's just an honest appraisal of your abilities.  Which is... more insulting, probably.",
			"\"T-thanks... I guess I'll pick one...\"",
			"She drops the lot of them down on the counter - that can't be safe, or a good way to handle the merchandise - and you carefully peruse them.  There's a thin sword, clearly designed for thrusting, one that's a bit thicker, for thrusting or swinging it around, a thick one with a single edge, and a thick, double-edged one.",
		]
	},
	{
		"key": "STORY-006A",
		"scriptLines": [
			"When you finish making your selection, you hold it out from your body, feeling more confident than you've ever felt - but you still have no idea how to use it.  Being Level 1 sucks.",
			"\"Oh, no, not like that,\" she says, rounding the counter, \"here, let me show you.\"",
			"She stands behind you and grabs the sword, and you feel a lump in your throat.  Her soft form presses against your back, and your heart races.",			
		]
	},
	{
		"key": "STORY-006B",
		"scriptLines": [
			"\"Oh my... you're rather cute, aren't you?  A shame you're going on a journey...\" she says, and you feel your heart beating in your chest... and a stirring in your loins that isn't nearly as innocent.",
			"Her hand rests on yours, and her fingers trace up towards your wrist, when suddenly, she stops.",
			"\"Well, I'm sure you know how to use it,\" she says, and you swallow, as she rounds the counter again, her skirt trailing behind her.",
			"She returns to her position behind the counter and stares at you, smiling brightly, but silently.  You start to turn away, and she finally speaks.",
			"\"Thanks for coming!\" she says, waving to you as you leave, having procured the necessary - you hope - supplies.",	
		]
	},
	{
		"key": "STORY-006C",
		"scriptLines": [
			"?!",	
		]
	},
	{
		"key": "STORY-007",
		"scriptLines": [
			"...",
			"..",
			".",
			"With weapon in hand, you set out.  First stop - someone who will teach you magic.  You could ask the townsfolk for a suggestion... but you have at least one option in mind: Meri, a magician your mother once travelled with, who now lives as a recluse a few days east, near the foot of the Burle mountains.",
			"You leave the town, feeling more full of gumption than you ever have before."
		]
	},
	{
		"key": "STORY-WITCH-COTTAGE",
		"scriptLines": [
			"You manage to track down Meri's cottage - it being far on the opposite side of Nadir from your own humble hovel, you've never had an overwhelmingly compelling reason to come by here, and plenty of reason to stay away.",
			"Your curiosity about your mother had long since been overruled by your self-preservation, as Meri had a reputation for making boys like yourself... disappear.  Whether it was something truly sinister or simply the murmurs of an ignorant peasantry jumping to conclusions about a local witch, you didn't want to chance it.",
			"Faced with few other options now, however, you decide to give the old witch a chance - and remind yourself not to call her that to her face.",
			"Her cottage is excessively plain - but there's an air of palpable... malice to it that you can't shake off.  You warily approach the door, one hand on your sword's sheathe, the other balled in a fist against your chest, which thumps steadily and powerfully.",
			"You reach out said hand to knock, unwilling to remove your grip on your scabbard, and a hair's breadth away from the door, you hear a voice which stops you cold, as if frozen - \"come in,\" it says, merrily, inviting.",
			"You drop your fingers down, slowly, carefully, to the door handle, and, after catching your breath, you push it open.",
			"The inside of the cottage smells... rather pleasantly, actually, and it's much, much hotter than the autumn breeze outside.  As the door closes behind you, in fact, you feel an overwhelming sensation of comfort and familiarity, even though the inside of the cottage is wholly unfamiliar to you.",
			"It's a bit like you expect a witch's cottage to be - in that it surprises you entirely.  The surfaces are immaculate, the fineries are quite fine, the upholstery looks pristine and expensive, deep blacks, oak browns, and fresh blood reds - it's the last thing you would expect on the outskirts of a town like Nadir.",
			"There are, you eventually notice, some of the expected collections of a witch - tomes, less musty, but tomes nonetheless, and magic circles scrawled on the walls and floors, and great, beautiful crystals and orbs, each poisoned on top of a holder, some large, some small, delicately enough to make you anxious."
		]
	},	
	{
		"key": "STORY-WITCH-COTTAGE-MERI",
		"scriptLines": [
			"And then, finally, you spot her, as a shadow darts across the floor and then seems to disappear beneath her garments.  Even wearing a full-length robe, the curves of her body are visible and... otherworldly.  No doubt the work of some foul magic.",
			"She turns to face you, looking away from a spherical crystal - or is it an orb? - a smile on her lips, and a hunger in her eyes.  You smile politely at her and nod.",
			"You didn't expect her to be so... voluptuous.  In fact, you had kind of expected her to be old and grizzled by now, like your mother's class trainer - instead, she doesn't look like she's aged a day since you were a child.",
			"\"My, my.  Look who's all grown up.\", she says, her voice deep, her presence large.  Not exactly the slightness you would expect of a mage.",
			"You find it difficult to respond - something about her presence is... intimidating.  She has long, goldenrod hair, bright blue eyes, an impressive chest, and flaring hips that lead into long, lithe legs.  She strikes a powerful figure, and the way her gaze fixes on you makes it near-impossible to return.",
			"\"I remember you.  My, you look just like your mother.  Mmm... I love a man that looks anything but,\" she says, pumping her hips as she walks over to you, her heels striking a pleasant tone against her hard, wooden floor.",
			"She grabs you by the chin, and turns your head to inspect you.  You finally work up the nerve to speak.  \"I'm an... enchanter now,\" you say, and she smiles politely, releasing your chin.",
			"\"Enchantress.  But go on,\" she says, snapping her fingers, producing some phantasm of darkness that swirls around her fingertips like an ethereal bat, before she grabs hold of it and it vanishes in a cloud of nothingness.",
			"\"That's... that's why I'm here,\" you say, alluding to both your recent class change and the casual display she just put on, \"I'm interested in magic.\"",
			"She giggles silently, bringing her hand lazily up her thigh, then pointing a long, sharp-nailed finger at you, flicking it upwards in a gentle arc.  You feel an immense pressure pushing you back - your shoes slide along the floor, until your entire body is spread against her closed door, as if the pull of gravity has changed directions.",
			"\"Everyone is interested in magic,\" she says, \"but not everyone gets to meet a magician.  Aren't you interested in me?\" she asks, curling her finger back around to gesture for you to come to her - a beckoning which you literally cannot ignore.",
			"You're pulled inexorably towards her, until your close enough to smell her sweet breath, and further, until you're nestled between her breasts, your body pressed against hers, her arms slowly finding their way around your waist.",
			"\"I... I know you travelled with my mother,\" you say, looking up from her breasts to her face, as she peers down at you serenly.  She smiles.  \"Didn't you?\"",
			"She runs her hands up your chest, your neck, and clasps one around the back of your neck, and rests the other behind your head.  \"I did.  And do you think she was so oblivious to my charms?\"",
			"You swallow.  Looking into her eyes... you feel... you can't move, you can barely think.  Something is stirring beneath her robes... something... alive...",
			"...",
			"..",
			".",
			"\"Rise and shine, boyo,\" she says, and you realize that at some point, your eyes closed... and, in fact, you're laying down on a long, cushioned seat in her cottage.  You feel your body - nothing appears to be missing - and you look around.",
			"The room is as it was before, but now that you're further in, you can see some of the strange instruments laying about, as well as a ring of iron, the height and width of a person, mounted on a wall.",
			"You also find the source of the voice, and it's her, the witch, Meri, standing in front of one of the orbs, her eyes closed, her lips curled into a smile.",
			"She's surrounded by a kind of other-worldly light, her robe lifting in some impossible updraft, but then, it subsides, and the high ringing you had heard dissipitates.  ",
			"\"You've been asleep a while.  I took the liberty of probing how awakened you are.  The answer is... not very, but enough.  The only question that remains is... what will you give me in exchange?\"",
			"You sigh.  \"I don't have money.\"",
			"She rolls her eyes.  \"I don't want money.  You have what I want,\" she says, sitting down next to you, and running her hand up your thigh.",
			"You swallow.  She nearly gets to your erection, to the point of caressing it through your pants, and stops.  ",
			"\"But... this first spell will be for free.  A spell that lets you channel magic into pure flame.  Just the kind of thing a mercenary like yourself can use,\" she says, running her finger down your chest.",
			"\"I'm not a mercenary,\" you say, and she puckers her lips.",
			"\"Bounty hunter, then?  You're so cute, you know?\" she says, leaning forward and kissing you, on the lips.  You feel... something flow into your body, down your throat, and into your chest - a warmth that spreads, and then a heat that sears.",
			"You pull away, but your throat is too burned to speak or even make a sound, and steam rises from mouth.  You tighten your fists in pain, and feel the fire spread even there, to the tips of your fingers - until it becomes unbearable, and your fists are flung open, your fingers spread, and flames begin to whip around, as if held in the palms of your hands.",
			"Panicked, you stumble backwards, thrashing around in the vain hope of extinguishing the flames on your hands - when your eyes catch Meri's gaze.  You freeze in place, although you can feel the fire rising in your throat, and you hear a simple command from Meri, though her lips never move.",
			"\"Swallow it.\"",
			"You close your fists.  You swallow as hard as you can, and the fire gets deeper, deeper inside... until it's just a heat again, sitting in your belly.",
			"In the distance, you hear Meri clapping.",
			"\"Congratulations!\" she says, smiling fakely. \"Now, you're a true spellcaster. Don't spend it all at once,\" she says, and you feel ready to pass out.  You start to stumble towards the door.",
			"Compared to the the class change, this was... substantially less pleasant.  You reach the door, and Meri doesn't even try to stop you.",
			"\"That won't be all the magic you need, you know.  But... it will get you started.  I'm sure you'll find your way back to me eventually,\" she says... and before you know it, you're standing outside of Meri's house, even though you don't recall opening the door.  Even stranger... there's fresh snow on the ground.",
			"You learned Combat Fire!",
			"You can now use Incantation to enter a Casting stance!"
		]
	},	
	{
		"key": "STORY-WITCH-COTTAGE-VISIT",
		"scriptLines": [
			"You return, hoping to perhaps learn new magicks... but the mysterious witch is nowhere to be found."
		]
	},
	{
	"key": "STORY-FIGHT-FIRST",
		"scriptLines": [
			"The forest is quiet, but somehow unfamiliar.  The world outside of the small town where you've lived your entire life feels unfamiliar, in fact.  The trees are the same here, the ground, the air... but you can't shake the feeling that nothing is the same at all.",
			"You're finally leaving town... with a weapon in hand, and a class to your name.  You feel... unstoppable.  You'll gladly face death if it means being able to fulfill your destiny, the one that you've been ignoring for so long.",
			"You come to a small clearing in the forest... and you hear a cackling.  You reach for your scabbard.  The voice sounded... almost human.  But not quite... and the malice was unmistakable.",
			"You look around, trying to track the source - your entire body tenses, the pounding of your own pulse drumming your ears, the crunch of the soil underfoot such a burdensome distraction that you keep perfectly still.  This is it.  Your first battle.",
			"The scabbard shakes as you grip it, as if you were shaking, but that can't be.  Your mind is focused, your spirit is willing, and as soon as you see the fangs and claws, you'll know what to do - or so you think, when suddenly, a figure emerges from behind a fallen log... and you immediately recognize how it had been hiding behind it."
		]
	},
	{
	"key": "STORY-FIGHT-GOBLIN",
		"scriptLines": [
			"It's... a little green goblin.  From the proportions, it looks like a female.  She's stumbling around, laughing... there's no doubt about it - she's drunk.",
			"\"Heya! Hey! You! The boy with the fat butt!\" she says, before immediately laughing herself silly, apparently finding the reddening of your ears hilarious.  \"Why don't... you don't... why don't...\" she slurs, and then falls over, her loincloth falling out of place to give you an eyeful.  You're apparently not the only one with some junk in the trunk.",
			"You start to relax your grip on the hilt of your sword when, in a startling moment of sobriety, she kips up to her feet.  Moreover, she pulls out a small dagger and licks the blade.",
			"\"Ya didn't see that!\" she says, cutting the air clumsily.",
			"She's... pathetic.  A half pint without even a proper weapon, taking on someone twice her size... while drunk.  This couldn't be any easier.",
			"\"Wanna play with me?  Nyaha!\"",
			"Her skin's green, so it's hard to tell, but... it seems like she's blushing.  How she wasn't already blushing while drunk like juice or when she flashed her ass at you, you don't know.",
			"You ready your weapon.  There's no point in trying to argue with a bratty, maniacal half-pint.  If you can subdue her, maybe you can talk some sense into her."
		]
	},
	{
		"key": "STORY-FIGHT-GOBLIN-VICTORY",
		"scriptLines": [
			"She's still, unmoving... until suddenly, she explodes into frenetic action.  \"Hey, hey!  I think I sobered up!  What's for dinner?  Nyaha!\"",
			"You watch her warily as she picks up her things, barely seeming to register that she just lost a vicious battle.",
			"\"I thought you were dead!\" you cry, and she stops, and cocks her head to look at you, like you're the crazy one.",
			"\"0 HP doesn't mean 'dead', doofus, or you'd be stepping over adventurer corpses on your way to the adventurer corpse burrito stand next to the adventurer corpse disposal facility,\" she says, painting a mental image that you neither like nor appreciate.",
			"\"Then... what?\" you say, almost speechless.",
			"\"It means you can't fight anymore!  There's a pretty big gap between 'out of the fight' and 'dead'!  We don't use numbers for that.\",",
			"\"But... you're bleeding...\"",
			"\"Oh, don't worry about that.  You'll trip over as many rocks as stanching agents.  And I'm a gobbo, so I've got super healing!\" she says, demonstrating by wiping her bloody arm... only to reveal that underneath the blood, her wounds are already bloodless.",
			"You close your eyes.  It all makes sense now.  Adventurers aren't all stalwart, fearless heroes... they just don't suffer from permadeath.  You nod to yourself, silently.  You feel like you've already learned so much.",
			"\"Anyway, ya beat me!  How's it gonna be then?\"",
			"You blink twice.  \"How's... what gonna be?\"",
			"\"Nyaha!  Don't be coy!  How do you like your gobbo - stuffed or filled with cream?  Or are you one of those fey boys that wants a buttered up gobbo cock right up the ass?\"",
			"\"Huh?!\" you exclaim, flabbergasted.  You have no idea what she's talking about - is she... is she coming on to you?",
			"\"Come on, pinkskin! Whip it out!\" she says, slapping her palm against the bulge in her loincloth, apparently indicating what, exactly, you should whip out. \"Or I'll whip mine out and give ya a big, fat GAME OVER where it counts!\"",
		]
	},	
	{
		"key": "STORY-FIGHT-GOBLIN-VICTORY2",
		"scriptLines": [
			"You... run.  You turn heel and make a break for it.  What is she talking about?  Why does she just assume...",
			"Your thoughts can barely catch up to you, the stinging of the cuts on your face from the battle and the branches are so much more immediate than the confusion that trails you like the mist off someone emerging from a hot bath into the cool air.",
			"You can picture her... a goblin, emerging from the water, looking bashful, but confident... tumescent... and you shut your eyes to block out the image.  This proves unwise for two reasons - the first, that you can still see her in your mind's eye, and the second, that you almost immediately crash into a tree, knocking yourself to the ground.",
			"You lay on your back, thinking about what the goblin suggested.  Not only did she fully expect for you to ravage her... she even suggested... you can picture her bulge.  You doubt there was a banana hiding under her loincloth.  If she had won...",
			"You thought that death and dismemberment were par for the course... but... was that goblin just spouting off her own twisted, warped views, or... your sphincter tightens at the thought.",
			"You close your eyes. This is going to be a long journey.  You exhale slowly, hearing the chirping of birds and the rustling of leaves in the forest... and, thankfully, not the pitter-patter of a goblin coming to make good on her promise."
		]
	},	
	{
		"key": "STORY-FIGHT-GOBLIN-DEFEAT",
		"scriptLines": [
			"...",
			"..",
			".",
			"Inch by inch, it slides into your anus.  Your wrists, knees, and cheek lay against the dirt, and you disbelievingly accept it.  You lost to a level 1 goblin.",
			"Somewhere, in a far off place, brave adventurers are fighting amazing, spectacular battles against dragons, and monsters, and gods.  But, you?",
			"You feel the warts as they slide in, and you know you're going to feel them as they slide out."
			"\"Nyahaha!  Gonna breed your butt good!  Gonna fuck you in the ass every night, 'hero'!\"",
			"\"She\" bottoms out, and you feel them, \"her\" testicles.  Packed with enough semen to give a newly-minted adventurer's bowels a white-washing of shame.",
			"She makes good on her promise to fuck you in the ass every night.  You're a stone's-throw away from home, but rather than return with the shame, you remain the goblin's undignified, humiliated fucktoy.  She constantly reminds you of your pretensions to herodom... all the while crushing your prostate with her low-level enemy dick.",
			"You end every night with your balls coated in her semen, and never expect otherwise come the dawn.",
			"CLASS CHANGE!",
			"Enchantress -> Goblin Fucktoy",
			"...",
			"..",
			".",
			"GOBBO DICK OVER."
		]
	},	
	{
		"key": "OGRE-WARN",
		"scriptLines": [
			"You come across an old, wisened man on the side of the road.",
			"\"Oagh, boy, there's an ogre thataways.\"",
			"\"What do you mean, there's an ogre 'thataways?' Surely there's more than one way through a forest.\"",
			"\"Look'n, I'm not a cartographer, y'here?  All I know is, y'wander in that direction, y'll be fartin' ogre cum till the last of yer days.  Heed m' warning or not, I don't figgy care.\"",
			"He walks away, giving you a rude gesture."
		]
	},
	{
	"key": "STORY-OGRE",
		"scriptLines": [
			"You ignored the old man's warnings - there's no telling how accurate a rumor from a random stranger could possibly be.  The path has been relatively clear thus far... and quiet.",
			"The air has gotten thick - there's a scent you can pick up that's only getting stronger the more you travel on.",
			"You hear a loud thud.  Then another.",
			"The ground begins to shake with each one... whatever it is, it's absolutely huge.", 
			"You hear a low, deep growling... seems the old man was right after all.",
			"Is this... a meat gate?",
			"You're extremely hesitant to continue... an ogre sounds like it's far outside your capabilities at the moment."
		]
	},
	{
	"key": "STORY-OGRE-DEFEAT",
		"scriptLines": [
			"...",
			"..",
			".",
			"The ogre's massive cock bores into you as he lowers you down onto it over and over again.",
			"The length and girth of it is visible as it slides up and down in your abdomen.",
			"Your hole is stretched beyond recognition - it's unlikely it will ever return to its former shape or tightness",
			"All the while, you feel it bubbling up your cock, which bounces uselessly in the wind.",
			"You try to resist, but to little avail - you fling your spunk into the air as you are bounced, full body, onto the ogre's massive schlong.",
			"It seems, indeed, the ogre was a meat gate... your only miscalculation was what the 'meat' entailed.",
			"He roars, apparently nearing climax.",
			"You feel it pulsing within the massive cock inside of you even before you feel it glurg out inside, filling every last crevice and nook of your intestines with the ogre's salty load.",
			"He pulls you up by your hair, slowly, as you feel his totemic rod pulse within you, filling you with creamy, disgusting ogre spunk.",
			"This is... not ideal."
		]
	},
	{
	"key": "STORY-OGRE-AFTER",
		"scriptLines": [
			"As he pulls you off, a flood of ogre cum rushes out of you, and you twitch, unable to move under your own power.",
			"...",
			"..",
			".",
			"GAME OGRE."
		]
	},
	{
	"key": "STORY-MERCHANT",
		"scriptLines": [
			"The merchant smirks at you.  She seems to have something untoward on her mind.",
			"She offers you a look at her wares, so you take a peek."
		]
	},
	{
	"key": "STORY-FEM",
		"scriptLines": [
			"You come across a fellow traveller on the road, clad in ostentatious armor, riding what appears to be a giant bird.",
			"As they approach, you think they might be a woman, or a man... and by the time they're within ear-shot, you can't tell.",
			"\"I'm traveling to some dreadful place called Nadir. I'm told a powerful mage lives there that I must consult. I'll be coming back this way as soon as possible,\" they explain, unbidden.",
			"\"I'm crossing the mountains to the northeast, on a quest,\" you say, and they nod, seemingly only half-listening as they look down at you.",
			"\"Good, good. I'll have need of servants.\"   They brush their hair out of their eyes and peer at you.  \"What are you, some kind of... spellsword?\"",
			"You think about it for a moment.  \"Let's go with that.\"",
			"\"Hmph.  Magic... it'll turn against you, someday.  Where are you off to?\" they ask, as if you haven't already said.",
			"You look off, towards the mountains in the distance, barely visible through the treeline - the first major hurdle in your journey. \"I'm going to slay the Demon King.\"",
			"They nod slowly, then scoff, hiding their chuckle behind a gauntlet.  \"Are you... serious?  Alone?\"",
			"You stare daggers at them.  \"Yes.  Why?\"",
			"They draw their sword - a blinding light reflects off the blade and you shield your eyes.  \"You'll never even see the Demon King's gate. If you step foot in demon country at all, it'll be as a slave.  But...\" they say, holding up the point of the blade in your direction, \"...if you join me as a servant, you just might stand a chance.\"",
			"\"You're... you're also on a quest to slay the Demon King?\"",
			"They smile, then sheathe their sword again. \"Nothing so pedestrian.  But I may, while I'm on to bigger and better things, make a quick stop at the Demon King's castle.  If I happen to take their head while I'm there, you could bask in some of the residual glory.\"",
			"\"So... you don't care what happens?  You just want... a trophy?\"",
			"They sneer.  \"I'm sure you're very different.  A paragon of virtue, destined to make the world a better place.  It's purely coincidence that before you began your quest you were a miserable layabout,\" he says, bitterly.  \"Please, save your sanctimony.  Will you join me, or should I be going?\"",
			"You shake your head.  They snicker.",
			"\"Well then.  Maybe next time,\" they say, turning to leave.  You watch them disappear around a bend in the trail, and, feeling a little hurt, continue on your own way."
		]
	},	
	{
		"key": "CROSSROADS",
		"scriptLines": [
			"You come to a crossroads.  There are several signs pointing to various far-off locales, but of particular interest are the two marked \"West Pass\" and \"South Pass\".  Strangely, \"South Pass\" is to the East, and \"West Pass\" is to the North - but you can see the distant breaks in the mountains to the Northeast.",
			"The pass to the North is less traveled, but shorter - the pass to the east is a long haul, but the mountains in either case aren't particularly treacherous to cross, and the weather is mild.",
			"Which way will you go?"
		]
	},
	{
		"key": "WEST-PASS",
		"scriptLines": [
			"The west pass.  It's... very westy.  THANKS FOR GETTING THIS FAR GAME IS DEVELOP STILL MANY LOVES IDDDDDDD"
		]
	},
	{
		"key": "SOUTH-PASS",
		"scriptLines": [
			"The south pass.  There's a long journey ahead, but it's not done yet, so have this complimentary crab () . . ()"
		]
	},
	{
		"key": "TOWN",
		"scriptLines": [
			"Whoa! Didn't expect you to get here already.  This game is still unfinished, you know?  Anyway, thanks for playing already!  If you ran into any issues, please let Majalis know, either by posting on itch.io, Patreon, or popping into our discord server!  Anyway, keep your eyes out for easter eggs for enterprising players such as yourself!"
		]
	},
	{
		"key": "GADGETEER-00",
		"scriptLines": [
			"You come across a travelling merchant.  Or, at least, you think she's a merchant, as she's carrying a massive sack filled with... what look like weapons, although not any kind of weapon you've come across before.",
			"\"Hey there!\" she says, waving you down, and you approach cautiously.  When you get within speaking distance, you see that her eyes are strange, somehow inhuman.  Otherwise, aside from her rather prominent figure, you don't notice anything odd about her - only about what she's carrying.",
			"\"Uh... hail.  Are you, by any chance, a merchant?\"",
			"She smirks. \"You could say that.  I'm more of a peddler.\"",
			"\"Can I... see your wares?\" you say, eyeing some of the more... exotic looking items she's carrying.  You're not sure what they're for, but your throat tightens as you stare up their length - and so does another part of you.",
			"\"Go for it!  Let me know if you see anything you like.\""
		]
	},
	{
		"key": "GADGETEER-01",
		"scriptLines": [
			"\"What do you think?  Pretty cheap, huh?\" she says, and you blink, unsure.  The vast majority of what she's carrying doesn't appear to be for sale - so why is she carrying it?",
			"\"Huh?  Oh, yeah... this is cheaper than in town... but, what about all that?\" you say, gesturing to the... rather obvious items filling her backpack and hanging from her waist."
			"\"Wha? You mean these toys?  Oh, these aren't for sale.  They've already been sold.  Some maniac who gets off on emasculating men,\" she says, eyeing you up and down.  \"Hey,\" she says, and you look back at her, your eyes wandering towards the \"toys\".",
			"\"What?\" you ask, and her eyes narrow.  She shifts the bag she's carrying on her back, and gives you one more once over.  ",
			"\"You seem really curious.  They're not for sale, but... maybe you'd like give to them a test-run?\" she says, licking her lips."
		]
	},
	{
		"key": "GADGETEER-02",
		"scriptLines": [
			"You meekly nod your head - deep down, you know exactly what those toys are for.  She laughs coyly, and gestures her finger for you to turn around, dropping the bag to the floor.",
			"\"You seem so well experienced...  I don't think even my biggest toy will give you what you want. You don't just want things in your ass... you want to be -fucked-, don't you?\"",
			"You nod, again, and she smiles ear-to-ear.  She rifles through her bag - apparently this is not a toy she often has at the ready - and finally pulls out a pair of belts.",
			"The first has an obvious, blunt object affixed to it - the other instead has a interlacing rings in the same place instead.  She adorns the one with the smooth, black object, and then retrieves a vial from the bag.",
			"She coats the nub with it, smiling all the while.  \"Mmmhm, take it all off, cutey.\"",
			"You strip as quickly as you can, your hands and knees trembling.  The cool air on your skin gives you goosebumps, but she's still fully clothed - well, relatively.",
			"\"On your knees, sweetie,\" she instructs, and you drop to your knees unable to stop yourself, followed by your hands in the dirt.",
			"She squats behind you, steadying herself with a flat palm on your fat asscheek, and then, with a single thrust, she plants the fullness of the stiff black nub in your rectum.  She thrutsts it once, twice, three times against your prostate, and you're almost immediately a babbling, incoherent mess.",
			"With each thrust, you feel utterly emasculated - over and over again you've been violated anally, but now someone without even a cock is still treating you like a cocksleeve.  The pressure she puts on your prostate is unbearable, and you reach between your legs to stroke yourself to finish the job.",
			"She leans forward and grabs your hand, pulling it away.",
			"\"Nuh-uh!  No stroking.  Ass only,\" she says, spanking your ass to punctuate her point, followed by a deep thrust for emphasis.  \"I like my boys to cum like girls, so get to it, kay?\" she says, and you do feel it coming on... but you can't help yourself.  Again, you reach to stroke it... ",
			"She stops thrusting for a moment, and gives you another spank.",
			"\"If you won't stop stroking it...\" she warns, and you let go... but it isn't long before you can't help yourself again.",
			"She stops, completely, and then pulls out.  She unclips something from her belt, and shows it to you, rotating it in her fingers to give you a full view of it.  It's some oddly shaped golden cage.",
			"\"I'm not going to fuck your ass any more until you fit that misbehaving little noodle of yours into this cage.  So we're going to sit here and wait until it calms down,\" she says, and you warily sit on the ground, bemused.",
			"She sighs.  She sits on the ground as well, facing away from you, and fiddles with the objects in her bag.  You wait, patiently, for your erection to die down, but it's still pretty hard, even just sitting in the grass.",
			"Your ears perk up as you hear her moan softly, and you realize that she's put something down her pants... and you realize that one of the phallic objects that was hanging out of the bag is missing.",
			"She moans, and groans, and coos... and you watch, fascinating... but, slowly, but surely, you grow soft.",
			"Somehow sensing that, she stops her show, and tosses aside a foot-long object that she'd apparently been indulging herself with, before stomping back over to you, the cage in hand.",
			"\"With nothing in your ass, you eventually go soft... hm.  How embarrassing.  Oh well, in the cage it goes.  Let me not talk too much about being buttfucked or you'll blow it up again,\" she says, reaching between your legs with the cage.  ",
			"*click*",
			"With that, she rattles the cage to make sure it's securely shut, and to demonstrate that it won't come off.  \"Sorry, useless dick.  You got the wrong owner.\"",
			"She smiles at your flaccid dick trapped within the cage, and flicks it again.",
			"\"Now where were we?  Oh yeah!\" she says, and rolls you over onto your back.  \"Hrm, I'm gonna need a bigger strap-on...\" she says, eyeing your still-open hole and your caged cock, \"one minute!\"",
			"Back to the bag she goes, before taking off the belt and retrieving from the side of the bag a massive, horse-cock shaped dildo.  She fastens the ring-belt onto herself, and then, to your horror, she fastens the fake horse cock to it.",
			"She stalks back over to where you lay, hosts your legs up, and spreads her knees as far apart as possible, so that your hole is aligned with the punishment dildo.",
			"\"Mmmmm... now I've got plenty of time to enjoy this...\" she says, and you don't know what she's talking about, but you have little time to spend figuring it out - the flared head of the dildo presses up against your recently fucked-silly sphincter, which starts to give.",
			"\"Ahh... agghhhhh...\" you groan, feeling it sink into you, inch by inch, a visible bulge appearing on your stomach as she pushes the horse-shaped and horse-sized fake cock up in your abdomen.  Your cock tries to harden, but to no avail, and your eyes water.",
			"She begins to bounce you up and down, sliding the shaft in and out, and your caged cock bounces freely with the rhythm, slapping uncomfortably downwards without any hope of becoming erect.  ",
			"It's pure torment.  Without being able to become erect, the fullness is just too much to bear, and you quickly find yourself squinting your eye, your body as limp as your noodle, your ass too full to take.",
			"She seems to enjoy watching you struggle to get a boner unsuccessfully with the fattest and longest of dildos see-sawing in and out of you, and you feel like you're going to lose your mind... but, strangely, you don't want her to stop.",
			"Soon your entire body is ablaze, a heat somewhere in the middle spreading outwards, your stomach bulging from the tremendous toy, your lips drooling and your head spinning.  You have no idea how long she fucks you, but by the end of it, you want nothing more than for her to take off the cage and let you, unequivocally, blow nut.",
			"\"Oh, the key?  I don't have it,\" you hear, a million miles off, as she slides the thing out of you, apparently having had her fill.  She begins to put her affairs in order when finally your mind returns to the world of Man.  \"I left it back home... in Pearl's Gate.\"",
			"You heart sinks into your chest.  Pearl's Gate - the exiled demonblood village - is far, far away.",
			"\"I'd be willing to retrieve it for you... if you accompanied me, of course.\"",
			"\"But... my mission...\" you say, looking down at your flaccid penis, trapped in a metal cage with no room to grow. Your quest is of such vital importance... but...",
			"\"Oh, well, go your own way if you must. Besides, I'm sure an anal queen like you can make this work,\" she says, tapping against the cage gently with her finger. \"Of course, if you come with me, I can give you a little help with that...\"",
			"Your brain can barely understand anything - you only want to get out of the cage.  What will you do?"
		]
	},
	{
		"key": "GADGETEER-03",
		"scriptLines": [
			"You agree to come with her, and that seems to satisfy her.  She continues to fuck your ass, your cock's cage clanking about, preventing you from being satisfied, until, eventually, she withdraws, having fully explored your well-travelled canyon.",
			"You end up travelling with the eccentric merchant... on the way to Pearl's Gate, you end up forgetting why you ever wanted anything but to be her toy.  You never end up getting erect again, although that doesn't stop you from dribbling cum out of your cage while she fucks your ass with her exotic toys.  ",
			"Having lost sight of your goal, your mission ends in failure."
		]
	},
	{
		"key": "GADGETEER-04",
		"scriptLines": [
			"\"S-sure,\" you say, unable to resist.",
			"\"That's what I thought!\" she says, having apparently smelled the bitch on you.  She could tell you were looking for something in her bag that would feel good in your ass.",
			"\"W-what do you have...?\" you ask, and she smiles broadly.",
			"\"I've got all kinds!  This one's guaranteed to cross your eyes... this one'll make you knock-kneed, and this one's modelled after a stallion, for extra comfort.\"",
			"\"I... well... I don't know about those...\" you say, a bit of trepidation creeping into your voice.",
			"\"Hm?  You don't like taking big things up the ass?  Mmm... I don't believe you,\" she says, smugly.  \"Well, we can work our way up,\" she says, dropping the bag to the ground before grabbing one about the length of... well, a big penis, from inside, along with a clear vial.",
			"You eye her suspiciously as she pours some of the vial over the tip of the faux-phallus.",
			"\"Well?  What are you waiting for?  Drop your pants, bend over, and spread those cheeks!\" she says, chirpily, waving you over to a nearby tree, apparently for support. ",
			"She grabs a device from within her bag, but you don't see it, as you're too busy getting set up, spread legged and bent over, against the tree.",
			"First comes a butt plug, and not a small one - you feel it spreading you open as it enters you, and you groan.  But that doesn't last long, soon, it's out, and another, larger one has taken its place.",
			"One by one, she uses bigger and bigger butt plugs and dildos in you, always stopping just before you can properly get off.  Finally, she sighs.",
			"\"Hmmm... seems nothing's working.  Maybe you're just not a toy kinda boy,\" she says, in a flirty tone.",
			"\"What do you mean?\" you ask, still a little sore from the fore-arm length toy she'd just been jamming between your legs and up your hole.",
			"\"Maybe you... need something a little more lifelike,\" she says, and you warily check the area between her own legs, just to be sure... but you don't spot anything obvious there.  \"Not on me, silly.  I just happen to have a big toy with a pump... here, I'll show you,\" she says, bounding over to the bag, her partially uncovered breasts bouncing along with her soft tush.",
			"She withdraws from it a rather sizable toy... which looks like some kind of animal phallus.  It's attached to some kind of big opaque container, as well as hand-operated pump.",
			"\"Ta-da!\" she says, bringing the whole aparatus over in her arms.  \"It's a bull penis replica.  Nifty, huh?\" she asks, and you stare at it, unsure.",
			"\"That's... a bull's...?\" you say, having never seen one before.",
			"\"Well, a replica, but yep!  And it's going inside of you.  How does that make you feel?\" she asks, leaning in close to your face, her breath sweet and her voice full.",
			"You don't say anything.  You're mesmerized.  She lubes up the bull toy, and then spreads your cheek with one hand and begins to work it up into your anal canal with the other.",
			"Your toes curl as you feel it enter into you - the texture and shape are so different.  Your mouth is agape, unable to cope with the sensation, and your breath is ragged.",
			"\"You like the idea of someone firing off a potent load right up your ass, don't you?  Well, I say 'someone', but you'd be fine with animal, wouldn't you?  Just a mean, big, animal with a nice big cock and big full testicles, ready to offload in your asshole like a pussy.\"",
			"Your mind reels.  Is she right?  You feel the pressure building inside of you... are you really going to cum because of just the idea of a bull mating you?",
			"\"You wanna be bred, don't you?\" she sneers, mocking you.  ",
			"\"Yes...\" you say, unable to hold back, as the fake bull penis slides in and out of you.",
			"\"Hey, didya wonder what was in this thing?\" she asks, patting the opaque container.  She grabs the pump, and starts to give it a go, and you feel the toy expanding with the liquid now filling it. \"Uh-oh... looks like Mr. Bull can't tell your fat ass from a heifer's!  He's gonna cum!\" she says, happily pumping away.",
			"\"What's... what's in it?!\" you ask, getting nervous.",
			"\"Why... it's grade-A bull semen, of course!\" she says, maniacally, just as you feel the rush of liquid inside your colon.  \"Milked the bull myself!  Wish I could see the look on your face right now...\" she says, as the runny liquid fills up your guts to the point of bloating.",
			"Needless to say, you cum.  The shock and shame of being pseudo-inseminated by a bull is too much.  You spurt all over the tree, and then collapse.",
			"\"Mmm... look at you,\" she says, as you lay, face down, in the dirt, your ass gaping open. \"You look like you just got buttfucked by a bull.  I guess, indirectly, you did.  I bet that bull had no idea where his load was going to end up, and I doubt he'd have guessed in some horny boy's ass.\"",
			"It drools out of you slowly.  You take some solace in the fact that a bull's cock didn't put it there... but being chock-full of bull semen was not on the agenda for the day.",
			"\"I won't charge you for the bull spooge.  Consider it a gift!\"",
			"She packs her things, and leaves you with your bull spooge, and a mighty sore asshole."
		]
	},
	{
		"key": "GADGETEER-05",
		"scriptLines": [
			"\"Uh... maybe...\" you say, still hesitant.",
			"\"No need to be coy... I can tell you've been down this road before.  With a human, I hope - or do I have a monster to thank for... opening you up to new possibilities?\"",
			"You stay quiet, for a bit... you know exactly what she's offering now."
		]
	},
	{
		"key": "GADGETEER-06",
		"scriptLines": [
			"\"Mmmm, you are one confused little darling, aren't you?\" she says dropping her bag to the ground.  She grabs hold of one of the toys dangling from within, and slowly pulls it free - a long chain of balls strung together. ",
			"She directs you to a nearby tree-stump and has you lay on your back on it, while she retrieves a vial full of some strange gel from her bag of tricks.",
			"You get halfway through pulling down your pants when she hoists up your legs, and you feel her rub the first ball of many, slick with something, against your hole.",
			"\"One at a time,\" she says, smiling placidly... as she feeds the first one in, and then the second, and then the third...",
			"She pops the beads in one after the other, and you feel your rectum start to fill and sag with them.  ",
			"All at once, she pulls them out, sending a charge up your spine, your hole unable to cope with the rapid expansion and contraction until the very last bead is out, at which point it remains confusedly open, convulsing slightly.",
			"And then, she brings the first to your gaping hole, and begins to feed the whole thing in again.",
			"Again, every single ball finds its way into your distended rectum, and again she pulls them all out in one go, making you cross-eyed with over-stimulation.",
			"\"Mmm, what a little slut,\" she says, noticing how your cock is dripping with anticipation for something... more.  ",
			"\"I'm... not a slut...\" you protest, but she puts a finger to your lips - and you notice that her finger is slick like the balls on the string.",
			"\"And do you know what sluts need?\" she asks, although she doesn't wait for the answer. \"Sluts need easy-to-use holes.  And what better way to make your asshole easier to fuck than with a big, fat, buttplug?\"",
			"You stare in awe as she unbuttons the hilt of the massive, shiny black thing on her hip, and she runs her fingers over it, coating it in jelly.",
			"\"That's... too big,\" you note, your voice flat, your eyes wide.",
			"\"Not with this slime goo it's not - although you'll probably be sore for a few days after having some fun with this big guy,\" she says, reaching under you to find your still slightly-open hole.",
			"She brings the plug down to it, and you feel like she's trying to push you through yourself and out the other side.  You spread your legs instinctively, throwing your head back, your teeth grit, as the big, inert plug is pushed inside.",
			"You nearly pull the bark off the stump as she slowly teases it into you, until you have no choice but to bite your knuckle as the fattest portion of it slips inside.",
			"\"There we go... all snug,\" she says, with a glint in her eye.  Your hole spasms uncomfortably around the base of the big thing lodged inside, and you try to adjust to it... but then, she grabs hold of the flared base, and begins to turn it.",
			"She twists the butt plug inside of you, spinning it over and over again, making you moan hoarsely with humiliating pleasure.",
			"\"Mmmm... how's that?  Gonna spew into the air?\" she asks, watching your cock twitch and jerk upwards with each rotation of the monstrous plug.",
			"She taps repeatedly on the plug's flared end, causing it to vibrate inside of you... and you realize that her insistence that the plug will make you anally ejaculate is anything but an idle threat.",
			"She stops twisting it, and slowly pulls it out... a quarter of the way... half of the way... and then, she pushes it back in, and you take in air which can't escape your lungs.  Then she pulls it out, again, gently... about halfway... and then back in it goes.",
			"This time, the sensation proves too much, and you thrust your hips upwards, the cum bubbling and frothing out of your untouched cock, while she keeps hold of it, twisting it inside of you like a key in a lock.",
			"You grit your teeth as you cum, your sphincter tightening around the plug - and it seems like she'll leave it comfortably in until you're done when, without warning, she yanks it out, and you accidentally fire the thickest shot of semen of your life.",
			"With the froth of cum dislodged by your sudden shot, there's a pool of cum at the base of the stump, and a line of it stretching out a few feet.  Your whole body is coated in sweat, and you shudder and convulse, but she calmly shakes off the wet plug and clips it back into place, apparently satisfied.",
			"\"There.  Now it'll be a little easier for the next lucky dick to get inside,\" she says, smirking, before taking up her big, heavy bag, and leaving you reclining on the stump."
		]
	},
	{
		"key": "GADGETEER-07",
		"scriptLines": [
			"You can't really see what she means by that.  Seeing your confused expression, her face falls.",
			"\"Mmm... that's disappointing,\" she says, drawing one of the smaller items from the bag, something a few inches long and not very thick, with a hilt.  It doesn't look like you could really do any damage with it.  \"Maybe you'd like to try it out, anyway?\""
		]
	},
	{
		"key": "GADGETEER-08",
		"scriptLines": [
			"Her face brightens up again, a knowing smirk finding its way to her full lips.  \"Willing to try anything once?\" she says, demurely, as she drops her bag to the ground.  ",
			"\"I... guess,\" you say, unsure why you agreed with her demands - was it her cute smile?  ",
			"\"Hands and knees, please.  Going to need to lube you up good if I'm going to get this up there,\" she says, waving the oddly shaped weapon in front of your face, before sheathing it in a small hilt on her waist.",
			"\"Up... where?\" you ask, and she rolls her eyes.",
			"\"Hands and knees, please.  The details aren't important,\" she says, running her hand down your back, before nudging you to get into position.  You drop to your knees, then your hands.  \"Pants down, please,\" she instructs.",
			"\"I'm not sure...\"",
			"\"Pants, down.\"  Her voice is still sweet, but commanding... and you sense something odd about it.  You pull your pants down, reluctantly.",
			"\"That's a good boy,\" she says, producing from her sack a vile filled with translucent goo of some kind.  \"Nothing but the finest slime oil for our little butt virgin hero,\" she continues, pulling off her glove with her teeth while clasping the vial firmly in her still-gloved hand.",
			"She twists open the vial with her ungloved hand, then pours out the gelatinous substance onto her fingers - not much more than a dollop.",
			"\"I hope you know what you're getting into... I really love it when boys do,\" she says, squatting down behind you, and you suddenly feel something cool and slippery rubbing against your balloon knot - her finger, coated in jelly.",
			"She swirls it around without waiting to hear you sigh passively, her finger stroking your hole up and down, left and right, and in a gentle circle.  ",
			"\"Normally, this is the part where I might see some resistance.... not from you, though.  You're a natural,\" she says, spreading your hole with her thumb and middle finger, her index finger poised to strike.  \"Well, girls will be girls...\" she says, and you open up your mouth to speak but nothing comes out, but something certainly comes in.",
			"Her finger slides into you easily, lubricated by the slime goo, all the way to the second knuckle.  You feel her flick it inside of you, like a dull thump somewhere strangely inside your own body.",
			"\"Ooh, tight.  Looks like I really lucked out - this is going to be a real waste.  Deflowering this could have been the highlight of some poor monster's whole life,\" she says, swirling her finger around, hooking it in a \"come hither\" gesture that is bringing you closer to somewhere, but you're not sure where.",
			"She starts to slide her finger in and out, and your tight sphincter squeezes onto it as she pulls it out, and is compressed inwards as she pushes it back in.",
			"\"And you're already so hard... so unnecessary,\" she says, and she's not lying.  Dangling downwards, your stiff enough to poke a hole in the ground.  \"Hmm... sorry, Mr. Hero, I'm not interested in that.  And sorry, Mr. Monster... I'm loosening him up.\"",
			"With that, you feel the pressure grow... and a second finger slips inside.  She starts to work the two fingers in and out, humming a melody to herself.",
			"\"Hmmm... getting impatient are we?  You're leaking,\" she says, referring to the steady dribble of precum you're coating the dirt with.  \"Well, me too, actually.  These toys aren't going to defile themselves.\"",
			"All at once, she pulls out both fingers, leaving you open and quivering.",
			"\"Mmmhmhm... oh, my... this toy is perfect for a virgin like you...\" she says, once again unsheathing the hand-held object that looks suspiciously like a phallus.  \"Going to plunge it right into you.  Going to lose your first time to it,\" she says, twisting it against your already-open hole, \"What. A. Waste.\"",
			"You feel ashamed... you've never done anything before... before the reality sinks in, you feel her start to push it forward.  Her ungloved, slimy hand touches the small of your back gently, instilling you with a bit of calm, even as the toy is forced upwards and inwards.",
			"She begins to twist it as she pushes it in, then back out again, then in again, holding your hip so that your full ass remains in place while she stuffs her toy in and out of it.  She seems to know exactly how to ream it in and out of you to get the greatest effect.",
			"It isn't long before you feel a heat growing within your abdomen - and your unused cock begins to twitch and jerk.   Sensing that, she speeds up her thrusts, and starts to spank your receptive rear.",
			"\"Cum! I want to see you cum!\" she says, her face looking a bit crazed.  \"You're getting fucked in the ass!  No one's even touching your cock!  But you're going to cum, aren't you?\" she says, accusingly, almost... drooling.  Her face is flushed and red, and her nipples are visible underneath her admittedly revealing top.",
			"You feel a warmth spreading within you between your hips, and you struggle to maintain your focus - when suddenly, the dam breaks.  Rather than feeling like you're ejaculating, you feel like something inside of you is getting hotter and hotter, but nevertheless, your penis expels its wasted milk into the dirt.",
			"While you fill the soil with your cum, discarding it while she violates your ass with her toy, sliding it this way and that while forcing your hips to swivel and follow it, your upturned tush follows her lead.",
			"She takes note of your leavings.  \"Mmmhmhm, you came a lot for someone who was getting a fake dick shoved up their boy-butt.  Especially since it was your first time, and all.  If I squatted in that, I might get pregnant,\" she says, teasingly.",
			"You breathe heavily, having exhausted yourself from cumming anally, and she has a bit of sweat on her brow as well.  She sheathes her slime-covered fuck dagger and retrieves her bag, while you shudder and shake on your hands and knees.",
			"\"Mmm, good boy,\" she says - and as she leaves, she casually steps into the puddle of mud you left behind - leaving her footprint in it."
		]
	},
	{
		"key": "GADGETEER-NO",
		"scriptLines": [
			"\"Hrm, fine then. You'll be the one that got away, I suppose,\" she says, shrugging, before continuing down the trail, leaving you feeling ambivalent about how things turned out."
		]
	},
	{
		"key": "000-00",
		"scriptLines": [
			"There are wolves in the forest - you know, because you've been hearing them howl in the distance, and as you traverse the woods, you've been hearing the occasional growling - albeit higher pitched than you would expect.", 
			"The growling gets louder and louder, until, finally, a wolf emerges from the bushes... and she has big, fat boobs!",
		]
	},
	{
		"key": "000-01",
		"scriptLines": [
			"\"Grrr...\" she growls, holding up her clawed paws.  \"Just kidding,\" she says, dropping them to her skirt, \"I'm not gonna eat ya!  I just want to mate!\"",
			"You look her up and down.  \"Mate\"?  Her proportions are amazing - she's no slouch.  She's dressed like a nearby villager, but her clothes are in tatters.  You wonder what she is - maybe a werewolf?  It's possible her libido has been out of control since she was turned.",
			"You start to consider taking her up on her offer, but something about the way she's standing is a little... strange.  \"Oh... I get to mate, finally!\" she says, gripping onto her tattered skirt, which draws your attention to the anomaly.",
			"There's something... visibly growing in her skirt - it's made a rather pronounced bulge, and it's bulging more and more as she holds her skirt down with her paws and looks at you hungrily, knock-kneed.  At first you think it might be her tail, but it's obviously wagging excitedly behind her... and then the smell hits you.",
			"You cough.  It's such a strong scent it makes your eyes water.  Her eyes, on the other hand, are focused on you, unwavering, and her skirt is visibly wet - as she sways from side to side, you see that she's not wearing any underwear, so her rear is plainly visible as her skirt shifts over it.",
			"That detail soon solves the mystery, as the source of the mystery bulge spills out from under her skirt.  While you don't immediately recognize it, not being too familiar with canine anatomy, a part of you tightens up in fear instinctually.",
			"Up top, it seems the werewolf transformation gifted her a great, heaving set of knockers that wouldn't be out of place on any busty tavern wench, but down below, the transformation was a bit more... bestial.  And throbbing.",
			"It's dripping with liquid lust, and it's obvious that if she intends to \"mate\", that will be her weapon of choice.  You hurry to tell her that you're a male, and any \"mating\" would be rather unfruitful, but she drops to all fours, and lunges at you - too late for negotation!"
		]
	},	
	{
		"key": "000-02",
		"scriptLines": [
			"Now that her knotty wolf-cock has ended up exactly where she wanted it, her personality is much more subdued - although she's howling with delight and panting, so she still comes off as quite exciteable.  \"Mating!  Mating!\" she cries out, while you try not to cry out that your asshole is too small for her \"mating\".",
			"Of course, it's past your asshole now - stuck fast in your rectum, which feels the pressure as if you'd stuffed a melon in there. Your ass feels like it's on fire - her big, round, hard genital-adornment is far too big for your modestly-sized hole.",
			"Your fingers dig into the dirt, but you have no hope of dislodging the embedded sphere in your rectum.",
			"\"That's a good boy!  Good boy!\" she says, apparently aware that you're not exactly the ideal mating partner, \"you're going to have aaaaaaaaall my puppies!\"",
			"That doesn't sound good.",
			"\"There's so much... saved up!\" she declares, and you can almost -hear- the sloshing of her full doggy balls, \"so be a good boy and receive it all in your butt!\"",
			"Her powerful haunch lets her shove much more powerfully than a human could, but no matter how hard she shoves her thick dog dick into your unguarded bowels, it will be for naught.",
			"\"Woof, woof, I'm gonna fill you up!  I'm gonna spew it all out!\" she says, and you shift uncomfortably.  You can't get her off, well, you can't get her off of you, and you can't dislodge the knot - any second now, she's going to piss away her legacy, almost literally, in your bowels.",
			"\"Woof, woof!  Tighten up and receive it!\" she says, and you can hear from the strain in her voice that her knot is about to do its job.  You panic, your mind trying to find any way, any way at all, to avoid the anal goo catastrophe that's about to unfold.",
			"Your forehead is soaked with sweat, and though your listless, red face looks absolutely out of it, you know exactly what she's talking about.  Your stomach growls and your bowels tense preemptively.",
			"There's no way you're going to be able to get that -thing- out of you before your colon becomes the cozy new home to some very confused sperm - your own testicles twitch as you anticipate her pure semen enema.",
			"\"Awooooooooooooooooooooooooooo!\"",
			"*SPLORT*",
			"*GLORP*",
			"She howls, and you see white - and so would anyone taking a cursory look up your funhole.  It's hot and slimy and fills every nook and cranny as it spews out of her, and because of the knot, it's sealed inside your hot innards, bloating your intestines uncomfortably.",
			"She blasts a tremendous amount inside - it is obvious that not only is her inhuman capacity far greater, but that her breeding senses have made her save up as much as she can.  Without a doubt, such an insemination would have impregnated any female of her species - instead, an enormous jet of cum displaces any feces in your bowels and a deluge of semen replaces it.",  
			"It slams into your stomach with good force, but falls just short of forcing you to ovulate.  She wastes her gooey breeding stock in your unfortunate abdomen, utterly filling every nook and cranny of it with her hot semen and all of her wasted, confused sperm that had prompted such misdirected lust to begin with.", 
			"She throws her leg over your body and faces away, but the knot keeps you tied together.",
			"\"Mating~, mating~ <3\" she sings, while juicing you anally with every ounce of her runny puppy goop.",
			"Your bowels are so bloated and stuffed with semen that any additional nut being pumped into your gut causes uncomfortable spasms, as your aching bowels try to accommodate thick semen where it won't cause too much painful stretching, in a direct reversal of the digestive process.  You want to relieve the pressure more than anything.",
			"After several minutes, she begins to tug on the thing connecting the two of you, and you get to experience the reverse of her penetration process.",
			"\"I mated with a human... how embarassing,\" she whines, tugging at the knot to try to free it, making you grit your teeth in agony. You eventually realize that aiding her by pushing is better than being stuck in impatient-werebitch hell, and through her efforts, the efforts of your bowels, and lubricated by her cum, it pops free, like a stuck cork.",
			"Your anus gapes widely, her doggy cum running out into mud on the ground, and you can feel the air rush in now that the knot isn't obstructing it."
			"You have no strength in your legs, and can't stand.  You're glad to hear, at least, that the wolfgirl who just completely obliterated your butthole is also somewhat embarrassed about the whole ordeal.  She fixes her skirt and bounds off, leaving you alone."
			"You drift asleep - too exhausted to continue.  After several hours, you wake, and are face to face with that very same wolfgirl, her eyes shining brightly, her smile more befitting a cat than a dog."
			"\"You're awake!  Woof woof!  Are you ready for more mating?!\" she says, excitedly, her voice wavering as if she can't contain her excitement.  Looking down past her face, you see her cock, just as erect as it was when you first saw it, and your stomach growls.",
			"At her mention of the word \"mating\", your nearly-closed asshole cramps up, knowing what its fate will be.",
			"It's still sore and awkwardly stretched out from your first \"mating\", and you highly doubt she'll see reason and understand why her peculiar method of \"mating\" won't result in offspring, and will continue to shove her flawed approach where it doesn't belong, resulting in little more than a waterlogged rectum and a useless, stretched out asshole.",
			"After another vigorous round of \"mating\", the wereslut keeps you as her mate - you try to reason with her that you can't brood her puppies, but she isn't hearing it.  She doubles up her efforts, so you stop goading her, but you can't escape, as by the time you recover from one \"mating\", the next is about to begin.",
			"Eventually it is no longer painful; instead, all that remains is the uncomfortable sensations of having something large and phallic shoved up your ass, something thick and rough sliding in and out of your rectum, and something thick and slimy pumped into your bowels.",
			"The unpleasant sensations of receptive anal sex become more and more familiar, until your goo-stuffed innards learn the best way to deal with it.",
			"Your adventure is over, but your ordeal has just begun."
		]
	},
	{
		"key": "000-03",
		"scriptLines": [
			"Once you've collapsed, she seems to lose all interest.  She scratches behind her ear with her heel, then bounds off without a word."
		]
	},
	{
		"key": "000-04",
		"scriptLines": [
			"She seems content.  Her dangling genitalia are no longer aroused, which gives you a sense of ease that you otherwise don't feel; after all, you did just swallow all of her runny wolf cum.",
			"She saunters off, in a daze."
		]
	},
	{
		"key": "001-00",
		"scriptLines": [
			"You look around. There don't appear to be any harpies here.", "That being said, there's a rather pungent scent in the air, and you've been hearing squawks and the flappings of tremendous wings for a while.", "You look up and behind you to try to spot the source, but the sky is empty - however, when you turn back, you can plainly see a figure approaching rapidly, talons extended!"
		]
	},
	{
		"key": "001-01",
		"scriptLines": [
			"You deftly sidestep the harpy's dive, extending your arm to clothesline her in the process.", "The impact nearly drags you both to the ground, but the robust harpy seems relatively unharmed, though she crashes to the floor with her face in the dirt.", "It's time to act!" 
		]
	},
	{
		"key": "001-02",
		"scriptLines": [
			"You manage to duck underneath the approaching figure, which has the unfortunate side effect of giving you a full view of her intentions.", "Her heavily foreskinned bird dick just narrowly misses its intended target - your mouth - and flies by as a blur.", "It's time to act!" 
		]
	},
	{
		"key": "001-03",
		"scriptLines": [
			"You're too slow to dodge the harpy!",
			"Her lower body crashes into your face at high speed - you're knocked to the ground, and your mouth, open in surprise, is filled!",
			"The harpy lets out a moaning screech, and her tongue lolls out in satisfaction!",
			"Before you even know what happened, you're tasting the worst the harpy has to offer - her slimy penis!",
			"It tastes like it's never been washed, and the harpy looks down at you with frenzy in her wild eyes; she obviously has taken a liking to your lips in an unfortunate way!",
			"Her talons grip your head and she gets ready to begin pistoning into your face.  It's time to act!"
		]
	},	
	{
		"key": "001-04",
		"scriptLines": [
			"You collapse to the floor, unable to withstand the harpy's attacks.  You anticipate the killing blow, face-down in the dirt, but it never comes.  Instead, you can sense the harpy stalking around you, inspecting you closely.  Finally, with a squawk, she rears up, takes off into the air, and grabs your clothes with her talons, hoisting you into the air.",
			"You're terrified that her talons will finish ripping your shirt and send you plummeting to the ground as she carries you, mostly immobile, high into the air, over the countryside.  The view is startling, but breathtaking - as the sun visibly sets below far off mountains, a shadow is cast across the land, and the sky dyes itself in vivid orange and purples.",
			"While she carries you, she flies in the direction of the distant mountains - and a dark premonition settles in your fight-hazed mind - is she bringing you back to her nest as a fresh kill?",
			"Looking up, you can make out her still-stiff willy, buffeted by the wind as she flies. You wonder if it's causing a noticable amount of drag, but it's nearly impossible to tell how fast you're actually moving.",
			"Travelling between mountain peaks, you see that there are other harpies about - hundreds of them. Again, a dark thought enters your mind, as the harpies converge and attempt to steal her bounty, resulting in you plummeting to the ground amidst the struggle.  Thankfully, the other harpies are content to screech and caw at you.",
			"You see small inlets lining a mountain face, a sheer drop down to the valley below, and you wonder if they're naturally made or somehow carved out, seeing how regular they are. In most, if not all of them, is a bundle of straw and twigs - likely brought by the harpies from miles away, much like yourself.",
			"You are dropped in one such nest, and the harpy works quickly to dispel any notion that she intends to consume you, and, simultaneously, to consummate your marriage. It isn't long before you are pantsless, red-faced, and anally penetrated - any hope that the harpy's covered dick wasn't hard for you is dashed along with the cock-emptiness of your rectum.",
			"It sits heavily in there, throbbing and fat, as you acclimate to her avian mating ritual.",
			"\"Man, man! Caw! Eggs, eggs!\" she exclaims, in broken human tongue, as her filthy cock emasculates you with hawk-like efficiency.",
			"It occurs to you that she hadn't said a word to you in between taking you back to her home and anally violating you - she was so swift at it, in fact, that you're still not able to understand it. You know she has a cock and you know your ass feels full, but their true connection is only slowly dawning.",  
			"You're hanging quite nearly over the ledge, and you can see downwards that you can't actually see where the sky ends and the ground begins, and you aren't too keen on going down to investigate. She thrusts from behind, flat against you, and you push back to prevent from sliding forward - which means you're an active participant in this consummation.",
			"With what looks like a thousand foot drop as your only other option, it seems you really don't have much of a choice.",
			"If the harpy was quick to start, she's incredibly slow to finish - slow enough, in fact, that the heat and pressure in your bowels gives way to a pressure coming from within your testicles, which, soon enough, expresses itself outwards.",
			"As you ejaculate from harpy-induced anal frustration, you remain mostly silent - unlike the harpy, who, at the moment of her triumph, screeches for all to hear.",
			"As that high wail assaults your ears, her birdy semen assaults your bowels - and by the volume she puts out, you doubt that she's about to fly you back down now that she's finished.",
			"She pulls out, and cradles you in her wings - a sweet gesture, but you have difficulty appreciating it.",			
			"Your asshole is twitching uncomfortably - the harpy's unnatural mating has left it feeling rather like a mishandled pussy, with roughly the same amount of nasty, runny harpy semen drooling out of it, and a similar gaping, clearly-used appearance.",
			"Having been wrong-holed by an unwashed harpy, your dignity as a man has taken a nosedive, but, on the bright side, at least you can only be pegged by a birdgirl with a dick for the first time once.",
			"Indeed, it wasn't the last time that the harpy's stinky bird dick rummaged through your rectum during a frantic, feathery anal sex session - trapped in the high-up, remote nest, it became a daily occurence, as the harpy returned with food, pre-chewed, as well as baubles, and also a big need to seed to fertilize some non-existent eggs.",
			"Her romantic overtures aren't exactly unrequited - she becomes audibly irritated with you whenever you cover her nesting material in sticky, wasted semen, which itself is a daily occurence, coinciding with her daily matings, which instill in you a certain perverse desire, the tangible result of which is a spurt of semen that never fails to bring a redness to your cheeks.",
			"Your only visitors are rival harpies, which, thankfully, she defends you from quite handily - she seems to be something of a fighter.  Still, they often gather and gawk and squawk as you attend to your \"wifely\" duties, and the fire that you feel in your at-the-time harpy-invaded hole is nothing compared to the shame of their bird-brained jeers and misaimed hoots of encouragement.",
			"Well, not nothing - your harpy wife's chubby bird schlong rubs the stretched-thin membrane of your anus with so much determined friction that no one would ever mistake, at a glance, your puffy, irritated hole as anything but something that a harpy-with-a-dick has on lockdown, but, still.  It's embarrassing."
			"Your time as an adventurer becomes a distant dream while you live your life high atop that nameless mountain peak, wetting her nesting material with your wasted semen while she fills your stretched and pummeled rectum with hers.  You regret losing in battle to her - if you hadn't, perhaps you wouldn't have lived the rest of your life getting butt-stuffed by her inhuman cock without rest.",
			"With a whimper, that thought leaves your mind, as you sprinkle her straw with your anally-induced sperm for what might be the thousandth time.  Soon, she'll screech, and dump her bird-brained excuse of a reproductive act in your bowels, likewise for the thousandth time, but all you can think about, with that thought returning, is what would have happened if you won."
			"*SCREEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEECH*", 
			"*SPLURT, SPLURT*",
			"Bad End."
		]
	},		
	{
		"key": "001-05",
		"scriptLines": [
			"The harpies tongue lolls out of her mouth, and her throbbing birdcock is now considerably less throbby, as it deflates, slick with the remains of her ejaculate.",
			"She seems to be in some sort of dazy, stumbling about on her talons, with little regard for your presence.  You take the opportunity to flee, having had enough bird cum for one lifetime."
		]
	},		
	{
		"key": "002-00",
		"scriptLines": [
			"You didn't expect to come across anyone this deep into the forest, but your eyes spot a female form... but, as the light passes through it, you realize that there's no way the thing before you is human.",
			"You approach cautiously - \"she\" isn't facing you.  Once you get closer, you try to discern more details.",
			"\"She\" has a rather sizable rear - one that you could get lost in, quite literally, as she appears to be made of... slime. Though you suppose she can take any shape, which makes her current one quite suspect.",
			"Before you can inspect further, she turns to face you, and, seeing you, jiggles excitedly. Her \"breasts\" are massive, far larger than any human woman would have, and they move quite... fluidly.",
			"\"Ooooooo... a human!  What brings you to my haunt?\" she asks, although as soon as she starts to approach... slithering across the ground, you reach for your weapon.",
			"\"What... are you?\" you ask, confused.",
			"\"That's a rather rude question, isn't it?\", she says, \"I'm a slime, obviously.  A sentient slime.\"",
			"Obviously.",
			"\"How are you... speaking?\" you ask.",
			"\"Oh... well, that's a rather embarrassing question...\" she says, looking flustered, although she's still a translucent blue.  \"As a non-sentient slime... consumes... sentient creatures, it starts to develop a mind of its own... that's me!\"",
			"You pick up your guard.  \"And am I next, then?\" you say, accusingly.",
			"\"No! I haven't digested many humans since I became, well, me.  Always in self-defense, of course,\" she adds, looking somewhat sullen. \"Sentient slime goo is an expensive commodity, or so I've come to learn. So I do have to fend off the occasional poacher\", she explains.",
			"\"Then why are you shaped like... that?\" you ask.",
			"\"Because I'm a girl slime, of course,\" she says, matter-of-factly.",
			"\"No, I mean... why like... -that-, in particular?\"",
			"\"Oh! You mean my luscious curves. You'll have to forgive me, I can be pretty... bubbly,\" she says, jiggling her... entire form. Though she says that, she seems surprisingly sharp.",
			"\"Yes, why?  Are you trying to entice men to their dooms?\", you ask, accusingly.",
			"\"Why? Are you enticed?\" she asks, wiggling her... \"hips\".",
			"She sees that you're not amused by her response, and sighs.",
			"\"I just prefer this form.  It keeps me... grounded,\" she says, shrugging, \"I have no interest in eating you, or, mmhm, engaging in other primal behaviors. We don't reproduce that way, you see,\" she says, patting the flat goo where her vagina would be.",
			"\"How... do you reproduce?\"",
			"\"My, what a personal question. Love darts, since you asked,\" she says, looking proud of herself.",
			"You look at her confused.",
			"\"Mmm, don't ask,\" she says, and you decide to drop that line of inquiry.",
			"\"And if I were to... want to... that would be my problem, then?\" you ask, hand still on your weapon.",
			"\"It wouldn't be a problem at all. You wouldn't be the first. Oh, but you think I ate them, don't you? No, not one. Some gave me gifts... others, I was just pleased to have the company.  It doesn't do anything for me, but it doesn't hurt me either. I flow like water,\" she says, smiling.",
			"What will you do?  Fight, fuck, or flee?"
		]
	},
	{
		"key": "002-01",
		"scriptLines": [
			"You defeat the slime, and she becomes visibly agitated - like she can't hold onto her form any longer."
			"\"I suppose you want to claim a trophy, don't you?  Well then, stab my core,\" she says, defeated.",
			"\"Your core?\"",
			"\"It's the only way to kill a slime.  Chopping us up to pieces does nothing; we'll just reform. If you destroy this, we're gone for good,\" she says, pointing to a jewel floating within her gelatinous form.",
			"\"Why are you telling me this?\"",
			"\"You'd find out anyway,\" she explains, sloshing a bit as she struggles to keep her voluptuous form, \"and I would rather have it done quickly than... the alternative.\"",
			"Do you stab her core?"
		]
	},	
	{
		"key": "002-02",
		"scriptLines": [
			"You attempt to destroy her core with a finishing blow!"
		]
	},	
	{
		"key": "002-03",
		"scriptLines": [
			"You successfully shatter the slime's core. In her last moments, she looks at you with... sadness, and then, her form is completely lost - the slime that was once her spreads out due solely to the force of gravity, and begins to denature and dim.",
			"You receive some worthless goo."
		]
	},	
	{
		"key": "002-04",
		"scriptLines": [
			"You fail to shatter the slime's core - her slime hardens in such a way to deflect the blow, and then she lurches towards you, so that your wrist gets sucked inside of her. In the next few terrifying moments, she pulls the whole of you into herself.",
			"\"You're quite violent, aren't you?  Well, I won't turn down such a generously offered meal.  Hopefully you go to my chest or hips and not my belly,\" she says, ominously.",
			"You feel a wave of pressure within her, as if her slime was somehow changing in texture... and then your entire body becomes numb.",
			"\"I'm sorry, but I can't just let you kill me. I've done nothing wrong. You, on the contrary... you are dangerous,\" she says, but you can't say anything in response, her goo filling your mouth as you open it to scream.",
			"With a sudden existential terror, you realize what's happening.  She's digesting you. You struggle to move, even a little bit, but... nothing.  You're immobile within the slime.",
			"\"Don't worry, you'll just dissolve away.  I don't poop.  Oh, that's so embarassing to say.  Pretend you didn't hear it. Or, you know, disappear forever...\" she says, and in a matter of a few seconds, you'll obey - and end your journey as an extra inch on the slime's impressive hips.",
			"Her round, full \"belly\" jiggles with its contents, as she sloshes away to continue whatever it is she was doing before you attacked her and tried to destroy her. She seems to rather enjoy it - you, on the other hand, can slowly feel your consciousness slipping away, knowing that once it goes dark, she's definitely going to make you her meal.",
			"And, indeed, you slip into unconsciousness, and she goes about her day, her ballooned slime-belly gurgling, until nothing remains.",
			"Bad End."
		]
	},	
	{
		"key": "002-05",
		"scriptLines": [
			"You put away your weapon. This slime is no danger to anyone who isn't already a danger to others themselves.  You turn away, but the slime stops you.",
			"\"Thank you for understanding. Please, have some slime,\" she says, and though you think to reject her... generous offer, she dumps about a pound of pristine goop into your hand.  You wrap it in some rags, and store it carefully in your bag.",
			"You nod to the slime, and begin to leave again.",
			"\"It won't spoil, not as long as I'm alive. Do with it what you will,\" she says, calling after you.  You receive some slime goo."
		]
	},	
	{
		"key": "002-06",
		"scriptLines": [
			"The slime defeats you, and you feel a great sense of unease.",
			"\"Perfect.  I needed some 'me' time,\" she says, getting ready to do... something.",
			"\"What do you mean?\" you ask, worried.",			
			"\"I need to rejuvenate, and I need somewhere hot and dark for that,\" she says, and you have a dark premonition. \"Open wide!\" she demands."	
		]
	},	
	{
		"key": "002-07",
		"scriptLines": [
			"You open your mouth to speak... a costly mistake!",
			"You see the slime girl's face up close, and then, a moment later, it collides with yours - and your stomach is instantly full of slime girl goo, with pints being piped in by the second.",
			"In a matter of minutes, your stomach is pumped full near to bursting, and little of the mischevious slime girl is to be found spread on the ground around you - most of her being is swirling and rushing through your intestines, sitting heavily in your over-inflated belly.",
			"You can't even stand, being that overburdened... so you sit there, for hours, with the googirl cramping your bowels."
		]
	},		
	{
		"key": "002-08",
		"scriptLines": [
			"You successfully flee, leaving the slow-moving slime behind you."
		]
	},		
	{
		"key": "002-09",
		"scriptLines": [
			"You turn to flee, but trip, your pants falling down!",
			"\"Don't mind if I do!\" you hear the slimegirl say from behind you... and then, you hear her glorpy form ascend into the air... and a moment later, what goes up comes down, and hard.",
			"The sudden rush into your bowels knocks the wind out of you, and the pumping continues, as she anchors her gooey form to the ground and pumps herself, \"face\"-first into your poor, unfortunate guts.",
			"In a matter of minutes, your stomach is pumped full near to bursting, and little of the mischevious slime girl is to be found spread on the ground around you - most of her being is swirling and rushing through your intestines, sitting heavily in your over-inflated belly.",
			"You can't even stand, being that overburdened... so you sit there, for hours, with the googirl cramping your bowels."
		]
	},		
	
	{
		"key": "002-10",
		"scriptLines": [
			"You approach the slime tentatively, wary of her amorphous goop.  She smirks at you.", 
			"\"My name is Protea, if you're curious,\" she says, her hands tracing along her hips and down to her thighs, \"but you can call me Tea.\"",
			"\"Hi... Tea,\" you say, feeling weird about addressing a sentient slime in such a casual way. \"I'm Hiro. Are you sure you're not going to eat me?\"",
			"She jiggles again. \"No way. I like cute humans like you.  And it seems like... we're not going to have any problems getting along, are we?\" she asks, sloshing towards you until you can hear... well, not her breathing, but something.",
			"You reach out and touch her chest - your fingers sink in, but just barely, and there's a surprising amount of give.  You get the sense that she's intentionally keeping her form so that it feels how you expect it to feel.  To your relief, she doesn't suck you in.",
			"\"Mmmm... and do you want to come into me or... would you like me to fashion you up a male-human surrogate?  You wouldn't be the first to ask for that, either,\" she says, flatly.",
			"What do you do?"
		]
	},	
	{
		"key": "002-11",
		"scriptLines": [
			"\"I-I'd like to... come inside,\" you say, meekly.",
			"\"Mmm... okay. I'll let you in me. You're going to have to fight your way in, though~ <3\" she says, bringing her curvy, squishy body to yours.",
			"She begins to disrobe you, and while you're wary of her, she doesn't seem to be threatening.",
			"\"I don't actually have membranous parts like you do,\" she says, reaching between her \"legs\", \"since I'm ALL membrane... but I think you'll like what I do have to offer.\"",
			"She leaves a trail of slime on the underside of your penis with her slimy finger, then reclines into her own slime, spreading her \"legs\" as she does, wide, to reveal her featureless, but round and smooth mound.",
			"\"Come and get it,\" she says, bringing her hands up to her chest... and her slime-created appendages to her thighs, to properly frame where she wants you to insert it. You're ushered forward by a wave of slime, and you press the tip to her... well, to her nothing, but its sticky and has a little give none-the-less. \"That's right... force it in...\"",
			"She speaks sultrily, hungrily, even... but you wonder exactly what it is she gets out of this. You push your hips forward, and it just barely begins to sink into her, where her thick thighs meet, and you feel an exquisite pressure on the tip of your penis.",
			"\"Ooooh... it's coming inside me... you might not get it back,\" she says, and you feel an insistent little tug on the end - by now, the head has been subsumed, and you panic, trying to pull it out - but it's stuck, and the slime building up around your hips is forcing you forward still.",
			"You begin sinking the shaft into where her vagina would be - it's a heavenly sensation, her thick slime wrapping around your dick, with its own internal warmth, a strong feeling of suction, and even a slight vibration.  Still, you try to pull away.  \"W-wait!\" you cry out.",
			"\"I told you... I'm not going to eat you. I just want it all inside... besides, if I want to keep it, you've got no choice, now,\" she says, tauntingly. She's absolutely right; there's no way you can pull it free, as she's got a vice-like grip around it where she's pulling you in.",
			"Finally, she's pulled in as much as can be pulled in, and you worry that she'll suck the whole of your body in, but your hips tap against her spread \"thighs\" and come to a stop, and you feel a buzzing in your head as your entire cock is being wrapped and massaged by her tight innards.",
			"\"Voila! How is it? Pretty good, right? I can't say if it's the same sensation, but... does that really matter?\" she asks, as she begins to slide herself to and fro, spreading her legs wide while you're sucked in and out of her, tightly, like... well, like you're fucking gelatin. The sound is an unmistakable \"schlorp schlorp\" that doesn't sound anything like ordinary sex.",
			"Her large breasts sway, similarly, like gelatin, and she bites her finger coquettishly - although the effect is somewhat subverted by the fact that the tip of her \"finger\" ends up a prolonged taffy goop between her \"lips\" and what remains of her \"finger\".",
			"Nevertheless, It isn't long before you're nearing the edge, and as you try to resist, the slime tightens, and she throws her arms around you, kissing you on the face, and it's like getting hit in the face with a gooey creampie. Speaking of gooey creampies, she immediately thereafter receives one inside of her.",
			"You explode in spurts, and she smiles broadly - quite broadly, more broadly than any human ever possibly could. \"How early! Aren't you a dear,\" she says, while you're still in the throes of it, spurting off thick, visible globs of white jelly inside her light blue jelly.",
			"With a few punctual thrusts, your legs fail, but she catches you in her goo, so that you're laying on her like a slimy bed, her \"legs\" wrapped around you.  Your own semen seems to have been caught in some kind of airpocket, swishing about somewhere near where her womb would be.",
			"\"Very good... but since it was so quick, I'm sure you'll want to go again,\" she says, chiding you while wrapping her arms around you. You expect to sink into her gooey form, but thankfully, you remain resting on top.",
			"Several minutes pass before you're ready to go again, during which her soft, feminine curves have all but melted - aside from the chest up, which is still voluptuous, she's just a formless... slime. She smirks at you.",
			"\"Want to try anal?\" she asks, and you boggle - how would that be any different? She twists under you, so that she's facing away.",
			"You watch as she starts to reform, her slime squicking and squelching as it resumes the shape of a... very shapely woman.",				
			"\"Unfortunately, I don't have an excretory hole for you to misuse,\" she says, as her large rear forms itself out of the nearly flat prism of slime, \"but I think I can do one better,\" she says, sticking out said rear at you, and slowly forming a hole where one would be appropriate... but it's a hole that is quite literal, and perfectly circular, or, to be more accurate, cylindrical.",
			"\"Umm... do you want me to just... stick it in there?\" you ask, uncertain.",
			"\"Of course. Jam it in my excretory hole,\" she demands, narrowing and enlarging the hole rhythmically in a seeming attempt to entice you, \"I promise, this will be very embarrassing and innappropriate for me,\" she goes on, unconvincingly.",
			"Still, it's tempting. You wade closer, and stick your hardening member where she clearly wants you to stick it - immediately, she contracts all of the slime so that you're fully engulfed, and it's incredibly tight. You nearly lose it inside immediately.",
			"\"Oh! My butt! Not my butt... now I'll never be a Queen!\" she says, and you wonder what exactly it is she's talking about. \"Mmmm... how woefully non-standard!\"",
			"She wiggles her fat rear back at you so that it wobbles and jiggles and sloshes about, and you have to double down on your efforts to not explode inside what isn't actually her asshole.",						
			"\"Oh my. I'm going to have such difficulty expelling waste properly in the near-future,\" she says, reaching back to slap her slimy, fat rear for emphasis, \"You're really doing a number on my non-reproductive chute.\"",
			"As you squelch in and out, and she loosens and tightens her grip on you, you quickly build to another finish - shooting a fat load into her fat ass, where, again, it pools somewhere around where her ileocecal valve would be.",
			"You collapse backwards this time, again caught by her slime. You can see the ball of cum join the other to form an even larger, greasy pool within her.",
			"\"What are you planning to do with that?\" you ask her, curious.",
			"She thinks for a moment. \"I play little games with it... I can preserve it for a long time, so I can use it for... rather mischevious purposes, particularly for humans and villages that annoy me.\"",
			"She pauses to remember one such incident. You can't imagine what she means.",			
			"She smiles, remembering something. \"I once had a woman who visited me instead of her poor, unsuspecting husband - lucky for me, her brother was often a frequent contributor.  She had three kids by him before I told her.\"",
			"Your eyes open wide. She giggles, and rears up, towering over you.",
			"\"But for now... I'll let you keep yours...\" she says, before her massive rear crashes down around your face.",
			"You worry that you're going to drown, but somehow, you can breathe through the jelly. Worrisome, though, is the sensation that your mouth is being pried open, and something is flowing down into it.",		
			"\"I think I was quite generous in entertaining you, now I want you to entertain me... by swallowing your own goo,\" she says, the amusement already plain on her... face, which, because she's transparent, you can see clear through her body, no matter how large her ass is.",
			"It flows into your mouth and down your throat - unquestionably, it's the semen that you filled her with.  You gulp down your own bitter ball-juice. You win some, you lose some.",
			"Tea thanks you for a good time, and you stumble away, nauseous, perhaps to find something to clean the taste out of your mouth."			
		]
	},	
	{
		"key": "002-12",
		"scriptLines": [
			"\"I... um...\" you say, but the words won't come out.",
			"\"Mmmm... interesting. I kind of suspected; you get a knack for telling that when you're a slime as long as I've been,\" she says, and you see the slime in her nether regions, being what they are, starting to bulge out and harden.",
			"You stare at her in awe - if her preferences in regards to hips and bust are any indication, she has no problems exaggerating the human form.  Sure enough, the slimy bulge is nearly as thick as a fist and as long as elbow to wrist, and it's still forming and hardening.",
			"\"I assume that's where you want it. On me, that is. I know where you want it in the more... personal sense. I've had my slime in similar places before, after all,\" she says, putting the finishing touches on her slimy phallus-like protrusion. \"Now... turn around, love.\""
		]
	},
	{
		"key": "002-13",
		"scriptLines": [
			"You turn, and are quickly shoved forward by a wall of slime - but rather than falling face first into the dirt, you fall face-first into a pile of goo that catches you quite gently. Unfortunately, Tea doesn't have much more gentleness in mind.",
			"\"Mmm, yes... there it is. That's where you like to feel good, isn't it, you little pervert? Not that I mind. Now, I'm coming inside... so start fantasizing...",		
			"All at once, a large amount of slime, hardened, but still flexible, forces its way up into you, and you hold your breath. It seems to reach almost impossibly deep, and you feel your stomach distend as it pushes it out from behind.",			
			"Tea pumps away at your hole, forcing you to ejaculate into her slime without reserve.",
			"She milks it out of you into her slime over and over again, and you pump a few good loads worth into an increasingly large orb of goo.",
			"That isn't the end of it, however. Once she's done, she pulls her slime penis out of you, leaving a decent amount of it inside - but she quickly reforms it as she slides over herself to reach your mouth with it.",			
			"She pumps your mouth until, finally, you can see your own cum rushing up through the pillar of slime that is her slime-dong, and she shoots a slimy, but entirely human, load down your throat.",
			"You gulp down your own bitter ball-juice. You win some, you lose some.",
			"Tea thanks you for a good time, and you stumble away, nauseous, perhaps to find something to clean the taste out of your mouth."
		]
	},	
	{
		"key": "003-00",
		"scriptLines": [
			"You're wandering in the forest - home of monsters and shadows alike.  The creatures of the woods can sometimes be hostile, so you're on your very best guard.", "The sound of a twig snapping jostles you into high alert, but you can't locate the source of the sound.", "You keep your ears pricked up, wary of unseen danger."
		]
	},
		{
		"key": "003-01",
		"scriptLines": [
			"You spot her before she reveals herself - judging by her appearance, you would guess that she's a lone brigand - you scan the area, but you don't detect the presence of any more of her merry band.", "You're fortunate - she didn't expect you to spot her, and she's caught unawares.  What will you do?"
		]
	},
	{
		"key": "003-02",
		"scriptLines": [
			"You hail her. \"Come out. I see you hiding there,\" you say, and she mutters something under her breath before stepping out into view.",
			"She clicks her teeth. \"Tch. Good eye,\" she says, looking you up and down, \"...although can't say the same for myself. You're a man, aren't ya?\" she asks.",
			"\"Y-yes! Why do you ask?\"",
			"She sighs. I suppose you wouldn't be interested in the kinds of wares I'm peddling, I mean\" she says, and she gestures to her pantleg - where she's clearly smuggling some kind of weapon.",		
		]
	},
	{
		"key": "003-03",
		"scriptLines": [
			"You accept her invitation with a nod.",
			"\"Ah, you're a boy, but you're into butt stuff? I can get behind that,\" she says, the word \"literally\" merely implied, as she approaches you. \"I'll fuck ya in the dirtbox in the dirt, like a good forest wench,\" she declares, as she pushes you to the ground.",
			"You land on the ground, and begins to uncinch her plate, then she offers you her boots, and insists that you pull them off. That being done, she bends down to pull off her trousers, revealing a lack of undergarments and a big fat schlong, then goes to work on your clothing, pulling your underwear off while you wriggle in the dirt.",
			"\"I like fucking in the ass while face to face, so I can see all the slutty faces yer making,\" she explains, \"although, admittedly, there are usually fewer little pricks that might squirt on me in that configuration\", she says, flicking your quickly hardening penis.",
			"The casual contact makes you start to shiver... although you're primarily fixated on her rather busty figure. You wonder how she manages to fight with a pair that large... but as your eyes track downwards, there's another pretty large pair that holds your attention.",
			"She spits on her fingers and rubs the moisture on your hole none too delicately. She does that again, and then a third time, and then positions the fat head of her cock right against your hole, and your heart stops beating. \"Is this for me? Don't mind if I do...\" she says, and you feel the insistent pressure starting to build.",
			"She doesn't let up - with one hand on your knee, the other on her dick as she guides it in.  Suddenly, you feel it pop inside, and your hands pulls weeds out by the roots.  She puts her hand on your other knee, a wide grin on her face, and your hole stretches too late to accommodate her."
			"She spreads your knees subtly as she pushes her hips forward - so that the opening of your legs corresponds with her prying open your innards. You hold your breath as she continues to push into you - there's no point in telling her to go easy on you.",
			"The thickness of your anal membrane is stretched thin by her impressive girth - there is no question she's inside of you in a way that will render future anal activities more difficult. You can tell that the stretching is beyond normal, and then a bit beyond that - she's got a fat cock, and your hole is getting worked out by it.",
			"\"Whew, that's tight... tighter than a pussy for sure. It's nice and hot and dry in here... it hurts good, doesn't it?\" she asserts, and she's right about at least one of those - the friction of her thick shaft sliding in and out of your barely-lubricated ring is making your toes curl anxiously. It's not too bad now, but you're obviously building up some soreness for later.",
			"She doesn't seem to pay any mind - she's slipping her dick in and out of you at a steady, even pace, biting her lip and bottoming out a little deeper each stroke, poking and prodding at your insides with her exploratory cockhead. It's stuck fast, inside, snugly, so there's no chance of it slipping out accidentally and interrupting your impromptu anal sex.",
			"Your sphincter cramps around her, begging to relax and return to its previous, non-cock-accommodating shape, but there's no way it can squeeze her down to a more comfortable shape and size with her being as hard and firm as she is, so your smooth muscle can do nothing but massage her.",
			"She grasps firmly around your waist, and begins to drive it into you while holding your body in place so that she can bottom out with each explosive thrust. With your feet on the ground, the result is that each time, she has to spread your cheeks, but she's successful, and you catch a full dick with every thrust.",
			"Your \"lovemaking\" there on the ground isn't exactly the most romanticized affair - getting wrongholed in the dirt by some rogue you just met rarely is. Then again, she does make a lot of eye contact... and her hands roam over your body.",
			"\"Put yer legs around me, slut, so I know how much ya want it,\" she demands, and you obey, wrapping your legs around her waist as she drives it up into you.",
			"With your legs out of the way, she really begins to lay it into you, her fat sack slapping against your upturned ass with rather obvious intention. The burning has gotten stronger, but not strong enough that you tell her to slow down.",
			"\"I've got such a full load saved up... yer gonna look pregnant,\" she says, confirming that she's getting close to ejaculating. You don't know why, but her globes are obviously incredibly full - likely that was what spurred her to try and sneak up on you to begin with. You can't help but squeeze your anus around her, knowing that it's definitely milking all of the cream she's got saved up in those big balls of hers.",
			"You can see it written plainly on her face. Her goo-filled love buckets don't know that her fat dick isn't in a pussy, and she intends to use that to the full extent that your rectum will allow. She's biting her lip, sucking air in through her teeth, and doing all but saying that her cream cannon is ready to give your intestines a white-washing.",
			"The precum leaking into your bowels is already oddly thick, you can't imagine what an actual spoonful of her seed would look like. If you don't act soon, you won't have to wait long to know that it feels like, though. Anally.  If you're hoping she's going to pull out before the big finish, you can look forward to a healthy creampie.",	
			"Your cock is slapping against your soon-to-look-pregnant stomach with an unfortunate need to seed - while it won't be as thick or match hers in sheer volume, there is no doubt that you'll soon be spurting on your own stomach as long as she keeps up the in-and-out. You don't want to be on the receiving end of a mysterious-bandit full-force semen enema, but you can't bring yourself to tell her to stop.",
			"If you COULD get the dick up the ass you need to punch your prostate and make you cream and ALSO avoid getting your stomach blasted full of a stranger's strange semen, you'd opt for that. But that's not an option.",
			"She's definitely ready to blow. Her sack is all but pulsing as she slaps it against your cheeks, ready to fire off her gooey load where the sun don't shine. Speak now, or temporarily hold her seed."
		]
	},
	{
		"key": "003-04",
		"scriptLines": [
			"You say nothing. You feel yourself nearing orgasm, but you doubt she's going to be too far behind.",
			"With her cock rummaging over your prostate, you soon squirt, your stomach receiving the semen gracefully - and then, it receives a lot more semen, somewhat less gracefully.",
			"Her eyes roll into the back of her head as she groans, and a torrent of thick cum floods your bowels, too late for you to call takebacks. Her hips twitch as she fires rope after rope inside, and you groan at the sheer volume of it."
			"Letting her cum inside proves to be a mistake. She dumps weeks' worth inside until you feel bloated and gross.",			
			"You unwrap your legs and hold them high in the air, as if inviting her to pull out, but she doesn't take you up on the offer, slamming her hips down against your ass and firing rope after rope into your beleagured bowels. You doubt even a drop of her mucous is going to end up coming out anywhere but inside your pipes."
			"The pressure causes a single, thick, goopy dollop of cum to squeeze out and run down your cheek, the rest of her semen still being pumped inside as it trails downwards, like a sperm-filled tear at what your butthole has been made to become. You caught the whole thing, and you don't even know her name.",			
			"You feel it bubbling in your gut, which is enough to tell you how much there is, without also seeing your stomach distend. It's a painful amount of dick porridge to drink anally.",			
			"After her thorough insemination, she pulls free - your stretched-thin anal membrane clinging to her wet, smooth shaft as she does, until finally, it slips free, head and all.",
			"Her creampie is remarkably subtle - despite her fat cock stretching it wide just moments before, your hole tightens up into a fairly small gape, and her sticky cum begins to ooze out slowly, a proof of conquest you're hoping no prying eyes will see.",			
			"Despite the rather humble display, which isn't actually that humble, as it's obvious there's a lot of cum stuffed up inside, the amount in your rectum alone is enough to make you feel like the village whore, and it's not just your rectum that's full. You can feel it oozing out slowly - there are definitely jellified chunks of the stuff in there.",			
			"She makes you clean it off, sucking on her half-flaccid penis until she's satisfied, then bends over to give you a peck on the cheek and goes on her merry way. You decide not to hold onto all of her cum for safe keeping, so you dump it all out in the bushes, doubting that you cleaned out all of it."			
		]
	},
	{
		"key": "003-05",
		"scriptLines": [
			"You ask for her to pull out and cum on your face - not the way you want it to go down, but you can't think of any other way to convince her not to gum in your guts.",
			"She hears you, then slows down... and, thankfully, she tugs it out, schlorping all the way, until it pops up, casting a shadow onto yours, erect and pulsing and ready to shoot. That is, both of them are. You try to contract your recently-vacated hole enough to trigger it, somehow, but to no avail. You whine - you're likely not going to get to finish.",
			"She considers something, fixating on your face, clearly deliberating something, then climbs over you, bringing her fresh-out-the-ass cock bobbing in front of your nose."
		]
	},
	{
		"key": "003-06",
		"scriptLines": [
			"\"Fine... smile for me and think creamy thoughts,\" she says, running her hand down her long shaft, causing a dollop of precum to slowly inch its way downwards towards your neck, where it lands and begins to pool, a steady stream of rivulets.",
			"Her dick smells exactly as you expect it to - your hole twitches as you stare at it, wanting at least half of it back up in it where its uncomfortable stretching would give you just the last bit it needs to convulse and spasm to completion. But it isn't going to get that - instead, you're just going to get your face painted.",
			"\"Kiss it,\" she says, and you kiss her dick, feeling ridiculous... until she brings herself up onto her knees, and dangles her balls in front of your lips. \"Now kiss them\", she says, and you obey, hesitantly.",		
			"You peck her swollen sack, and, satisfied with that, she tells you to open up, and reluctantly, you let her balls into your mouth.",			
			"She dunks her sack into your mouth until she's satisfied that the whole thing is stuffed inside, then isntructs you to lick around them. Your tongue can somehow taste the cum bubbling inside, and it does not taste appealing."
			"She pulls the whole affair out of your mouth and begins to stroke... and you prepare yourself for the inevitable. It won't be long now.",			
			"She strokes it until, finally, she stops, and she grips tightly, and her whole cock jerks. Then, the first rope of cum shoots out - and it is a whopper.",
			"As if in slow motion, you see the mass descend - a thick, heavy looking blob that eclipses the sun that's bleeding through the canopy, looking like a widowmaker falling on a hapless forest-goer.  In that tiny window of time, you brace yourself for the impact, knowing it's probably going to sting, and shut your eyes reflexively.",
			"Thankfully, you manage to close both eyes before she blinds you. A heavy thud of thick slime lands on and thoroughly coats your eyelashes, probably gluing your left eye shut in the process. Still, it's better than her sperm trying to impregnate your eyeball - and there must be a ton of it, because it's thick like porridge.",			
			"The smell of her spunk hits you like a haymaker - there's definitely been a fermentation process happening in that broiling goosack of hers. It doesn't help that she shot one hot stream of it right up your nose, where it will likely now cool on your brain.",
			"Each fat ropey blast of her ejaculate lands disgracefully on your face - her aim is perfect, even if her mercy isn't. Each rope contributes to the white, sticky mess of a mask that now resides on your face, so gummy and sticky that you're pretty sure you could peel it all off at once when it dries. That is, if it ever dries.",
			"It's gloopy, to say the least - big chunks of balled up sperm and penis juice slowly slide down off the sides towards your ears as her lake of cream flows outwards, like spooge glaciers.",
			"By the time her ejaculations are clearer and thinner, spurts of more reasonable size, your entire face is coated in white-and-clear slime, bubbling around your nostrils, and making it impossible to see. You're completely at her mercy, and she just gave you a facial that could double as a creampie for comedic effect.",
			"Your cock is still hard, twitching, and eager to cum - and will remain that way, now that her sexual appetite is a cooling mess coating your face. You feel like you've been basted.",
			"You hear her blow you a kiss, and again your unsatisfied cock twitches, but then, she stands up off of you, and you hear her stuffing her deflating trouser snake back in her pants.",
			"\"A gift, from me to you,\" she says, tauntingly, \"I'd leave you with a rag to wipe it off, but I've not got one, and I think it looks good on you.\"",
			"Chuckling to herself, you hear her boots crunch on the leaves as she saunters off, leaving you face-up on your back, naked, freshly fucked, still hard and stiff, your face covered in the white and clear ooze that is the stuff of lewd finishers.",
			"Eventually, it dries enough that you can open your eyes, with some help from your fingers to pry open the glued-shut eyelashes, and you wipe what cum you can off onto your sleeves, feeling gross. With the brigand long gone, you make your way through the forest, this time unmolested, but with dried cum coating your blasted face."
		]
	},
	{
		"key": "003-07",
		"scriptLines": [
			"All at once, an unpleasant taste fills your mouth, and a few inches of girl dick fills your throat.  There isn't much build up - she thrusts once, twice, three times, pinning your head against the ground, and then you feel a warm, sticky spray down your throat, and before you know it, you're already swallowing her cum.",
			"She coats your throat immediately, and the surprise causes you to spit up a lot of it around her cock, your cheeks filling to bursting and your eyes open wide in shock.  Your lips and mouth were forced wide open by her sudden thrust, and you're still stunned, even as she empties her balls down your gullet.",			
			"When she's finished, she pulls out, and her cum erupts out of your mouth and all over your body. You spit it out as best you can, but she doesn't seem to care - in fact, she saunters off without another word."
		]
	},
	{
		"key": "003-08",
		"scriptLines": [
			"You decline her invitation, waving her away. \"Get out of here,\" you demand, and her eyes narrow."
		]
	},
	{
		"key": "003-09",
		"scriptLines": [
			"\"Fine. Be like that,\" she says, throwing her cloak over her shoulder as she turns to leave. You watch her disappear into the forest - a battle averted."
		]
	},	
	{
		"key": "003-10",
		"scriptLines": [
			"Her lip curls into a snarl, and she draws her weapon. \"Well, who asked you, anyway?!\" she cries, and you prepare yourself for her attack."
		]
	},	
	{
		"key": "003-11",
		"scriptLines": [
			"You feel a sharp pain in your back - you failed to spot the hidden danger, and it made itself known violently.  You spin to face the source of the pain - a woman, rough and worn, holding a red-tipped blade.  You adopt a fighting stance."
		]
	},
	{
		"key": "003-12",
		"scriptLines": [
			"Your lack of awareness costs you.  Your pants drop - something must have pulled them down!  Your unseen foe works quickly - and, unfortunately for you, their intentions are anything but benign.",
			"Your breath is caught in your throat as you feel something fat worm its way inside of you, taking the path of great resistance - you've been penetrated, anally.  What is no doubt an erect, spit-slick phallus is poking into your guts, putting a crushing pressure on your insides, and you hear a female, if throaty, voice speak.",
			"\"Phew.  It's my lucky day - that's some tight ass-pussy. You really need to pay more attention, boyo.  Just a warning for the future\", she says, gripping onto your shoulders, and though you can't see her face, you know she's smug about it.",
			"\"Now if you'll excuse me, I have some idiot-hero ass to blast.  Hooah!\""
		]
	},	
	{
		"key": "003-13",
		"scriptLines": [
			"Your weapon falls to the ground as the brigand bats it away with her targe. \"Well, well. We coulda done this the easy way. But now we're gonna do it... hard,\" she says, grinning, and the bulge in her pants is indicative of exactly what she means.",
			"\"Mmm... look at those pouty lips. Almost as full as my bloated nutsack. Y'know, it can get awfully lonely, living alone in the woods. But I never touch myself. Y'now why?\" she asks, raising her eyebrow suggestively.",
			"You remain silent, looking down at the tremendous bulge in her pants - which seem to be getting even tighter.",
			"\"Because when my girls get so stuffed full of goo that it gets thick like jam, letting it out feels like heaven. Tastes like hell, though. Not too many wenches in the forest willing to chew on a load, if y'know what I mean,\" she says, as if that was somehow a euphemism.",
			"You don't doubt that she's got a full set - you can make them out even through her trousers.",
			"\"As soon as I saw you, I was hoping I could get a quick, sloppy blowjob before sending you on your way with a gut full of boiling brew. Know what that means, don'tcha? You're gonna kiss my fat sack while my screamin' eye bastes your tonsils. But I'm getting ahead of myself... open wide!\"",
			"You don't obey, and she presses the tip into your lips, filling your head with her scent as she spreads her precum over your lips and cheeks trying to gain purchase. She doesn't seem to mind, until, finally, she pinches your nose shut, holds your head in place, and waits for you to part your lips - at which point, you gag on her, and her shaft gets wet."
		]
	},
	{
		"key": "003-14",
		"scriptLines": [
			"Her full set slaps repatedly against your chin - evidence that she wasn't lying about how often she coats a tree in her own sap. A shame - if she did occasionally baste some bark, or sprinkle some suds in the dirt, it's highly unlikely that her balls would be so stuffed full and eager to drain, or that such draining would result in so much jelly-like, unpalatable spermslime.",
			"Of course, it would be even more fortunate if that was irrelevant to you - then it wouldn't matter that she'd been saving it up for days, or weeks, to the point that it probably audibly sloshed about in her ballsack as she walked, because that disgusting semen slurry wouldn't be ending up in your mouth, throat, and stomach.",
			"You can tell by the full, pulsing nature of her fat sack pressing wetly against your chin that her sperm overdose is about to become your problem very soon - her ejaculation mid-irrumatio is all but assured.",
			"Her cock pulses in your mouth, unquestionable evidence of her orgasm, which means, unfortunately, that it's only a matter of heartbeats before her nasty cocksnot explodes out of her cock's eye and into your unprepared mouth.",
			"In those last moments where you're blissfully unaware of the taste and texture of her creamy sperm cocktail, your mind tries desperately to find an out - some way to avoid being blasted in the face with her pungent genetic goo, but it's interrupted by said goo making its presence felt in such an obvious way that it renders the point moot."
		]
	},
	{
		"key": "003-15",
		"scriptLines": [
			"Blorp.",
			"The deluge kludges its way over your tastebuds, giving you a blast of flavor that is undoubtedly straight from the bottom of the nutsack.",
			"You gag, because, well, yeah.",
			"You feel like her horrendous spermsludge is shooting directly into your brain, coating it in a greasy, sticky mess of discarded ball juice.",
			"You feel lucky that it's leaking out of your nostrils, bubbling and frothing as it does, because at least then you know not all of her breeding slime is going to end up stuck in your head, although it is still humiliating to feel her cum spewing out of your nose because there's too much for you to swallow.",
			"Even if it didn't taste awful, salty and slimy and bitter and hot, its sheer thickness makes it difficult to swallow.  It's so viscous that your throat nearly clogs the first time you try, although you manage to glug down enough of it that you know exactly what the swill you're reluctantly chugging down is - nutbutter.",
			"As soon as that first batch of gloogy, soon to be disappointed spermsoup flows down your throat and into your stomach, it turns.  If she hadn't managed to spew it in your mouth, your lips would have been defiled, but at least your gut would have gotten away unscathed.  Instead her cooling, denatured ejaculate is upsetting your digestion, and your throat is coated in her slime.",
			"The inner linings of your throat are so thoroughly coated with the greasy stuff, in fact, that even when she isn't spurting more of her homemade honey down it, you can feel it slowly flowing downwards, in big, goopy, impregnating batches.",
			"The way it flows, it really does feel like slime - except instead of coating the inside of her pouch puppies, or seminal ducts, it's sliming up your throat, still hot from the source, threatening to make you choke.",
			"Every time you swallow you're forced to remember that you sucked on her penis until she came in your face, and your lips aren't exactly penis-sucking free; to the contrary, you still have her erect penis in your mouth, and will until she's finished with you.",
			"It isn't much longer before that's the case, and her half soft, and definitely empty willy slides out from between your wet lips, trailing slime down to the floor.",
			"Your mouth is agape in shock, which allows the gelatin-like goop to viscously slop out slowly.  As the stringy threads of her semen ick towards the floor, you realize that the entire inside of your mouth is coated in a thick, goopy layer of stuff that should rightfuly be coating the inside walls of a vagina - or, as the oily stuff was a minute ago, the inside of a ballsack.",
			"If she cares that you're letting the latter half of her premeditated sperm blast drool onto the floor, she doesn't show it. In fact, she seems entirely disinterested - still lost in the daze of having blown ten loads' worth all at once down someone's throat. Without even looking at you, she wipes her nose, coughs, and checks the fullness of her balls, to her satisfaction.",
			"After emptying her nutsack in a torrent of semen into your face, she simply hoists up her pants, glances sideways at you, doubled-over, drooling it out in thick globs onto the floor, and then saunters off into the forest, her goal complete.",			
			"Finally coming back to your senses, you cough and spit up what you can of the nasty, thick stuff at the base of a tree, wiping your mouth clean with your sleeve, though its coated in saliva and her cum and precum - a real mess.  You clean it up as best you can, and spit it up as best you can, but there's still a few load's worth bubbling in your stomach, which is very upset about your choice of meal.",
			"With the brigand's greasy lust weighing heavily in your gut, you rest to heal your wounds, feeling particularly nauseous about the whole affair."
		]
	},
	{
		"key": "003-16",
		"scriptLines": [
			"Having drained her load in you, the Brigand seems satisfied.  She sheathes her weapon, and also puts away her sword, and leaves you to puzzle out what to do with all of her semen."
		]
	},
	{
		"key": "004-00",
		"scriptLines": [
			"You encounter a woman sitting on a tree.", "On closer inspection, you notice that she's not sitting on the tree, but rather, is fused with it - could she be a dryad?",
			"As you approach her, you see that she is holding an apple that looks incredibly delicious.  You suspect that if you could take a bite of that apple, your hunger woes would subside for a time."
		]
	},	
	{
		"key": "004-01",
		"scriptLines": [
			"You offer the dryad your apple in exchange for her apple, and she accepts, giggling.",
			"You bend over, and she rubs her hands, sticky with sap, over your rear, and into your offered-up apple core.",
			"Up goes her wood, with little fanfare. It's smooth and polished, and quite literally wood.",			
			"Something is wrong... she glides it in and out smoothly, thanks to the sap, but you're starting to sweat - something feels off."
			"Then, you can finally feel it - splinters.",			
			"It irritates your anal mucosa, even as her wood becomes smoother and more polished. You're red in the face for all the wrong reasons - thankfully, the dryad proves to be a quick shot, and you feel her sap rush in all at once.",
			"Her thick sap stings your scratched, swollen innards."		
			"Your irritated hole still drooling her sap out unevenly, she rests the apple by your face, and you stare at it cross-eyed as she giggles and retreats into the wood."
		]
	},	
	{
		"key": "004-02",
		"scriptLines": [
			"You convince the dryad to offer up her apple."
		]
	},	
	{
		"key": "004-03",
		"scriptLines": [
			"The dryad is unconvinced by your offer, and melds back into her tree, disappearing without a trace. Disappointed, you leave."
		]
	},
	{
		"key": "005-00",
		"scriptLines": [
			"The plains are vast, and you walk along them, humbled by the visions of the distant mountains.",
			"In the far distance, you see... horses?  Something about their profile is odd.",
			"As you get closer, in the hopes of satisfying your curiosity, they all but scatter - but as they do, you get a glimpse of one of them as they turn to look at you - and a very human gaze meets yours.",
			"By the time you reach where the group of the strange half-horse creatures had been, none are left... but you detect a presence still lingering nearby."
		]
	},
	{
		"key": "005-01",
		"scriptLines": [
			"You hear a frenzied whinny, and spin around just in time to avoid being trampled by a brightly colored creature much like the one before.  When they turn to look at you, you see that it's female... a rather well-endowed female... and that her colors are quite vibrant.",
			"Even more strange, she has a horn on her head... and... between her legs...",
			"It's... rather erect... and the look on her face is quite mad - she wipes her saliva on her wrist, even as the thing pointed directly at you drools a clear strand down into the dirt, which quickly pools into mud.",
			"You tense up, but in one place in particular.  It seems you'll have to fight off her amorous advances."
		]
	},
	{
		"key": "005-02",
		"scriptLines": [
			"From hidden behind a nearby boulder emerges one member of the herd - a female, with a rather buxom appearance.  She approaches you serenely, proudly.",
			"\"Human.  You are trespassing on centaur lands. Leave now and we will bring you no harm.  Or fight me - and earn your place at our campfire,\" she says, and it's clear those are your only two options... that is, until you spy something dangling between her legs. It's not aroused, but..."
		]
	},
	{
		"key": "005-03",
		"scriptLines": [
			"You get down on your hands and knees - you can't believe you're doing this, but you also can't believe how much of a horse cock she has.",
			"You pull your pants down and spread your cheeks, and she wastes little time in acquiescing to your subtle demands, trotting over, her cock freeing itself of its sheathe in search of another.",
			"She doesn't hesitate to begin prodding it against your poor hole - once, twice, three times, and you yelp, as she begins to stuff it inside, your mouth agape in awe and your backdoor opening far wider than is comfortable.",
			"Sweat drips down your face as she pushes it inside - even though you're holding yourself open, it's still a lot of dick to stuff into a very tight, soon to be cavernous pussy.",			
			"It lurches inside you, putting a crushing pressure in your bowels, and you fear you've bitten off more than you can chew.  You get the feeling if you let her cum, you're going to be winking for days.",	
			"\"Mmmm... we mate for life, you know,\" she says... and you realize you're going to have to fight your way out of this one."			
		]
	}
	{
		"key": "005-04",
		"scriptLines": [
			"You collapse to the ground.  You will your legs to move - you know that if she gets the chance to, she's going to blow your ass away.",
			"You spot it as she trots past you to reach your upturned behind - it must be nearly two feet long, and it is clearly raring to go.  You consider telling her that you're male, but you get the sense that anatomical incompatibilities are not at the top of her concerns.",
			"She's completely in a lustful frenzy - there's no mistaking what she plans to do with her two feet of grade-A horse meat, her swollen equine testicles desperate to be drained, and she is going to absolutely destroy your ass if she manages to get it in.",
			"\"A virgin...\" she says, wistfully, like a schoolgirl in love - even as her rigid pooper-pusher bobs considerably under its own weight with each of her excited steps.",
			"You don't know why the colorful girl has a very male centaur's equipment, but you're not much in the mood for trivia, any more than she's in the mood for conversation.",
			"You expect her to ram all eighteen inches of her rectal rooter right up your rear, and to subsequently die, but instead she sits, bringing her human body forward, clearly drooling with anticipation, her face wide-eyed with anticipation, excitement and fuck-craziness.",
			"She spreads your cheeks and dives in tongue-first - you have no time to prepare your heart before her strangely-human tongue wriggles itself up inside of your butt, where she begins to flex it around skillfully to reach every crevice and coat it with her saliva.",
			"Your legs are still numb, but tingling as she probes your hole with her spongy but still-rigid tongue, and you're sure that her cock is still just as stiff as when you last saw it, so... you know what's about to happen. Still, you moan, trying to get out the words that will give her pause, but the words don't come.",
			"She returns to her feet, and all but immediately presses her fat head square up against your hole, knocking the wind out of you.  Thankfully, she doesn't gain purchase, but it's only a matter of time before she does.",
			"Again and again she taps it, full force, against her makeshift mare's hole, threatening each time to initiate an equine anal adventure that you will likely never forget - and for the next few days, at least, your rectum and a mare's pussy will share certain characteristics.",
			"Namely width, elasticity, and equine semen content.  You wonder where horse-cum enema rates on the dignity scale, but it can't be very high.",
			"You feel her lustful stickiness dripping down your own testicles as she coats your button hole with it with each lewd kiss, until finally, you start to feel something give way - as does she, and rather than retracting for another tap, she begins to lean her weight forward.",
			"\"Virgin... virgin...\" she chants, mesmerized, as your sphincter gives it up - it begins to open up, and you feel her leathery funstick start to sink inside - until, much to your consternation, it opens wide to accept its new gift and semi-permanent shape, and the entire plains hears your frustration as you receive your first taste of horsecock right up the butthole.",
			"You lose your virginity in a completely unmistakable fashion, and as she moans in high-pitched excitement, you know that she got exactly what she came for.",
			"She's crushing your guts with it, as a visible bulge moves up and down your abdomen.  Her upper body is still, and indeed, her lower body is mostly still as well, but even the slightest movement sends several inches of horsecock squelching up into or out of your stretched-wide hole.", 
			"She drills it into you, scooping out your recently repurposed shitpipe with exactly the care and finesse you would expect of a horse.  By the time you've received ten lengths of her horse schlong via her erratic jerks and thrusts, you know quite well that centaur unicorns are poor lovers - and that anal sex isn't always the answer to life's problems.",
			"At the very least, your first time (embarrassed and humiliated by a woman with a big horse cock) is mercifully short, her breath itself getting shorter and shorter and higher and higher pitched until she says the magic words, her leathery dick scraping against your bowels earnestly all the while.",
			"\"I'm... cumming!\" she groans, right before that is made incredibly obvious as your stomach balloons outwards, her stinging unicorn cum enema probably the least subtle creampie ever - especially for someone who's never experienced a creampie of any kind before.",  
			"She pumps a full load of it inside before the sudden shock finally gives you enough strength to clamber forward, her rapidly drooping horse cock slipping out of you, spilling the rest of its payload into the grass.",
			"A geyser of white and clear liquid erupts from your devastated hole - clearing several feet behind you, dousing everything in the general region with her still-hot horse cum.",
			"Somewhat shellshocked, she kneels again to inspect your gaping winker.  She smells your gaped-open mare pocket, which, of course, smells of her overflowing cum, and her ear twitches.  She rears up, and turns away sharply, then breaks into a run - apparently, now that you're no longer an anal virgin, she has no use for you.",
			"You lay there for a few hours, until finally, you feel strong enough in the legs, and enough of her sauce has run out, and you manage to get to your feet, a bit unstable, looking like a newborn deer.",
			"At the very least, it seems her kind won't bother you again - although it is somewhat bittersweet, knowing that's because you had your first sexual experience on the end of a big horse dick, and have the crater and shotgun creampie remnants to prove it."			
		]
	},
	{
		"key": "005-05",
		"scriptLines": [
			"The centaur hoists you up, limp and spiritless.",
			"\"So weak. You trespass on our land, and then you offend me with such a trivial challenge?  Hmph,\" she snorts, and slings you onto her back.  She kicks off into a trot, with you still haplessly strung across her back.",
			"When the wind returns to your lungs, you ask her where she's taking you.",
			"\"Our menfolk haven't had any surrogate mares as of late.  I'm sure they'll find a use for a cute, girlish human like you,\" she says, snickering.",
			"Your mind reels.  She couldn't mean... your mind pictures the anatomy of a male horse, and your sphincter tightens with an audible squeak.",
			"You try to convince her that she's wrong - that you're male, and that you're not suitable as a mare... to which she sternly replies that you shouldn't be so hard on yourself.",
			"The gathering of centaurs, perhaps a herd, is large indeed - thirty or forty of them.  You are disheartened to learn, quite quickly, that around half of them are men.",			
			"She wasn't wrong about the menfolk finding a use for you.",
			"By the day's end, you find yourself grasping the forelegs of a male centaur while he thoroughly makes you his mare, an anal ordeal that is the first of many.  You grit your teeth as sweat pours down your face and your ass is ruined by a horse's dick - that it happens to be gay sex is the least of your worries.",
			"As the male centaur erupts, his runny semen filling and overflowing your bowels, a quick-shot by any measure, you hear the clopping of another centaur, ready to drain their foot-and-a-half-long cock in your already greased up innards, and you know that your adventure is over.",
			"You will be fucked in the ass by horses that happen to be half-men until they get bored of you, which might be never.  You should have never trespassed in the centaur's land.",
			"But then, what is the greater trespass - yours into their land, or theirs into your ass?"
		]
	},
	{
		"key": "005-06",
		"scriptLines": [
			"With the centaur cum filling your stomach, you have little energy to fight her.  Her cock is so large you thought you might pass out.",
			"\"Hmm.  I'm a bit ashamed that I was so easily seduced,\" she says, her face red.  The large object that had been dangling between her legs has slowly retracted.",
			"You can't really respond - all you can do is cough up the semen that she's lodged in your digestive tract.",
			"She canters about, apparently not at all winded by your 'fight'.  You watch her warily.",
			"\"I didn't think humans were so interested in the affections of centaurs,\" she says, somewhat amused.  \"I suppose I should thank you for your hospitality.\"",
		]
	},
	{
		"key": "005-07",
		"scriptLines": [
			"You lay motionless as she trots up to you, kneels, and lays her bow on the ground.  Without another word, she trots off, having already gotten her satisfaction with your too-small body."
		]
	},
	{
		"key": "006-00",
		"scriptLines": [
			"A whoop.  A howl.  Tinkling, and a low grumble that's simultaneously far-off and immediate.  Your heart beats in your chest - the alien sounds surround you and permeate your skin and leave you feeling deeply unsettled.",
			"The fey forest is untread by most mortals - its wonders are many, but its dangers even greater.  Strange creatures peek out from holes dug into giant mushroom stalks, their myriad eyes tracing your movements unblinking, with the largest of those eyes disappearing into obscurity whenever your gaze catches theirs.",
			"That you are being watched isn't what concerns you.  As you hear the cracks of broken twigs underfoot, it is the notion that you are being -hunted- that causes you to tremble each time you approach a blind corner.",
			"After passing a massive mushroom, you spot what appears to be a small trail, with an \"entrance\" of sorts between two tall stalks.",
			"A string of... teeth, it looks, sharp and pointed, has been hung between them, and in the gap between said rows of teeth is a simple wooden sign, carved from some tree that is certainly not of this particular forest.",
			"\"KEEP OUT\" it reads, rather forebodingly."
		]
	},
	{
		"key": "006-01",
		"scriptLines": [
			"Deciding that whoever wrote the sign probably had a good reason for doing so - either to keep passers-by out of dangerous territory or to warn them about trespassing, you continue on the main trail through the strange forest, still visibly shaken."
		]
	},
	{
		"key": "006-02",
		"scriptLines": [
			"You ignore the warning - your curiosity getting the better of you.  You pass underneath the sign and the string of teeth, and begin following the small trail.",
			"It's small in more ways than one, not only is the path barely cleared at all, but you have to stoop under several mushroom caps to even continue on.",
			"If not for the bioluminescence of some of the mushrooms, you'd be cloaked in darkness - the growth is denser here than on the main path.",
			"Eyes still follow you as you go, and you start to hear more and more intimidating sounds.  You shake your head, trying to get ahold of yourself.",
			"\"Nyahaha!\" A sudden peal of high-pitched, frenetic laughter that echoes through the forest.  Something small scurries past your field of vision, leaving behind a diminuitive human outline in your mind's eye that is as disturbing as it is quick.",
			"You hear more giggling, and try to listen for the tiny footsteps, but suddenly the quiet forest sounds positively cacophonous - you try to drown out everything you can to home in on the sound of an approaching creature."		
		]
	},
	{
		"key": "006-03",
		"scriptLines": [
			"You home in the exact location of the noise you heard, and your eyes lock on a small, diminuitive figure.  They quickly dive into the undergrowth, trying to break your line of vision, but your keen senses are able to track them regardless of where they go.",
			"They dart through the underbrush and position themselves nearby, unaware that you still know exactly where they are.  They try to nick you with their spear, thrusting out from the growth."
		]
	},
	{
		"key": "006-04",
		"scriptLines": [
			"You manage to dodge the tip and grab the shaft of the spear!"
		]
	},
	{
		"key": "006-05",
		"scriptLines": [
			"You're able to yank the spear away from them!  Disarmed, they retreat back into the growth."
		]
	},
	{
		"key": "006-06",
		"scriptLines": [
			"You struggle with the spear, but relinquish it before they can cut you with it.  They won't be trying that again, you think, as they retreat back into the growth."
		]
	},
	{
		"key": "006-07",
		"scriptLines": [
			"You manage to dodge the spear, and they retreat back into the growth."
		]
	},
	{
		"key": "006-08",
		"scriptLines": [
			"You're still too slow to dodge it; it stabs into your chest.  You take 5 damage. You watch as they retreat into the growth."
		]
	},
	{
		"key": "006-09",
		"scriptLines": [
			"They try to run past you, a whip-like motion of their dagger aiming at the waist of your pants."
		]
	},
	{
		"key": "006-10",
		"scriptLines": [
			"You dodge out of the way effortlessly and disarm her, the dagger clinking to the floor.  Before she can escape, you hoist her up into the air.",
			"\"If ya keep treatin' me like a pinkskin spawn, I'm gonna bite ya! Nyaha!\" she threatens, still laughing hysterically.",
		]
	},
	{
		"key": "006-11",
		"scriptLines": [
			"You put her down, and she thankfully seems to have calmed down.",
			"\"Nyaha! Thanks, pinkskin! Glad we can see eye t' eye!\" she says, though you have to look down on her even as she does.",
			"\"Why did you attack me?\" you ask, accusingly.",
			"\"Can't ya read? This is my gobbo home! Can't let any pinkskin that feels like it to come in uninvited. That's how ya end up with gobbo stew!\" she claims, although you can't tell if she's being serious or not.",
			"You nod along with this, and she looks up at you with her big, red eyes.  A silence sets on the enchanted forest.",
			"\"So, wanna blowjob? Nyaha!\"",
			"Well.  That simplifies things."
		]
	},
	{
		"key": "006-12",
		"scriptLines": [
			"Although you're wary of her sharp teeth, you assent."
			"You lower your pants warily, and she eyes you with similar suspicion.  You can see from the growing bulge in her loincloth what you'd be dealing with if you were on the other side of the equation, especially as the bulge grows when she sees your exposed member.",
			"Since you didn't travel down this path to learn what a goblin's dick tastes like, you're glad you managed to get her in good spirits.",
			"She barely has to squat to get into position, looking up at your quickly-stiffening chub with a mix of mischief and amusement.  She opens her mouth, letting you get a good look inside - aside from the very obvious row of sharp teeth, it looks very inviting.",
			"\"Don't cum in my mouth or I'll bite yer dick off,\" she says, informatively.  She picks up a thick branch and puts the breadth of it in her mouth, then bites down - and it breaks into three pieces like it was made of candy.",
			"While you stare, white faced, at the destroyed branch, she opens wide and takes your entire penis into her mouth.",
			"Despite her teeth, the sensation is entirely comfortable, and she goes to work sucking, her cheeks sunken in, on your precious human penis.",
			"Her tablemanners are as to be expected, and she schlurps and gags her way up and down the shaft with little care for propriety... which has an outsized effect on your need to seed.",
			"You feel your babymakers start to tense - and try to warn her with a simple \"I'm going to...\" but she doesn't get the hint.",
			"As she continues to pump your pole in and out of her small mouth, her hair slapping against your abdomen, her chin against your tight balls, the need becomes even greater.",
			"\"I'm g-going to cum!\" you warn her, but again, she pays you no mind, taking a long slurp of the base all the way to the tip.",
			"You try to pull away, realizing that the cum rising from your balls is unlikely to end up anywhere but in her mouth - and you distinctly remember her warning.  She follows you, holding your hips to keep your cock in her mouth.",
			"You fire off into her mouth - pulling desperately at her hair to get her off your cock, even as she stubbornly gets her throat coated in human jism.",
			"As your orgasm dies down, you feel it - her jaw tightening, her teeth closing in on your penis.  You stare at her, wide-eyed in fright, and she slams her jaw shut - but you don't feel anything.",
			"You nearly faint, but you hold on to your reason - there's no pain, and your penis seems to be just fine.  She opens her mouth to reveal that her teeth have retracted.",
			"Still, you go weak in the knees, and collapse onto the ground.",
			"\"I told you not to cum in my mouth.  Lucky for ya, I swallowed it into my extra tank,\" she says, before closing her mouth, winking one eye, and then making a strange squelching noise.",
			"All at once, her cheeks, formerly sunken in while sucking your cock, fill to an obscene size.  She walks over to where you lay, and stands over you, cheeks still absurdly full... and a white dribble escapes the corner of her mouth, her eyes full of crazy malice.",
			"You panic, and try to flail out of her grasp as she pins you down, sitting on your chest.  She firmly grips your nose shut, and brings her full face close to yours.",
			"Starved of air, you open your mouth, and her fingers shoot inside, holding your mouth wide open, as she slowly opens hers.",
			"A big blob of your nutslime and her saliva drools slowly downwards towards your open mouth.  You watch, helplessly, as it descends, still full of lively sperm and gooey protein.",
			"It slathers over your tongue and falls towards the back of your throat, until her mouth is empty and you're gargling your own nutslime.  Again she pinches your nose, until, reluctantly, you swallow it down.",
			"\"Yer welcome, pinkskin!  Nyaha!\" she says, slapping your cheek playfully, before jumping up off of you and running headlong into the forest, disappearing completely."
		]
	},
	{
		"key": "006-13",
		"scriptLines": [
			"You hold up your hands, the universal gesture for \"nuh-uh\".  She shrugs, and wanders off, waving you past as she does."
		]
	},
	{
		"key": "006-14",
		"scriptLines": [
			"You turn her over your knee."
		]
	},
	{
		"key": "006-15",
		"scriptLines": [
			"You restrain her, tossing aside her loincloth so as to expose her big, round cheeks - which, you have to admit, are rather shapely and appealing.",
			"Your hand rises into the air, and she stutters out a plea. \"W-wait a s-sec!\"",
			"With a whip-crack, you spank her big goblin rear, and she cackles - the cackles only grow more and more intense with each thunderclap of your palm against her fat cheek.",
			"She growls and groans with each spank, but with her loincloth pulled aside, you can feel that her strange goblin knob is twitching with lust.",
			"Rather than turning red, her cheek turns a dark shade of green, and her cock dribbles onto the ground.",
			"Her voice gets tighter, more ragged, along with her breathing, and her whole body begins to tense up.  You slap her fat rear playfully a few times, then again you bring your hand down mightily, with a solid, echoing crack.",
			"Finally, she begins to shiver, and her whole body convulses, and you hear her spray a substantial load into the dirt - food for the mushrooms.",
			"She goes limp in your lap, and you roll her off into the dirt, where she lays, looking content, although obviously sore on the rear.",
			"You continue on your way, unperturbed by the foolish goblin's antics."
		]
	},
	{
		"key": "006-16",
		"scriptLines": [
			"She wriggles out of your grasp and bites hard on your leg.", "You take 5 damage", "Her feet hit the ground running, and before you know it, she's gone."
		]
	},
	{
		"key": "006-17",
		"scriptLines": [
			"You dodge out of the way and trip her as she passes."
		]
	},
	{
		"key": "006-18",
		"scriptLines": [
			"You disarm her dagger, and she turns to run."
		]
	},
	{
		"key": "006-19",
		"scriptLines": [
			"You manage to dodge her, and she makes a break for it."
		]
	},
	{
		"key": "006-20",
		"scriptLines": [
			"She's faster than you, and she manages to cut down your pants before you can act.  They fall to the ground.",
			"She kicks at the back of your knee, and you follow.",
			"\"Nyahaha! Too slow!\" you hear her cackle, and then you hear the sound of... meat?",
			"All at once, you feel a sudden pressure in your bowels - and you don't have to turn your head to check that she's got a cock.",
			"Red-faced and embarrassed, you realize that she's already inside... but it's not too late for you to fight back!"
		]
	},
	{
		"key": "006-21",
		"scriptLines": [
			"You hear a faint rustling, and spin to face the source of the sound.",
			"You see a contraption - some kind of swing, which is quicky dismounted by a figure that darts back into the dense undergrowth, giggling all the while.",  
			"You lose sight of the figure - you stand on guard, when suddenly, you hear rustling in the bushes near you!"
		]
	},
	{
		"key": "006-22",
		"scriptLines": [
			"\"Can't ya read?!\" you hear... although the high pitched voice appears to be getting closer rapidly as it is said."
		]
	},
	{
		"key": "006-23",
		"scriptLines": [
			"You manage to dodge out of the way at the last moment, landing on the ground, a heavy mass having narrowly avoided your head.",
			"You turn to see that a small figure has rode some kind of swing that would have hit you had you not managed to get out of the way, and they dismount from it, then disappear into the undergrowth."					
		]
	},
	{
		"key": "006-24",
		"scriptLines": [
			"You feel something bump against your head - but it doesn't really bother you.  You think you hear someone cursing in a high, strange voice, but by the time you turn to check, there's nothing there.  Must be the breeze.",
			"You continue through the forest, oblivious."
		]
	},
	{
		"key": "006-25",
		"scriptLines": [
			"And then... darkness.",
			"You wake in a dark void, illuminated by a single, glowing object... although you can't quite make it out yet.",
			"You hear distant laughter that sounds like... \"nyahaha\".",
			"The floating object resolves, and your eyes widen.  You see a golden ring floating in the air, around the size of your fist.",
			"As you watch it floating, slowly rotating, it suddenly jerks to a stop, and begins to shake.  With another distant peal of laughter, the ring begans to expand.",
			"It grows wider and wider, thinner and thinner, as you watch in awe.  As if it was a portal to another realm, something emerges from within, the ring now larger than your head.",
			"The... thing is green, with fist-sized protrusions on it that look disturbingly like warts.  It has an eye-shaped opening on the end, although it's filled with some kind of slimy liquid.",
			"More and more of it emerges through the thinly stretched gold ring, and you watch, dumbfounded by the strange sight before you.",
			"In the distance, you hear more laughter, and something that sounds suspiciously like an insult.",
			"You watch with a morbid fascination as the object pushes through the gold ring at various odd angles, stretching it this way and that, particularly as it accomodates the wart-like bumps.",
			"Your curiosity gets the better of you, and you try to see on the other side of the ring, even though the object is plainly coming from out of thin air as it forces its way through the ring, like some kind of portal.",
			"To your surprise, you do see something on the \"other side\", as it were.  Two large, undulating orbs, a similar shade of green as the ring-defying object.  They appear to be fluid filled, and rather full at that - they move with a hypnotic sloshing motion, to and fro.",
			"As you approach them, your suspicions are confirmed - they audibly slosh, full of some kind of thick goop.  Cautiously, you reach out to touch one, and you sense that it's full of malice.",
			"As soon as your fingertips make contact, you feel an overwhelming desire - an intense heat, and you hear another peal of laughter, high pitched and eager.",
			"The orbs look ready to discharge - magical energy, perhaps? - so you round the ring again, to see what became of the invasive green object.  Its goo-filled eye is now dispelling liquid that pools on the floor obscenely.",
			"It's running roughly through the ring over and over again, and you hear the sloshing of the orbs growing louder and louder.  You peek around the ring to see that they're contracting into themselves, looking to get tighter and tighter.",
			"Suddenly, they stop moving entirely - pulsing with an evil energy.  You shift your view again to watch the green mass - which twitches upwards, anchored by the ring.  You feel the heat in your own cheeks rising, which only gets more intense a moment later.",
			"All at once, a thick, sap-like liquid, a creamy white mixed with runny clear, spurts out of the eye with force.  The rope flies through the air, clearing several feet before the whole of it falls to the ground audibly, leaving a thick streak cooling over a long strip.",
			"By that time, the second blast had joined the first in the air, and landed partially overlapping it, followed by a third and fourth, each one making you feel more and more heat in your cheeks and, oddly, your stomach.",
			"By the time the eruption ended, a wide swath of the ground was covered in the sticky stuff, and the smell was overpowering.  Rounding the ring again, you see that the orbs have stopped contracting, although they still seem rather full.",
			"All is still for a bit... and then the object begins to move in and out of the ring again, along with another peal of laughter.",
			"Before long, the orbs begin to contract again... followed by another deluge that simply falls on top of the first, creating a messy soup.",
			"Again, you felt a heat in your stomach, and again, a stillness came... and again, the in and out motion of the warty, green mass resumed.",
			"A third and fourth time the orbs contracted and the goop spurted out wantonly, your stomach feeling incredibly hot and sensitive.  The orbs were noticeably sloshing less... but were still sloshing.",
			"The fifth eruption proved to be the last.  The still-stiff object slipped slowly out of the ring, causing it to disappear from view... and the ring itself shrunk in size to a size about twice its original diameter.",
			"On one side of the ring was an endless expanse of darkness... the side the orbs had been on.  On the other, there was also darkness, but also a visible trail of slime flowing outwards under the weight of its own gravity, looking quite like an egg's white spreading outward.",
			"Somehow, the sight brings a fierce heat to your cheeks, as if you're witnessing something truly embarrassing.  Somehow, the space you're in seems sullied by the presence of the white, viscous soup.",
			"The far-away laughter, fading into the distance, doesn't help matters.",
			"You glance one last time at the ring... it's not even round anymore.  You blink, and suddenly, you're in the enchanted forest again, the soft glow of bioluminescence illuminating the ground beside you.",
			"You feel hung-over... your head feels like it's going to split open... and it's not the only thing.",	
		]
	},
	{
		"key": "006-26",
		"scriptLines": [
			"Your butthole feels... open to the air, and disturbingly wet.  Your stomach feels hot... and full.  You get up on your hands and knees, and your stomach grumbles.",
			"Your face feels... wet.  You vaguely recall seeing a green thing quite like the one in your dream, and feeling it, wet and sticky, drawn across your cheek.",
			"And now that you think about it - there's no doubting what that green thing was... or, on further reflection, why it was wet, and why your stomach feels so full.",
			"You swallow as the significance of the dream dawns on you... and then you hear it - the inhuman laughter.",
			"\"Nyahaha, keep the goblin goo, human!  Next time, read the sign!\"",
		]
	},
	{
		"key": "006-27",
		"scriptLines": [
			"You stand, slowly, feeling it slosh around in your gut.  You feel... different. Aside from being full of goblin semen, that is.",
			"You turn back along the narrow trail, making a mental note to avoid \"keep out\" signs in the future."
		]
	},
	{
		"key": "006-28",
		"scriptLines": [
			"\"Ehe, ehehehe!  Nyahaha!\" she laughs, as you crumple to the ground, defeated.  By someone half your size.",
			"She stands over you, looking down with a grin.",			
			"\"So yer some kinda hero, huh?\" she says, sizing you up, and finding you wanting."
		]
	},
	{
		"key": "006-29",
		"scriptLines": [
			"At first, you feel shame solely because of that... but looking up at the goblin now towering over you despite her diminuitive stature, you immediately start to feel shame for any entirely different reason.",
			"The bulge in her loincloth is... obvious.  You swallow, expectantly.",
			"You're not sure what goblin sex is like, but you have a foreboding sense that you're about to find out.",
			"\"Are you a boy or a girl?\" they ask, although now you're not entirely sure about them either.",
			"\"I'm a boy!\" you say, defiantly, and she cackles.",
			"\"Nyaha!   Uhoh!  Sucks for you!  Selkie isn't in the mood for pinkskin meat!  Boy or girl, either way it's going up. The. Asshole!\"",
			"\"Up the... no way!\" you say, her words confirming your fears.",
			"\"What, you wanted to put it in my butt?  Perverted human.  Is that why you fought so weak and stuff?  Maybe I should let you stir up my butt, as a reward for making this little goblin feel big and strong like you!\"",
			"You nod, excited.",
			"\"Nyahah!  I don't think so, human!  You better get ready for some hot, throbbing gobbo dick in your tight little fudge tunnel!  Nyahaha!  I'm gonna make your butt pussy taste my green meat!\"",
			"She pushes you face-down, your chin resting in the dirt, and you meekly try to fend her off.",
			"\"What's the matter, human?  Getting overpowered by a little goblin girlie?  That's so embarrassing!  Wouldn't it be even more embarrassing if she fucked you right up your hole like a girl?\" she taunts, while sliding her surprisingly stiff penis between your cheeks.",
			"You expect her to start pushing it in, but then she climbs up on your back, riding you.",
			"\"Which do you want to taste it with first?  Your top hole or your bottom?\" she says, her hands on your shoulders.",
			"You think it over.  She dismounts you and gives you a swat on the rear, but is otherwise surprisingly patient."
		]
	},
	{
	"key": "006-30",
		"scriptLines": [
			"You've already tasted the flavor of a goblin, and you're in no hurry to repeat that experience, but you're too exhausted to escape.  Looking at the bulge behind her loincloth, your sphincter tightens, reflexively, as if that will do anything.",
			"She seems to sense your trepidation.  \"Selkie's caught herself a fun little pinkskin!\" she says.",
			"You groan.  This isn't your idea of fun.",
			"\"Well, which one will it be?  Your top hole or your bottom?\" she asks."
		]
	},
	{
	"key": "006-MOUTH-01",
		"scriptLines": [
			"She nods, knowingly, and moves her loincloth out of the way to reveal a warty, inhuman looking schlong.",
			"\"I always forget which end of a human is up.  Oh well!  Say 'ahhhh', fruit boy!\"",
			"You have no idea what she's talking about, until you realize that she's gotten behind you.  All at once, your vision goes white."
		]
	},
	{
	"key": "006-MOUTH-02",
		"scriptLines": [
			"\"Pow! Right up the butt!  Nyaha!\" she says, and, indeed, right up the butt it went.  The knobby warts immediately irritate your hole, and the sudden intrusion has you tearing up mushrooms.",
			"She begins to thrust in and out and you groan, nearly collapsing into the dirt.",
			"With your face down and your ass up in the air, she begins to pummel your upturned butt. You bite the dirt to cope, even as she wrecks your ass.",
			"It isn't long before she shifts gears.  She pulls it out of your confused butthole, and rounds your body.  You lay, passively, your hole tensing and untensing in distress.",
			"\"Ah!  I got carried away and put it in the wrong hole.  You wanted it up top, right!\" she says, helping you onto your hands.",
			"When you look at what went up your ass, your eyes widen.  It's thick, and covered in warts, and stiff as a bat.",
			"\"Oh!  It's been up your butt!  It's gonna taste real bad.  Gobbo boys hate it when I do this to them - but I love it.  Open wide!\""
		]
	},
	{
	"key": "006-MOUTH-03",
		"scriptLines": [
			"She pinches your nose, and sure enough, you open wide - and as quickly as she blitzed your asshole, your face hole gets stuffed full.  Immediately, you know what goblin testicles feel like.",
			"You get quite familiar with it, in fact, as they slap against your face with each thrust, the foul tasting tube tickling your tonsils with each of her hipthrusts.",
			"\"How do you like those gobbo nuts slapping your face, human?  Ready to drink my hot, sticky gobbo butter?\"",
			"Because of your new-found familiar with \"gobbo nuts\", you feel them sloshing about and gradually tensing.  You aren't \"ready\" to drink anything, but as you look up at her, defiantly, you know you don't have much of a choice.",
			"Your eyes roll into the back of your head, nausea getting the better of you... when suddenly, her gobbo butter makes itself known."			
		]
	},
	{
	"key": "006-MOUTH-04",
		"scriptLines": [
			"It's thick... like cheese, almost.  It gunks up your throat and makes it difficult to breathe, much less swallow.  It's definitely not made for consumption - at least not by humans, but by the shark-toothed grin on her face you can tell she's well aware of that.",
			"\"Nyaha, don't die, human!  Choking on gobbo nut butter to death would be the most humiliating game over ever!  Just swallow it all down like a good little toilet human!\"",
			"You want nothing more than to spit or vomit it out - it's like a jelly that had to be scraped off of the insides of her testicles, because it sticks to everything and just won't drain downwards.  There's a big wad of it clogging right in your throat.",
			"\"Here, let me help ya, nyaha!\" she says, although any help from her is help you know you can do without.  She tugs on your hair to pull your head back, your mouth open as you struggle to spit out her nasty gunkwad, and with one swift motion, she slips the butt of her spear into your mouth and, painfully, right down your throat.",
			"The sound you make... is probably more appropriate for a goblin than a human.  Her effort isn't in vain, however, and the wad of sticky goblin semen dislodges and begins to slide, viscously, down your throat, which by itself would make you gag if you weren't also deep-throating her non-fleshy pole.",
			"Her eyes are wild as she grips the spear firmly in place, her closed fist around the shaft also serving to plug your mouth.",
			"\"Nyaha!  Now you've got two in holes and no out holes!  Guess you're gonna explode, human!\" she says, mischeviously, as your face turns red and you want desperately to spew out her disgusting semen slime.",
			"You think your wish will be granted when she finally pulls the spear free of your throat, which comes as a great relief, but she covers your mouth with her hand.",
			"\"Ohho!  Gobbo boys never swallow!  They know to start biting when my gobbo clackers start twitchin'!  Silly human - that's not food.\"",
			"You know it's not food - it certainly doesn't taste like it.  You gulp down more of it, tears of either shame or nausea streaming down your face, as you eye her bitterly.",
			"\"Gobbo gunk, gobbo gunk~ came out my dick and it really stunk~ spew it up now and you'll really flunk~ your pride and my gunk you've already drunk~ that's what you get when you suck my trunk~ all I build up when I made you my punk~ fucked up your ass then you swallowed my junk~ hope you like the taste of that gobbo gunk!\"",
			"While she sings her lewd song, your stomach ties itself into knots, not knowing how to process the snot-like gift it's just received.",
			"When, finally, the goblin spew has ended, she pulls you off of it, leaving you to cough and spew it back onto the ground.",
			"\"Well, human, I think you've got the point.  Better go back where you came before I decide t' breed ya!\"",
			"She leaves you to finish digesting her gross liquid dinner, and you hear her cackling fade into the distance."
		]
	},	
	{
	"key": "006-ASS-01",
		"scriptLines": [
			"\"A human boy who likes taking gobbo cocks up the butt!  It's my lucky day.  But we'll get to that, nyaha!  I know where your taste buds are really at!\"",
			"She grabs a hold of your chin, and you taste her schlong immediately.  The hard bumps on it slide past your lips uncomfortably.",
			"She puts her other hand around the back of your head and pulls you all the way forward, so that it slides down and tickles your uvula.  You gag, and the phlegm coats it slick.",
			"Her goblin cock tastes strange and feels strange too - it's firmer and stiffer than a human cock, for sure.",
			"\"How does that gobbo cock taste, human!  Nyahaha, you're perfect for this - gobbo boys have such sharp teeth!\" she says, showing off her own set of viscious chompers in a wide smile as you blow the ever-loving shit out of her without a choice otherwise.",
			"You never expected such a small creature would be able to defeat you - much less force you down on your hands and knees to service her green goblinoid dick.  On your list of humiliations you thought you might endure at the hands of a foe, shining a goblin's pole with your mouth was not one of them, at all.",
			"As she pistons it in and out of your lips, you get a keen understanding of every knobby wart, your lips rubbing against them roughly and unevenly.",
			"\"Go ahead, try and bite it!  Let's see what human teeth can do to a mean goblin girl's dick!\"",
			"You try to bite it, but to no avail - the skin is too thick.  She reacts by giggling, and then slipping it out of your face, where gravity takes hold of it and it bends downwards, covered in spit.",
			"\"Now it's nice and slick - and it's going right up your butt!  Nyahaha!\"",
			"She leapfrogs over you, then spins around, thwapping it against your butt as she turns.  She grabs a cheek with each nubby thumb, spreads your hole, and presses her baton up against your starfish."		
		]
	},
	{
	"key": "006-ASS-02",
		"scriptLines": [
			"Lubricated by your phlegm, she manages to go from un-penetrated to, gut stirring, rectum-basting, hip tapping in less than a second - causing your eyes to roll to the back of your head and your face to lose all color.  You can feel the painful stretching between your ears, and as she starts to thrust immediately after, you start to whine pathetically.",
			"\"Nyahah!  Pretty tight!\" she says, ignoring your voiceless gasps.  \"Surprised ya, didn't I?!  Sorry human, gobbo boys like rough sex - though they like it less when they're getting it!\"",
			"The sudden penetration makes your insides cramp, and your voice leaves you.",
			"\"What's the matter?  Your hole is cramping up all funny!  Come on, this is what it's for!\" she says, proving her point about the nature of your asshole with her warty goblin dick.",
			"You try to angle your hips so that she can't thrust as rapidly or deeply, but she follows you all the same.",
			"\"Ya won't shit right for weeks! How do you like getting buttered up in the butthole by my meatsicle?  How's your pride as a man - as a human?!\"",
			"Your own cock flops between your legs, stiff and tense.  She reaches around to grab it, and slaps it against your thigh.",
			"\"Some hero you turned out to be! Look at how hard you are!  You're harder dan me!  Are you going to tell everyone back in human town about how you got a comfy gobbo dick right up your butt?  How ya got seduced and fudgepacked by a goblinoid half your size?  How ya got brown-eyed by a girl who's half brownie on her mom's side, and all hard-dicked on your insides?  Nyaha!\"",
			"You endure her vocal degradation, but that only makes you focus on her anal degradation. It bores in and out of your smooth hole with little room for interpretation - this is anal sex, with a capital A.",
			"All at once, you feel the whole of it flush into you, and then, strangely, you feel a heavy weight on your cheeks, and you turn your head to see that, impressively, she's clambered onto your back.",
			"She reaches forward and pulls your hair as she pounds you from behind.",
			"\"How is it?  Huh, huh?! How do you like that gobbo meat up your shithole, human?!  You like being blasted by a goblin girl, don'cha?  Go on, say it, say it!\" she says, thrusting it up into you, pressing her hips firmly against you and stirring it around inside your rectum.",
			"She manages to slam her entire green dick up inside of you with each overbalanced thrust while riding up on top of you, a feat that you'd find impressively acrobatic if it wasn't knocking the wind out of you with each anally-receptive go.",
		]
	},
	{
	"key": "006-ASS-03",
		"scriptLines": [
			"She nibbles on your ear, barely able to reach, and you bite your lip. Your eye twitches.  Your prostate is receiving far too much stimulation - by the time you even recognize the sensation, it's too late - you shoot a rope of misguided cum all over the tiny mushrooms between your knees.",
			"\"Nyaha! You lied to me, pinkskin!  You said you were a boy, but you cum like a girl!\" she cries, still riding you high, thrusting in and out of your tortured butthole, having apparently noticed your catamite-like anal ejaculation.  Of course, cumming while penetrated might be a classic girl move, but being ejaculated inside of...",
			"She quickly buttons up that loophole by plugging it with cum - that is, she begins to shoot thick, creamy ejaculate into your quickly-waterlogged bowels.  You learn the hard way that goblin cum has a spicy aftertaste, causing intense heat everywhere it touches in your rectum as it spurts out and splashes down.",
			"As she cums all over your insides, you feel an intense shame - a creature no taller than your waist has overpowered, penetrated, and inseminated you, right up the butt.  Even worse - you came from the comfort of it.",
			"\"Hope your stomach enjoys all that gobbo cocksnot!\" she says, although between the volume and the spicy flavor, your stomach is anything but enjoying her spunk enema.",
			"You can feel your dignity getting a facial.  You hope there's at least part of your insides that aren't tainted by goblinoid cum, but you're pretty sure if you just wiggle your hips a bit, that'll no longer be the case.",
			"\"Do you like getting all that nut up the butt, nyaha?!\" she asks, and with that, she pulls the whole of her dick out, laying flat against your back, even as you stay on your hands and knees, her fingers tangled in your hair.",
			"You sit there for a bit, the goblin riding exhausted, piggy-back, while her cum begins to appear within your puckered hole - a ring of white giving evidence of her visceral creampie.",
			"You assume the ordeal is over... until you realize that the hard, fleshy cylinder pressed against your back is, indeed, still hard and stiff.",
			"She's still erect.  Despite having just filled you considerably, her green sperm-sacks still seem full and plump, and, in fact, a little sloshy. Your stomach sinks.  You worry the worst - that she's going to penetrate and inseminate you again.",
			"\"My gobbo goonies are still full, nyaha!\" she whispers into your ear.  You realize that if you don't shake her off now, you're going to be humiliatingly assfucked again, and she's going to serve it up hot, again.",
			"Unfortunately, the weight of her cum in your stomach and its heat has numbed your body - you'll have to fight off the effects to fight her off."
		]
	},
	{
	"key": "006-33",
		"scriptLines": [
			"You can't shake yourself out of the haze, and she's quick to capitalize.  She jumps off of your back and grabs hold of your waist, so that her thick green machine swings through the air, aimed at your donut hole.",
			"Your lips purse, as all at once the whole of her warty goblin dick makes it inside of you again.",
			"You collapse to the ground, and her hips follow you, until your own penis is stuck in its own mud, and her cock is pulsing against your anal walls, her chest against your lower back.",
			"\"More cum comin' your way, hero-boy!\" she says, and she isn't lying - another rush of cum shoots up into you, and you feel the heat again.  Her volleys don't last as long as the first time, but they're still surprisingly large.",
			"She pulls out, and again sits her big rear on your back, apparently recuperating.  Though it's no longer flat against your back, you can feel the ominous presence of her erection - still full, even after two semen injections piped into your stomach.",
			"\"You're full of gobbo sperm, Mr. Adventurer!  Nyaha!  You must feel nasty!\" she says, as you lay, face down in the dirt, feeling nasty.  Being sodomized by a tiny humanoid with an oversized dick wasn't in your game plan, and your hole feels absolutely violated and disgusting, goblin cum bubbling out of it like a cauldron.",
			"You also get the sense that something about you is changing... perhaps permanently.  You feel... corrupted.",
			"Receiving the same goblin's cum rectally twice is bad enough.  Knowing that she's still full-mast, you try to work up the energy to throw her off."
		]
	},
	{
	"key": "006-34",
		"scriptLines": [
			"Unable to resist the effects of her love-making, you again unintentionally submit - and up it goes.",
			"She kicks your legs apart so that you take it bow-legged, then rams her stiff pipe up your shithole, exactly as dignified as that sounds.",
			"\"Ooooh, ooooh...\" she coos, apparently on a hair trigger. You hear her grumble a moan, and you know she's already close to firing off another volley.",
			"In no time at all, you feel the gurgling in your gut that means she's added another copious load, this one just as unwelcome as the others.",
			"Your stomach distends, to the point that it aches as you press it against the ground.  It's clear now that you're being absolutely stuffed full of her semen.",
			"\"Say thank ya for all dat sweet gobbo gunk up ya shitpipe! More than ya could ever need! And I'm almost out!\"",
			"You're too overstimulated to say anything, much less thank you.  Again, you feel you're being changed, somehow.",
			"She lazily sits down on you, facing towards your feet, and drums on your upturned, drooling rear.  Her goblin goonies squish on your back, and you feel her goblin screwdriver dribbling on it as well.",
			"Three times now you've tasted the goblin's cum with your lower mouth. Given that she's \"almost\" out, you know you need to try, at least once more, to break free of the spell."
		]
	},
	{
	"key": "006-35",
		"scriptLines": [
			"It's no use - you can't fight her off.  You hope she's not lying about this being the last of her goblin butter, or you may very well explode.",
			"She rolls you onto your side - and penetrates you without pretense.  Almost immediately, you spew again onto the dirt, but she pays that no mind.",
			"Her tribal pounding is basically emasculating you in every direction, and it only gets worse when you realize that she's going to empty her entire nutbladder into your newly-annointed baby bag.",
			"After a sequence of blows to your pride and your prostate, she spits liquid into liquid, and you groan, your stomach bloating to an almost pregnant size.",
			"In addition to feeling so cum-filled that you may start to cough it up, you also feel even more changed than before... your body is soaked with sweat.",
			"\"That's all of it!  Now you can get preggers!\" she says, and you barely have the energy to speak.",
			"\"I... I'm a boy...\" you say, though you're having a hard time telling that.",
			"\"Oh, silly human.  You didn't know?  Goblins don't have wombs or anything - so if you think you're not gonna be a mom just because I'm blowing bubbles up your boy butt, well, you better start picking out maternity clothes!  Nyaha!\"",
			"You look at her, delirious and confused.  She shakes her finally wilting, wet dick, dribbling the last of her love juice into the dirt.",
			"\"Goblin girls like me have eggs, nyaha!  And they're all up inside you now! If they get fertilized, you're going to have a big, pregnant belly.  And then... a goblin butt baby!\"",
			"Your heart starts beating rapidly. \"But... if I... don't... with a goblin...\" you say, hopefully.",
			"\"Nyahaha! Nope! I make all kinds of eggs! Who knows what you'll end up being a mommy to!\" she says, cackling again, before fastening her loincloth back into place.",
			"She retrieves the rest of her things, then gives you a view of her shapely rear as she departs.",
			"\"Good luck, pinkskin!  Next time, keep OUT!  Nyaha!\""		
		]
	},
	{
	"key": "006-36",
		"scriptLines": [
			"You lay, full to bursting of semen, in the dirt for a while, in the gloomy bioluminescence of the forest, the goblin's cackling disappearing into the darkness."
		]
	},
	{
	"key": "006-37",
		"scriptLines": [
			"You manage to get your second wind and shake her off - she falls to the ground, growling, her rock-hard erection still clearly ready for another go.",
			"Though she just blasted a wad of cum in your pooter, you still have enough use of your arms and legs to pull up your pants and make a break for it - and with her short legs, she can't catch up."
		]
	},
	{
		"key": "FORCED_CAMP",
		"scriptLines": [
			"You're too exhausted to continue, so instead you camp to rest.", "You nibble on your food reserves and spend an extra night without traveling.", "You restore 10 health and consume 4 food."
		]
	},
	{
		"key": "STARVATION",
		"scriptLines": [
			"Your hunger has gotten the better of you.  You're running out of strength.",
			"As you wander, your vision starts to narrow, and you start to wobble on your legs... until you collapse to your knees, falling face-first into the dirt, and blackness takes you.",
			"...",
			"...",
			"..",
			"..",
			".",
			"You awake, face down in the dirt.",
			"Your consciousness floats in and out... and you have a sinking feeling that something is... wrong.",
			"You don't remember pulling your pants down.  Your mind is too fuzzy to know for certain... but you're pretty sure.",
			"Your face is down, but your ass is in the air.",
			"And... you can't quite place it... but something feels... off.",
			"Your... hole... is sore.",
			"You're surrounded by the footprints of some wild animal... and the stench of both wild animal and sex is in the air."
			
		]
	},
	{
		"key": "STARVATION-REVEAL",
		"scriptLines": [
			"A frothy white liquid is cascading down your balls and thighs, pooling onto the ground.",
			"Feeling it run down your legs, you suspect that it's the leavings of a satisfied animal, your heart sinking.		",
			"The source of this waterfall of animal semen is... well, there's no polite way to say this: it's your poophole.  You apparently entertained some very confused beast while you were unconscious and... it must have thought that you were a female.  When it couldn't find a vagina to sow its seed, well...",
			"Life... finds a way.",
			"To put it mildly - your rectum has been ransacked.  The lust of a beast has left your bowels awkwardly sore, and bloated in a way that makes it more comfortable to push out the burbling beast cum than to let it stew.  Judging by how gaped and sore you are, the beast must have mated with you at length, or possibly multiple times - or possibly you welcomed a whole pack of feral animals into your not-so-exit-only-now boyhole.",
			"You may never know exactly what happened after you lost consciousness, but all evidence points to a romantic rear rendezvous randy, rutting rectum-rummaging rascal.  ",
			"In other words, you've been anally inseminated by a wild animal.  Oof."
		]
	},
	{
		"key": "STARVATION-VIRGIN",
		"scriptLines": [		
			"Congratulations, you lost your butt virginity. Err, sorry it had to be this way. I'm sure it was a handsome animal.  A... very romantic animal.",
			"Look, there's no sugar-coating this.  Your first time, not only did you take it up the ass, but it was with a dumb animal who couldn't tell the difference."
		]
	},
	{
		"key": "STARVATION-CONTINUE",
		"scriptLines": [
			"While unconscious, you got butt-bombed by a wild animal. -5 dignity.  Gained beastmaster trait."	
		]
	}
]
}