{"script": [
	
	{
		"key": "BRIGAND-INTRO",
		"scriptLines": [
			{
			"mutations": [{"profileSaveType":"KNOWLEDGE", "value":{"class": "java.lang.String", "value": "Brigand"}}],
			"text": "You're wandering in the forest - home of monsters and shadows alike.  The creatures of the woods can sometimes be hostile, so you're on your very best guard."}, 
			{"text": "The sound of a twig snapping jostles you into high alert, but you can't locate the source of the sound."},
			{"text": "You keep your ears pricked up, wary of unseen danger."}
		]
	},
		{
		"key": "BRIGAND-SPOT",
		"scriptLines": [
			{
			"animatedForeground": "BRIGAND",
			"text": "You spot her before she reveals herself - judging by her appearance, you would guess that she's a lone brigand - you scan the area, but you don't detect the presence of any more of her merry band."}, 
			{"text": "You're fortunate - she didn't expect you to spot her, and she's caught unawares.  What will you do?"}
		]
	},
	{
		"key": "BRIGAND-HAIL",
		"scriptLines": [
			{"text": "You hail her. \"Come out. I see you hiding there,\" you say, and she mutters something under her breath before stepping out into view."},
			{"text": "She clicks her teeth. \"Tch. Good eye,\" she says, looking you up and down, \"...although can't say the same for myself. You're a man, aren't ya?\" she asks."},
			{"text": "\"Y-yes! Why do you ask?\""},
			{"text": "She sighs. I suppose you wouldn't be interested in the kinds of wares I'm peddling, I mean\" she says, and she gestures to her pantleg - where she's clearly smuggling some kind of weapon."}
		]
	},
	{
		"key": "BRIGAND-ACCEPT",
		"scriptLines": [
			{"text": "You accept her invitation with a nod."},
			{"text": "\"Ah, you're a boy, but you're into butt stuff? I can get behind that,\" she says, the word \"literally\" merely implied, as she approaches you. \"I'll fuck ya in the dirtbox in the dirt, like a good forest wench,\" she declares, as she pushes you to the ground."},
			{"text": "You land on the ground as she begins to uncinch her plate, then she offers you her boots, and insists that you pull them off. That being done, she bends down to pull off her trousers, revealing a lack of undergarments and a big fat schlong, then goes to work on your clothing, pulling your underwear off while you wriggle in the dirt."},
			{"text": "\"I like fucking in the ass while face to face, so I can see all the slutty faces yer making,\" she explains, \"although, admittedly, there are usually fewer little pricks that might squirt on me in that configuration\", she says, flicking your quickly hardening penis."},
			{"text": "The casual contact makes you start to shiver... although you're primarily fixated on her rather busty figure. You wonder how she manages to fight with a pair that large... but as your eyes track downwards, there's another pretty large pair that holds your attention."},
			{"text": "She spits on her fingers and rubs the moisture on your hole none too delicately. She does that again, and then a third time, and then positions the fat head of her cock right against your hole, and your heart stops beating. \"Is this for me? Don't mind if I do...\" she says, and you feel the insistent pressure starting to build."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"foreground": "BRIGAND_MISSIONARY",
			"text": "She doesn't let up - with one hand on your knee, the other on her dick as she guides it in.  Suddenly, you feel it pop inside, and your hands pulls weeds out by the roots.  She puts her hand on your other knee, a wide grin on her face, and your hole stretches too late to accommodate her."},
			{"text": "She spreads your knees subtly as she pushes her hips forward - so that the opening of your legs corresponds with her prying open your innards. You hold your breath as she continues to push into you - there's no point in telling her to go easy on you."},
			{"text": "The thickness of your anal membrane is stretched thin by her impressive girth - there is no question she's inside of you in a way that will render future anal activities more difficult. You can tell that the stretching is beyond normal, and then a bit beyond that - she's got a fat cock, and your hole is getting worked out by it."},
			{"text": "\"Whew, that's tight... tighter than a pussy for sure. It's nice and hot and dry in here... it hurts good, doesn't it?\" she asserts, and she's right about at least one of those - the friction of her thick shaft sliding in and out of your barely-lubricated ring is making your toes curl anxiously. It's not too bad now, but you're obviously building up some soreness for later."},
			{"text": "She doesn't seem to pay any mind - she's slipping her dick in and out of you at a steady, even pace, biting her lip and bottoming out a little deeper each stroke, poking and prodding at your insides with her exploratory cockhead. It's stuck fast, inside, snugly, so there's no chance of it slipping out accidentally and interrupting your impromptu anal sex."},
			{"text": "Your sphincter cramps around her, begging to relax and return to its previous, non-cock-accommodating shape, but there's no way it can squeeze her down to a more comfortable shape and size with her being as hard and firm as she is, so your smooth muscle can do nothing but massage her."},
			{"text": "She grasps firmly around your waist, and begins to drive it into you while holding your body in place so that she can bottom out with each explosive thrust. With your feet on the ground, the result is that each time, she has to spread your cheeks, but she's successful, and you catch a full dick with every thrust."},
			{"text": "Your \"lovemaking\" there on the ground isn't exactly the most romanticized affair - getting wrongholed in the dirt by some rogue you just met rarely is. Then again, she does make a lot of eye contact... and her hands roam over your body."},
			{"text": "\"Put yer legs around me, slut, so I know how much ya want it,\" she demands, and you obey, wrapping your legs around her waist as she drives it up into you."},
			{"text": "With your legs out of the way, she really begins to lay it into you, her fat sack slapping against your upturned ass with rather obvious intention. The burning has gotten stronger, but not strong enough that you tell her to slow down."},
			{"text": "\"I've got such a full load saved up... yer gonna look pregnant,\" she says, confirming that she's getting close to ejaculating. You don't know why, but her globes are obviously incredibly full - likely that was what spurred her to try and sneak up on you to begin with. You can't help but squeeze your anus around her, knowing that it's definitely milking all of the cream she's got saved up in those big balls of hers."},
			{"text": "You can see it written plainly on her face. Her goo-filled love buckets don't know that her fat dick isn't in a pussy, and she intends to use that to the full extent that your rectum will allow. She's biting her lip, sucking air in through her teeth, and doing all but saying that her cream cannon is ready to give your intestines a white-washing."},
			{"text": "The precum leaking into your bowels is already oddly thick, you can't imagine what an actual spoonful of her seed would look like. If you don't act soon, you won't have to wait long to know that it feels like, though. Anally.  If you're hoping she's going to pull out before the big finish, you can look forward to a healthy creampie."},
			{"text": "Your cock is slapping against your soon-to-look-pregnant stomach with an unfortunate need to seed - while it won't be as thick or match hers in sheer volume, there is no doubt that you'll soon be spurting on your own stomach as long as she keeps up the in-and-out. You don't want to be on the receiving end of a mysterious-bandit full-force semen enema, but you can't bring yourself to tell her to stop."},
			{"text": "If you COULD get the dick up the ass you need to punch your prostate and make you cream and ALSO avoid getting your stomach blasted full of a stranger's strange semen, you'd opt for that. But that's not an option."},
			{"text": "She's definitely ready to blow. Her sack is all but pulsing as she slaps it against your cheeks, ready to fire off her gooey load where the sun don't shine. Speak now, or temporarily hold her seed."}
		]
	},
	{
		"key": "BRIGAND-CATCH",
		"scriptLines": [
			{"text": "You say nothing. You feel yourself nearing orgasm, but you doubt she's going to be too far behind."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1}}],
			"text": "With her cock rummaging over your prostate, you soon squirt, your stomach receiving the semen gracefully - and then, it receives a lot more semen, somewhat less gracefully."},
			{
			"sound": "CUM",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "creampies":1}}],
			"text": "Her eyes roll into the back of her head as she groans, and a torrent of thick cum floods your bowels, too late for you to call takebacks. Her hips twitch as she fires rope after rope inside, and you groan at the sheer volume of it."}
			{
			"sound": "CUM_BUBBLING",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "creampies":1}}],
			"text": "Letting her cum inside proves to be a mistake. She dumps weeks' worth inside until you feel bloated and gross."},
			{"text": "You unwrap your legs and hold them high in the air, as if inviting her to pull out, but she doesn't take you up on the offer, slamming her hips down against your ass and firing rope after rope into your beleagured bowels. You doubt even a drop of her mucous is going to end up coming out anywhere but inside your pipes."}
			{"text": "The pressure causes a single, thick, goopy dollop of cum to squeeze out and run down your cheek, the rest of her semen still being pumped inside as it trails downwards, like a sperm-filled tear at what your butthole has been made to become. You caught the whole thing, and you don't even know her name."},
			{"text": "You feel it bubbling in your gut, which is enough to tell you how much there is, without also seeing your stomach distend. It's a painful amount of dick porridge to drink anally."},
			{"text": "After her thorough insemination, she pulls free - your stretched-thin anal membrane clinging to her wet, smooth shaft as she does, until finally, it slips free, head and all."},
			{"text": "Her creampie is remarkably subtle - despite her fat cock stretching it wide just moments before, your hole tightens up into a fairly small gape, and her sticky cum begins to ooze out slowly, a proof of conquest you're hoping no prying eyes will see."},
			{"text": "Despite the rather humble display, which isn't actually that humble, as it's obvious there's a lot of cum stuffed up inside, the amount in your rectum alone is enough to make you feel like the village whore, and it's not just your rectum that's full. You can feel it oozing out slowly - there are definitely jellified chunks of the stuff in there."},
			{"text": "She makes you clean it off, sucking on her half-flaccid penis until she's satisfied, then bends over to give you a peck on the cheek and goes on her merry way. You decide not to hold onto all of her cum for safe keeping, so you dump it all out in the bushes, doubting that you cleaned out all of it."},
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "You are flooded with cum and Experience!"}
		]
	},
	{
		"key": "BRIGAND-REQUEST",
		"scriptLines": [
			{"text": "You ask for her to pull out and cum on your face - not the way you want it to go down, but you can't think of any other way to convince her not to gum in your guts."},
			{
			"animatedForeground": "BRIGAND",
			"text": "She hears you, then slows down... and, thankfully, she tugs it out, schlorping all the way, until it pops up, casting a shadow onto yours, erect and pulsing and ready to shoot. That is, both of them are. You try to contract your recently-vacated hole enough to trigger it, somehow, but to no avail. You whine - you're likely not going to get to finish."},
			{"text": "She considers something, fixating on your face, clearly deliberating something, then climbs over you, bringing her fresh-out-the-ass cock bobbing in front of your nose."}
		]
	},
	{
		"key": "BRIGAND-FACIAL",
		"scriptLines": [
			{"text": "\"Fine... smile for me and think creamy thoughts,\" she says, running her hand down her long shaft, causing a dollop of precum to slowly inch its way downwards towards your neck, where it lands and begins to pool, a steady stream of rivulets."},
			{"text": "Her dick smells exactly as you expect it to - your hole twitches as you stare at it, wanting at least half of it back up in it where its uncomfortable stretching would give you just the last bit it needs to convulse and spasm to completion. But it isn't going to get that - instead, you're just going to get your face painted."},
			{"text": "\"Kiss it,\" she says, and you kiss her dick, feeling ridiculous... until she brings herself up onto her knees, and dangles her balls in front of your lips. \"Now kiss them\", she says, and you obey, hesitantly."},
			{"text": "You peck her swollen sack, and, satisfied with that, she tells you to open up, and reluctantly, you let her balls into your mouth."},
			{"text": "She dunks her sack into your mouth until she's satisfied that the whole thing is stuffed inside, then isntructs you to lick around them. Your tongue can somehow taste the cum bubbling inside, and it does not taste appealing."},
			{"text": "She pulls the whole affair out of your mouth and begins to stroke... and you prepare yourself for the inevitable. It won't be long now."},
			{"text": "She strokes it until, finally, she stops, and she grips tightly, and her whole cock jerks. Then, the first rope of cum shoots out - and it is a whopper."},
			{"text": "As if in slow motion, you see the mass descend - a thick, heavy looking blob that eclipses the sun that's bleeding through the canopy, looking like a widowmaker falling on a hapless forest-goer.  In that tiny window of time, you brace yourself for the impact, knowing it's probably going to sting, and shut your eyes reflexively."},
			{"text": "Thankfully, you manage to close both eyes before she blinds you. A heavy thud of thick slime lands on and thoroughly coats your eyelashes, probably gluing your left eye shut in the process. Still, it's better than her sperm trying to impregnate your eyeball - and there must be a ton of it, because it's thick like porridge."},
			{"text": "The smell of her spunk hits you like a haymaker - there's definitely been a fermentation process happening in that broiling goosack of hers. It doesn't help that she shot one hot stream of it right up your nose, where it will likely now cool on your brain."},
			{"text": "Each fat ropey blast of her ejaculate lands disgracefully on your face - her aim is perfect, even if her mercy isn't. Each rope contributes to the white, sticky mess of a mask that now resides on your face, so gummy and sticky that you're pretty sure you could peel it all off at once when it dries. That is, if it ever dries."},
			{"text": "It's gloopy, to say the least - big chunks of balled up sperm and penis juice slowly slide down off the sides towards your ears as her lake of cream flows outwards, like spooge glaciers."},
			{"text": "By the time her ejaculations are clearer and thinner, spurts of more reasonable size, your entire face is coated in white-and-clear slime, bubbling around your nostrils, and making it impossible to see. You're completely at her mercy, and she just gave you a facial that could double as a creampie for comedic effect."},
			{"text": "Your cock is still hard, twitching, and eager to cum - and will remain that way, now that her sexual appetite is a cooling mess coating your face. You feel like you've been basted."},
			{"text": "You hear her blow you a kiss, and again your unsatisfied cock twitches, but then, she stands up off of you, and you hear her stuffing her deflating trouser snake back in her pants."},
			{"text": "\"A gift, from me to you,\" she says, tauntingly, \"I'd leave you with a rag to wipe it off, but I've not got one, and I think it looks good on you.\""},
			{"text": "Chuckling to herself, you hear her boots crunch on the leaves as she saunters off, leaving you face-up on your back, naked, freshly fucked, still hard and stiff, your face covered in the white and clear ooze that is the stuff of lewd finishers."},
			{"text": "Eventually, it dries enough that you can open your eyes, with some help from your fingers to pry open the glued-shut eyelashes, and you wipe what cum you can off onto your sleeves, feeling gross. With the brigand long gone, you make your way through the forest, this time unmolested, but with dried cum coating your blasted face."},
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 2}}],
			"text": "Your face is covered with cum... and Experience!"}
		]
	},
	{
		"key": "BRIGAND-BADTASTE",
		"scriptLines": [
			{
			"foreground": "BRIGAND_ORAL",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralSex":1, "oralCreampies":1}}],
			"text": "All at once, an unpleasant taste fills your mouth, and a few inches of girl dick fills your throat.  There isn't much build up - she thrusts once, twice, three times, pinning your head against the ground, and then you feel a warm, sticky spray down your throat, and before you know it, you're already swallowing her cum."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralCreampies":1}}],
			"text": "She coats your throat immediately, and the surprise causes you to spit up a lot of it around her cock, your cheeks filling to bursting and your eyes open wide in shock.  Your lips and mouth were forced wide open by her sudden thrust, and you're still stunned, even as she empties her balls down your gullet."},	
			{"text": "When she's finished, she pulls out, and her cum erupts out of your mouth and all over your body. You spit it out as best you can, but she doesn't seem to care - in fact, she saunters off without another word."},
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 2}}],
			"text": "Your stomach is full of cum... and Experience!"}
		]
	},
	{
		"key": "BRIGAND-DECLINE",
		"scriptLines": [
			{"text": "You decline her invitation, waving her away. \"Get out of here,\" you demand, and her eyes narrow."}
		]
	},
	{
		"key": "BRIGAND-CONVINCE",
		"scriptLines": [
			{"text": "\"Fine. Be like that,\" she says, throwing her cloak over her shoulder as she turns to leave. You watch her disappear into the forest - a battle averted."}
		]
	},	
	{
		"key": "BRIGAND-FAIL",
		"scriptLines": [
			{"text": "Her lip curls into a snarl, and she draws her weapon. \"Well, who asked you, anyway?!\" she cries, and you prepare yourself for her attack."}
		]
	},	
	{
		"key": "BRIGAND-STAB",
		"scriptLines": [
			{
			"mutations": [{"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": -5}}],
			"text": "You feel a sharp pain in your back - you failed to spot the hidden danger, and it made itself known violently.  You spin to face the source of the pain - a woman, rough and worn, holding a red-tipped blade.  You adopt a fighting stance."}
		]
	},
	{
		"key": "BRIGAND-BACKSTAB",
		"scriptLines": [
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": -5}}],
			"text": "Your lack of awareness costs you.  Your pants drop - something must have pulled them down!  Your unseen foe works quickly - and, unfortunately for you, their intentions are anything but benign."},
			{"text": "Your breath is caught in your throat as you feel something fat worm its way inside of you, taking the path of great resistance - you've been penetrated, anally.  What is no doubt an erect, spit-slick phallus is poking into your guts, putting a crushing pressure on your insides, and you hear a female, if throaty, voice speak."},
			{"text": "\"Phew.  It's my lucky day - that's some tight ass-pussy. You really need to pay more attention, boyo.  Just a warning for the future\", she says, gripping onto your shoulders, and though you can't see her face, you know she's smug about it."},
			{"text": "\"Now if you'll excuse me, I have some idiot-hero ass to blast. Hooah!\""}
		]
	},	
	{
		"key": "BRIGAND-VICTORY",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You defeated the brigand!"}
		]
	},
	{
		"key": "BRIGAND-DEFEAT",
		"scriptLines": [
			{
			"animatedForeground": "BRIGAND",
			"text": "Your weapon falls to the ground as the brigand bats it away with her targe. \"Well, well. We coulda done this the easy way. But now we're gonna do it... hard,\" she says, grinning, and the bulge in her pants is indicative of exactly what she means."},
			{"text": "\"Mmm... look at those pouty lips. Almost as full as my bloated nutsack. Y'know, it can get awfully lonely, living alone in the woods. But I never touch myself. Y'now why?\" she asks, raising her eyebrow suggestively."},
			{"text": "You remain silent, looking down at the tremendous bulge in her pants - which seem to be getting even tighter."},
			{"text": "\"Because when my girls get so stuffed full of goo that it gets thick like jam, letting it out feels like heaven. Tastes like hell, though. Not too many wenches in the forest willing to chew on a load, if y'know what I mean,\" she says, as if that was somehow a euphemism."},
			{"text": "You don't doubt that she's got a full set - you can make them out even through her trousers."},
			{"text": "\"As soon as I saw you, I was hoping I could get a quick, sloppy blowjob before sending you on your way with a gut full of boiling brew. Know what that means, don'tcha? You're gonna kiss my fat sack while my screamin' eye bastes your tonsils. But I'm getting ahead of myself... open wide!\""},
			{"text": "You don't obey, and she presses the tip into your lips, filling your head with her scent as she spreads her precum over your lips and cheeks trying to gain purchase. She doesn't seem to mind, until, finally, she pinches your nose shut, holds your head in place, and waits for you to part your lips - at which point, you gag on her, and her shaft gets wet."},
			{
			"foreground": "BRIGAND_ORAL",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralSex":1}}],
			"text": "Her full set slaps repatedly against your chin - evidence that she wasn't lying about how often she coats a tree in her own sap. A shame - if she did occasionally baste some bark, or sprinkle some suds in the dirt, it's highly unlikely that her balls would be so stuffed full and eager to drain, or that such draining would result in so much jelly-like, unpalatable spermslime."},
			{"text": "Of course, it would be even more fortunate if that was irrelevant to you - then it wouldn't matter that she'd been saving it up for days, or weeks, to the point that it probably audibly sloshed about in her ballsack as she walked, because that disgusting semen slurry wouldn't be ending up in your mouth, throat, and stomach."},
			{"text": "You can tell by the full, pulsing nature of her fat sack pressing wetly against your chin that her sperm overdose is about to become your problem very soon - her ejaculation mid-irrumatio is all but assured."},
			{"text": "Her cock pulses in your mouth, unquestionable evidence of her orgasm, which means, unfortunately, that it's only a matter of heartbeats before her nasty cocksnot explodes out of her cock's eye and into your unprepared mouth."},
			{"text": "In those last moments where you're blissfully unaware of the taste and texture of her creamy sperm cocktail, your mind tries desperately to find an out - some way to avoid being blasted in the face with her pungent genetic goo, but it's interrupted by said goo making its presence felt in such an obvious way that it renders the point moot."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralCreampies":1}}],
			"text": "Blorp."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralCreampies":1}}],
			"text": "The deluge kludges its way over your tastebuds, giving you a blast of flavor that is undoubtedly straight from the bottom of the nutsack."},
			{"text": "You gag, because, well, yeah."},
			{"text": "You feel like her horrendous spermsludge is shooting directly into your brain, coating it in a greasy, sticky mess of discarded ball juice."},
			{"text": "You feel lucky that it's leaking out of your nostrils, bubbling and frothing as it does, because at least then you know not all of her breeding slime is going to end up stuck in your head, although it is still humiliating to feel her cum spewing out of your nose because there's too much for you to swallow."},
			{"text": "Even if it didn't taste awful, salty and slimy and bitter and hot, its sheer thickness makes it difficult to swallow.  It's so viscous that your throat nearly clogs the first time you try, although you manage to glug down enough of it that you know exactly what the swill you're reluctantly chugging down is - nutbutter."},
			{"text": "As soon as that first batch of gloogy, soon to be disappointed spermsoup flows down your throat and into your stomach, it turns.  If she hadn't managed to spew it in your mouth, your lips would have been defiled, but at least your gut would have gotten away unscathed.  Instead her cooling, denatured ejaculate is upsetting your digestion, and your throat is coated in her slime."},
			{"text": "The inner linings of your throat are so thoroughly coated with the greasy stuff, in fact, that even when she isn't spurting more of her homemade honey down it, you can feel it slowly flowing downwards, in big, goopy, impregnating batches."},
			{"text": "The way it flows, it really does feel like slime - except instead of coating the inside of her pouch puppies, or seminal ducts, it's sliming up your throat, still hot from the source, threatening to make you choke."},
			{"text": "Every time you swallow you're forced to remember that you sucked on her penis until she came in your face, and your lips aren't exactly penis-sucking free; to the contrary, you still have her erect penis in your mouth, and will until she's finished with you."},
			{"text": "It isn't much longer before that's the case, and her half soft, and definitely empty willy slides out from between your wet lips, trailing slime down to the floor."},
			{"text": "Your mouth is agape in shock, which allows the gelatin-like goop to viscously slop out slowly.  As the stringy threads of her semen ick towards the floor, you realize that the entire inside of your mouth is coated in a thick, goopy layer of stuff that should rightfuly be coating the inside walls of a vagina - or, as the oily stuff was a minute ago, the inside of a ballsack."},
			{"text": "If she cares that you're letting the latter half of her premeditated sperm blast drool onto the floor, she doesn't show it. In fact, she seems entirely disinterested - still lost in the daze of having blown ten loads' worth all at once down someone's throat. Without even looking at you, she wipes her nose, coughs, and checks the fullness of her balls, to her satisfaction."},
			{"text": "After emptying her nutsack in a torrent of semen into your face, she simply hoists up her pants, glances sideways at you, doubled-over, drooling it out in thick globs onto the floor, and then saunters off into the forest, her goal complete."},
			{"text": "Finally coming back to your senses, you cough and spit up what you can of the nasty, thick stuff at the base of a tree, wiping your mouth clean with your sleeve, though its coated in saliva and her cum and precum - a real mess.  You clean it up as best you can, and spit it up as best you can, but there's still a few load's worth bubbling in your stomach, which is very upset about your choice of meal."},
			{"text": "With the brigand's greasy lust weighing heavily in your gut, you rest to heal your wounds, feeling particularly nauseous about the whole affair."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 10}}],
			"text": "You rest. You recover 10 health."}
		]
	},
	{
		"key": "BRIGAND-SATISFIED",
		"scriptLines": [
			{"text": "Having drained her load in you, the Brigand seems satisfied.  She sheathes her weapon, and also puts away her sword, and leaves you to puzzle out what to do with all of her semen."}
		]
	},
]}