{"script": [
	{
		"key": "DRYAD-INTRO",
		"scriptLines": [
			{
			"music": "SHOP_MUSIC",
			"foreground": "DRYAD_BACKGROUND",
			"text": "You encounter a woman sitting on a tree."},
			{"text": "On closer inspection, you notice that she's not sitting on the tree, but rather, is fused with it - could she be a dryad?"},
			{"text": "As you approach her, you see that she is holding an apple that looks incredibly delicious.  You suspect that if you could take a bite of that apple, your hunger woes would subside for a time."}
		]
	},	
	{
		"key": "DRYAD-OFFER",
		"scriptLines": [
			{"text": "You offer the dryad your apple in exchange for her apple, and she accepts, giggling."},
			{"text": "You bend over, and she rubs her hands, sticky with sap, over your rear, and into your offered-up apple core."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "Up goes her wood, with little fanfare. It's smooth and polished, and quite literally wood."},
			{"text": "Something is wrong... she glides it in and out smoothly, thanks to the sap, but you're starting to sweat - something feels off."},
			{"text": "Then, you can finally feel it - splinters."},
			{"text": "It irritates your anal mucosa, even as her wood becomes smoother and more polished. You're red in the face for all the wrong reasons - thankfully, the dryad proves to be a quick shot, and you feel her sap rush in all at once."},
			{"text": "Her thick sap stings your scratched, swollen innards."},
			{"text": "Your irritated hole still drooling her sap out unevenly, she rests the apple by your face, and you stare at it cross-eyed as she giggles and retreats into the wood."},
			{
			"mutations": [{"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": -5}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 10}}, {"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "So that happened. You take 5 damage from the splinters. You receive 10 food from the Dryad. You receive 1 Experience."}
		]
	},	
	{
		"key": "DRYAD-CONVINCE",
		"scriptLines": [
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 10}}, {"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You convince the dryad to offer up her apple. You receive 10 food from the dryad. You receive 1 Experience."}
		]
	},	
	{
		"key": "DRYAD-FAIL",
		"scriptLines": [
			{"text": "The dryad is unconvinced by your offer, and melds back into her tree, disappearing without a trace. Disappointed, you leave."}
		]
	},
]}