{"script": [	
	
	{
		"key": "ELF-INTRO",
		"scriptLines": [
			{
			"music": "GADGETEER_MUSIC",
			"text": ""}
		]
	},
	{
		"key": "ELF-ENTER",
		"scriptLines": [
			{"text": "The camp is quiet... just the crackling of the fire and the mournful whispers of the morning wind.  The sun has not crested the distant mountains, yet, but the dark in the sky has broken."},
			{"text": "Still, the world is dim.  Your ears perk up - you hear a shifting in the grass that couldn't just be the wind.  You track the source of the sound, as the shuffling becomes more agitated."},
			{"text": "You ready for a fight, dropping into a low, guarded stance.  Something appears from within the grass, and you tense."},
			{
			"foreground": "ELF_TURTLE",
			"text": "You blink.  Emerging from the tall grass is... a giant tortoise.  It blinks back.  It's carrying some kind of glowing lantern, and strapped to its back is a basket full of glowing mushrooms.  It's a very strange sight."},
			{"text": "Neither of you say anything.  Well, you don't say anything - the tortoise is a tortoise."},
			{"text": "\"Mmmmm... you don't seem dangerous.  I believe it's safe to come out, Kylira,\" says the... tortoise.  You boggle, but before you can say anything, something else emerges from the grass."},
			{
			"foreground": "ELF_AND_TURTLE",
			"text": "You trace over their form - woman? man? - you can't tell.  You can see from the shape of their ears, though, that they're some kind of fey folk - likely an elf."},
			{"text": "They too are carrying a lantern, visible now that they're through the thick grass.  They look slightly disheveled from traversing it; they're hardly the picture of graceful elegance that you expect from an elf, at least."},
			{"text": "They brush grass out of their hair and clothing, and then, finally, seem to notice you - keen senses, they do not have."},
			{"text": "\"Oh! Um, hi!\" they say, and you shake your head in disbelief.  Their voice is somewhat high and breathy, and certainly feminine... they seem anxious to be standing there, or anywhere, really."},
			{"text": "\"H-hi,\" you say, in muted tones.  Did that turtle speak to you?"},
			{"text": "\"I'm a tortoise, actually,\" he says, and you pinch the bridge of your nose."},
			{"text": "\"O-okay. Sorry. Um, did you say your name was...?\""},
			{"text": "\"Kylira,\" says the tortoise."},
			{"text": "\"And you are...?\" you say, to the small elf who seems uncomfortable."},
			{"text": "\"Um, I'm Kylira,\" they say, helpfully."},
			{"text": "You sigh.  \"And you are...?\" you say to the tortoise."},
			{"text": "\"A tortoise,\" he replies, and you give up."},
			{"text": "\"Okay. I'm <NAME>. Why are you travelling so early in the morning?\""},
			{"text": "The tortoise opens its mouth to speak, and you shush it.  It closes its mouth, looking indignant. Or not.  It doesn't really have facial expressions."},
			{"text": "\"Not you. Kylira.\""},
			{"text": "Kylira plays with the hem of their dress. \"I, uh, prefer to travel at night.  So there aren't as many people on the roads.\""},
			{"text": "You nod.  \"That's dangerous for a young... elf.  Isn't it?\""},
			{"text": "Kylira averts their gaze. \"Yes, but... I don't do well around people.\""},
			{"text": "\"And... doesn't that tortoise slow you down?\" you ask, eyeing the speaking tortoise."},
			{"text": "\"I'm quick enough,\" he says, defiantly, and you roll your eyes."},
			{"text": "\"Well... I won't get in your way then,\" you say, trying to extract yourself from the situation. You turn to head back to your campfire."},
			{"text": "\"W-wait! Would you like some mushrooms?  I'd be willing to share some with you, <NAME>.\""},
			{"text": "You wouldn't mind some free mushrooms, although the way they glow is a little... concerning."}
		]
	},
	{
		"key": "ELF-ACCEPT",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":3}}],
			"text": "You accept the mushroom meal - sitting down with Kylira and her disturbing tortoise beside the campfire."},
			{"text": "The mushrooms have a... strange texture and flavor.  You feel a great levity as you eat them, and Kylira and her shelled friend seem similarly elated."},
			{"text": "You chat with them about their travels."},
			{"text": "\"Oh, yes, we harvest mushrooms from the enchanted forest, and then we sell them.  Humans really seem to like them!  ...sometimes.\""},
			{"text": "\"It's dangerous to travel alone without a weapon. How do you... protect yourself from the enchanted woods?\""},
			{"text": "Kylira scratches their chin.  \"Mmm... well, I'm... intimately familiar with them flora and fauna, so I know how to keep safe.  And what I don't know, Testu does,\" they say, glancing at their turtle companion."},
			{"text": "He is absolutely ravishing the mushrooms, and seems too interested in that endeavor to respond, or even to have heard what Kylira was saying."},
			{"text": "\"It is very dangerous, though. I've learned a healing touch, as well, so if I get injured, it's not... so terrible.\""},
			{"text": "You nod along, eating your mushrooms, bringing you to higher and higher spirits."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 20}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "Finishing the meal, you feel absolutely stuffed."},
			{"text": "\"Well... if I come across you on the road again, maybe we can share a meal again?\""},
			{"text": "As the sun starts to climb the sky, you part ways with Kylira... still not sure if they're a boy or a girl elf."}
		]
	}
	{
		"key": "ELF-DECLINE",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":2}}],
			"text": "\"Oh, well, that's fine... well, goodbye for now, then.  If we come across each other again, maybe you'll be in a better mood...\""},
			{"text": "The tortoise is silent as the two of them continue on their way past you, and you watch them disappear again into the grass."}
		]
	},
	{
		"key": "ELF-RETRY",
		"scriptLines": [
			{
			"foreground": "ELF_AND_TURTLE",
			"text": "You come across the elf Kylira again. Once again, their tortoise is hauling a large collection of bioluminescent mushrooms."},
			{"text": "\"Would you like some mushrooms?\" they offer."}
		]
	},
	{
		"key": "ELF-REUNION",
		"scriptLines": [
			{
			"foreground": "ELF_AND_TURTLE",
			"text": "You come across Kylira again, and they look... dispirited.  You ask them what's wrong."},
			{"text": "\"I've been collecting mushrooms for so long... but there seem to be fewer and fewer each year.  It's becoming difficult to live in human lands, where everything has a price...\""},
			{"text": "\"Why don't you return home?\" you ask, and Kylira looks even more downtrodden at hearing those words."},
			{"text": "\"I... could. It's been so long...\""},
			{"text": "They're silent after that.  The tortoise, Testu, invites you to join them for supper."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 20}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}],
			"text": "You have a long, somber meal, together with the elf and their strange companion."},
			{"text": "Sitting close to Kylira, eating the soothing mushrooms again, you start to feel... warm. They smell floral, and occasionally, their gaze catches yours, before quickly turning away."},
			{"text": "Kylira notices that Testu is enthralled with his mushrooms, as always, and leans against you, resting their head on your shoulder."},
			{"text": "\"<NAME>... do you... have someone waiting for you at home?\" they ask, somewhat pointedly."},
			{"text": "You shake your head, and they look up at your face, their eyes gentle and their nervousness plain."},
			{"text": "\"Then... would you like to spend... some more time with me?\""},
			{"text": "Kylira closes their eyes and leans in slowly for a kiss."}			
		]
	},
	{
		"key": "ELF-TOP",
		"scriptLines": [
			{"text": "You make the first move, putting your arms around Kylira and meeting them more than halfway - they make a small sound of surprise as your lips first graze theirs, but they respond positively, putting their hand on your chest."},
			{"text": "You embrace them... your hand roaming down their body... and you feel their member stiffening beneath their dress."},
			{"text": "\"Could you tell that I was a boy?\" he asks, bashfully."},
			{"text": "He shifts so that he's sitting in your lap, with his slender arms around your neck."},
			{"text": "You kiss again, and you free yourself from the confines of your undergarments, which he, conveniently, doesn't seem to be wearing"},
			{"text": "..."},
			{"text": ".."},
			{"text": "."}
		]
	},
	{
		"key": "ELF-BOTTOM",
		"scriptLines": [
			{"text": "You close your eyes, and soon thereafter feel Kylira's lips touch yours.  They're soft, and their cheeks are soft as well.  You nuzzle their nose with yours."},
			{"text": "They gently push you down the ground, and you hold fast to your kiss even as you each begin to disrobe."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "You feel it enter inside of you, and wrap your arms tightly around him."},
			{"text": "You wrap your legs around him as well, and arch your back as he pushes it deep inside. You feel a warmth building, and building... your eyelashes flutter as you get closer to a lustful release."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1, "creampies": 1}}],
			"text": "You feel such a heat between you, inside of you, exploding out of you... you lock your lips together in a breathless kiss... and, chest to chest, your hearts begin to slow together..."},
			{"text": "..."},
			{"text": ".."},
			{"text": "."}
		]
	},
	{
		"key": "ELF-DENY",
		"scriptLines": [
			{"text": "You shift a bit to avoid their kiss. Kylira is silent for a bit... and then sighs."},
			{"text": "\"I'm sorry... I thought... is it because I'm also male?\" he asks, and then goes quiet. You don't know what to say."}
		]
	},
	{
		"key": "ELF-CAREER",
		"scriptLines": [
			{"text": "Some time goes by that you spend in silence, looking up at the star-spackled sky."},
			{"text": "\"So... I don't know what to do,\" he says, suddenly. \"How can I be of service if the mushrooms are dying out?\""}
		]
	},
	{
		"key": "ELF-BROTHEL-SUGGEST",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":4}}],
			"text": "You give him advice - he's got good looks, why not try working in a brothel?"}
		]
	},
	{
		"key": "ELF-JOIN-SUGGEST",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":5}}],
			"text": "You ask him to join you.  After all, as an adventurer, surely you could patron his companionship and his talents?"}
		]
	},
	{
		"key": "ELF-HEALER-SUGGEST",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":6}}],
			"text": "Tell him to become a travelling healer - after all, how many humans have that ability? Surely, there's some worth there."}
		]
	},
	{
		"key": "ELF-LEAVE-SUGGEST",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":7}}],
			"text": "You tell him to return to the elven lands - there's no point in trying to live among humans without anything to offer them."}
		]
	},
	{
		"key": "ELF-HEALER",
		"scriptLines": [
			{
			"foreground": "ELF",
			"mutations": [{"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 100}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 10}}],
			"text": "Kylira sees you and waves to you. As thanks for your advice, he heals your wounds, and offers up some of his signature mushrooms for the road, before wishing you a good day."}
		]
	},
	{
		"key": "STICK",
		"scriptLines": [
			{
			"background": "STICK_BACKGROUND", 
			"text": "You encounter a stick!"},
			{"text": "It's actually rather sexy looking."},
			{"text": "There is nothing left here to do."}
		]
	},
]}