{"script": [
	{
		"key": "INTRO",
		"scriptLines": [
			{"text": "Welcome to the world of Tales of Androgyny!"},
			{"text": "This is a pre-alpha build - many systems and assets are not currently in place, so please don't expect this to be the full game experience!"},
			{"text": "If you encounter any bugs, please let us know - leave a comment on our game page at itch.io, send us an email at majalis.patreon@gmail.com, or message us on Patreon.  Thank you!"},
			{"text": "Some tutorial tips to follow - hold CTRL to skip and to select your game mode."},
			{"text": "Combat is stance based.  The three core stances are Balanced, Offensive, and Defensive.  Abilities that you can use are determined by stance, and using them may result in a new stance - for example, using Spring Attack in Balanced stance will leave you in Offensive for the next round, and using Cautious Attack will leave you in Defensive."},
			{"text": "Balanced stance is a staging stance - most abilities will move you into a new stance.  It has a balance of offensive and defensive abilities."},
			{"text": "Offensive stance has powerful abilities that can damage, unbalance, or otherwise upset your opponent, but at a high cost to stamina, stability, or both, or by lowering your defenses, depending on the ability."},
			{"text": "Defensive stance has defensive abilities, and can be used to weather an enemy's brutal attacks, or to get on more stable footing or catch a breather, in preparation of launching a new offensive, or to let an enemy tire themselves out before you subdue them."},
			{"text": "The core statistics are Strength, Endurance, Agility, Perception, Magic, Charisma.  All of a character's core statistics are used in determining encounter outcomes.  Your current statistic score is your base score and any more temporary modifiers, like being tired or injured."},
			{"text": "Running out of Stamina will cause you to momentarily black out, falling over - running out of Balance will similarly cause you to trip.  Try to use less strenuous abilities to preserve and recover stamina, and more stable abilities to remain balanced."},
			{"text": "You're looking mighty fine, by the way.  Please select your game mode."}
		]
	},
	{
		"key": "CHARACTER-CREATE",
		"scriptLines": [
			{
			"mutations": [{"saveType":"MODE", "value":{"class": "com.majalis.save.SaveManager$GameMode", "value": "SKIRMISH"}}],
			"text": "You've selected to create your character!"},
			{"text": "Please choose your class."}
		]
	},
		{
		"key": "STORY-MODE",
		"scriptLines": [
			{
			"mutations": [{"saveType":"MODE", "value":{"class": "com.majalis.save.SaveManager$GameMode", "value": "STORY"}}],
			"text": "You have entered story mode."},
			{"text": "A tale of androgyny has begun..."},
			{
			"music": "WAVES",
			"background": "BURNING_FORT_BG",
			"foreground": "SILHOUETTE",
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "The wind is warm and carries the smell of the sea and smoke alike; distant thunder comes not from the sky, but across leagues of night-black ocean."},
			{"text": "She peers over the void, lit up in reflection intermittently by the fires that consume an ancient fortress as it burns in the night, the occasional burst of sound carried on the wind reaching her, miles away, when the flames reach a munition store or chemist's laboratory or arcanist's cache.  Brickwork as old as time crumbles into the sea, the western battlements bleeding out stone, smoke, and the crimson remains of the slain."},
			{"text": "She sips from her goblet, similarly sanguineous, and lets out a sigh."},
			{"text": "The moon has never seemed so full as tonight, she muses to herself, and yet his armies lay broken, his dominion shattered, his very life, she relishes, like the moonlight reflected in her drink - insubstantial, and soon to be gone forever.  Because of her.  Her purple, stained-red lips stretch into a fanged smile, and she licks her teeth in satisfaction."},
			{"text": "This - she thinks to herself, as the fires rage on and the once great fortress sinks in large part into the sea - is what victory tastes like."},
			{"text": "With that, she presses the goblet to her lips and tilts her head back, draining the last of it.  The moonlight reflects off her eyes, deep and red as her drink, but as bright as the fires blazing in the summer breeze."},
			{
			"sound": "SMUG_LAUGH",
			"text": "She stands gracefully from her viewing seat of bone, and casts the goblet into the abyss, feeling free and merry.  She crosses her arms on her chest, grasping herself in excitement, her breath ragged and terse."},
			{"text": "She hears a whimper, and is suddenly reminded that she's not alone to bask in this momentous occasion - there is also... another."},
			{"text": "He was his lord's second in command - an effeminate youth who fell madly, brazenly in love with her, and who was instrumental in helping to bring about the night's key events.  He has to be rewarded, she realizes."},
			{"text": "He was promised her... affection, if only he turn traitor, and he'd performed his duties admirably, so she is in no position to refuse.  She'd strung him up earlier in the evening, suspended from the trees above with a rope each around his ankles and wrists, but when she approaches him, clearly drunk and eager to... canoodle, it pricks up immediately, even as he hangs there, immobilized and naked."},
			{"text": "\"My, my... someone is eager,\" she says, flicking it with her well-manicured finger.  \"I do believe... it's time.\""},
			{"text": "She runs her fingernail up and down it, as her hand roams down her body, to the underside of her cold iron girdle, where his \"reward\" was rapidly growing in size, much to his ignorance."},
			{"text": "She walks away from him, taking a deep breath of the refreshing smell of sea salt and smoky oblivion, allowing him to watch her hips sway as she approaches the cliffside, where her viewing seat has been erected, and procures from it a flask of a particular oil.  She sits on her viewing seat, mostly out of his view, and he whines his complaints about this arrangement through his gag."},
			{"text": "From his vantage, he can see her spread her legs, wide, her back arched, as she holds the flask high in the air, and then tilts it, pouring it down onto herself.  Indeed, she pours it directly into her girdle, where it slathers over her awakening beast while she moans in anticipation."},
			{"text": "With the flask expended, she lets it fall to the ground, and rises to her feet, nearly done with her final preparations of the night."},
			{"text": "She turns to face him and begins unfastening her girdle, so that it eventually hinges open, and then falls with a heavy crash behind her.  With the oversized moon at her back, he sees her in silhouette - but the perturbation is clear, even then: a jet black object of some size and evil shape, studded and flared, emerging from between her legs."},
			{"text": "It's slick with oil, and as she grabs hold of the ropes suspending his legs, it bobs ominously.  He stares at it, transfixed, horrified."},
			{"text": "\"All that, only to get dicked in the end anyway.  I almost feel bad for you,\" she says, reaching down to stroke her black-as-pitch phallus, which glistens in the moonlight as it sticks out from her body.  Even as she tells this lie, she lines it up into position: his anus, spread and defenseless by the distant ropes that hold his legs apart."},
			{"text": "Her semen tanks are utterly full - she'd waited a long time since she'd seeded her plan, and in all of the preparations and planning, she'd not seeded anything else.  Unfortunately for him, she had also arranged to fix that as soon as her victory was assured."},
			{"text": "She grips his ankles - firmly, and he stares wide-eyed at the onyx thing pulsing with energy pressing up against his spread hole."},
			{"text": "She eases her hips forward, slowly, more, and more, and more... as he groans into the gag, feeling her push more and more of herself into him.  The monstrous, inhuman phallus stretches his insides in ways unthinkable, and his eyes, among other things, open as wide as they possibly can."},
			{"text": "She licks her canine tooth, and peers deeply into his eyes."},
			{"text": "Tonight, she thinks, is a good night."},
			{"text": "{ Tales of Androgyny }"},
			{"text": "\n\n{ Tales of Androgyny }"},
			{"text": "\n\n\n\n{ Tales of Androgyny }"},
			{
			"music": "HOVEL_MUSIC",
			"background": "DEFAULT_BACKGROUND",
			"foreground": "NULL",
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "So it has come to this."},
			{"text": "The first fires of creation have died out, and all that remains are the embers and ash of what could have been greatness."},
			{"text": "It smolders, blackened, like dying coal, spent of life."},
			{"text": "The tears fall.  Your shoulders tremble."},
			{"text": "What could have been has been undone.  In all of the cosmos, of infinite possibilities, a singular truth has been revealed, and it it this:"},
			{"text": "Breakfast... is ruined."},
			{"text": "You toss the burnt eggs into the same refuse pile that is your shrine to ruined meals and sigh."},
			{"text": "It's been almost two decades since the Moon Lord's defeat and life in the outskirts of Nadir... isn't great, but the constant raids by moonmen have ceased, and the wellwater has never tasted less putrid."},
			{"text": "Just the other day, that girl from the village even said your name - probably. And recently, all those forays into the village library have proved fruitful.  Not only have you gained useful knowledge to put your life as a peon into perspective, but you now know about the mating habits of ducks and..."},
			{"text": "Maybe they haven't been so fruitful after all."},
			{"text": "You glance down at the dribbling eggs.  Is this all there is to life?  Failing to accomplish basic tasks and waiting to grow old?"},
			{"text": "No.  No, that can't be it, you assure yourself, even as the last gooey-yet-burnt drippings of your failure slough off the walls of the dilapidated hut you call home and into that same pile of ruined breakfasts where you keep your genetic legacy."},
			{"text": "There is one thing that separates men from beasts, and you feel it strongly.  With renewed vigor, you throw open the door, well, flap, to your abode, and greet the sunshine of day; it's so bright that it hurts your eyes and you almost immediately give up."},	
			{
			"mutations": [{"saveType":"CLASS", "value":{"class": "com.majalis.save.SaveManager$JobClass", "value": "ENCHANTRESS"}}],
			"text": "But you don't - and that's what counts.  For the one thing that separates men from beasts?"},
			{"text": "Denial."},
			{"text": "First things first - you have to go to him.  The man that's been waiting for you.  The man that taught your mother.  The legend of the nearby village, living alone in a cottage on the village outskirts - the place where your true destiny will first take root."},
			{"text": "You pack your things - there isn't much - and leave for the cottage on the outskirts."}
		]
	},
	{
		"key": "STORY-003",
		"scriptLines": [
			{
			"background": "CABIN_BACKGROUND",
			"music": "TRAINER_MUSIC",
			"text": "After a short trek, encountering nobody along the way (thankfully), you see the cottage in the distance.  Smoke billows from the chimney slowly - a dim fire lit within.  As you approach the front door, you hear a faint, muffled voice; a man is speaking."},
			{"text": "You knock on the door, and the speech stops, only to be replaced with a fumbling of the lock and a louder, more resonant voice."},
			{
			"foreground": "TRAINER",
			"text": "\"I've been waiting. It was only a matter of time,\" they say, unfastening the final lock, and pulling open the heavy oaken door, \"now, you can finally fulfill your destiny as...  who are you?\", the man standing in the doorway asks, once his eyes fall on you.\""},
			{"text": "You recognize him instantly, though he's aged years - years that have not been kind to him.  He was once a tall, proud, handsome man... now he's a tall, confused, kind-of-handsome-in-that-older-guy-way man, and he has clearly not been keeping up with the razor."},
			{"text": "You rally your resolve. \"I am the son of the hero that defeated the Moon Lord, and I...\" you say, but he holds up his hand."},
			{"text": "\"Hold on.  Moon Lord?  Why does that sound familiar?\" he says, scratching his beard pensively, \"Big guy?  Elephant head?  Breathes pure dark flame?\""},
			{"text": "You deflate slightly. \"No... I think that was the Dark Lord... the Moon Lord--\""},
			{"text": "\"--could conjure spiders by blinking, right?  A hundred feet tall, body made of corpses, wails of the legions of the damned whenever he spoke?\""},
			{"text": "\"No, that was the Marquis of Death, if you rem--\""},
			{"text": "\"Skeleton, big hands, spellcaster, huge fortress--\""},
			{"text": "\"Overlord.\""},
			{"text": "\"Lived in a palace on the moon, big snake...\""},
			{"text": "\"Moon serpent.\""},
			{"text": "\"But I'm getting closer, right?\""},
			{"text": "\"No. The Moon Lord terrorized our lands for centuries. He destroyed our village.  Twice.  He killed YOUR parents.\""},
			{"text": "\"Right, that guy.  What about him?\""},
			{"text": "\"Nothing!  Nothing about him!  My mother slew him, and...\""},
			{"text": "\"You've come to collect. Every day another poor schmoe is knocking on my door asking about a quest I put out years ago- look, there's a statute of limitations on this stuff.  I don't even have any more enchanted swords; you'll have to settle for like, enchanted silverware.\""},
			{"text": "\"I don't want... I'm not here to collect anything! You taught my mother how to fight... how to be a hero... and I want you to teach me, too!\" you say, loudly and clearly."},
			{"text": "He pauses, clearly deliberating... even as he slowly closes the door in your face."},
			{"text": "\"Wait, wait!  I'll pay you!\" you say, jamming your foot in the door."},
			{"text": "\"Will you?  What have you got?\", he asks, easing up, but not letting you pull the door open any more than it already is."},
			{"text": "\"Well... nothing, but... ow!\" you exclaim, as he kicks the toes of your boot in an attempt to dislodge it from the door."},
			{"text": "\"I'm tired of being paid nothing!  Folksy wisdom doesn't grow on trees, you know!  Take your \"Poon Lord\" talk and shove it!\""},
			{"text": "He finally kicks your boot free, and slams the door shut.  You stand, dumbfounded, unsure what to do next... but after a few moments, he opens the door again."},
			{"text": "\"Oh, are you still here? I thought the encounter was over\", he says, scratching his chest boorishly."},
			{"text": "\"Even if... even if I can't pay you now... one day...\" you say, on the verge of tears, and he sighs."},
			{"text": "\"One day you'll have a whole list of fantastic enemies, and one of them will slit my throat in my sleep.  Fine.  I welcome it,\" he says, stepping aside to let you in, \"but you get one consultation.  And I expect payment deferred.\""},
			{"text": "You enter the cottage, expecting to see the walls lined with weapons and trophies from various evil beasts - instead, you see tea cozies and tasteful wall rugs."},
			{"text": "\"I'm a retiree.  I've got plenty of time to decorate,\" he explains, before sitting into a well-cushioned armchair, oofing all the way."},
			{"text": "\"So... you trained my mother,\" you say, keeping on your feet, full of determination, even as he gestures for you to sit down. \"Now I want you to train me,\" you reaffirm, and he nods."},
			{"text": "\"What for?\" he asks, peering over his steeped fingers, \"What are you hoping to accomplish?\""},
			{"text": "You close your eyes. It's been so long. You were just a child, then... but not now. \"To defeat who even my mother could not,\" you say, will unwavering, unlike your voice."},
			{"text": "\"The Dragon God...\" he says, in disbelieving tones, sitting forward in his chair."},
			{"text": "\"No, the Demon King.\""},
			{"text": "\"Right, the Demon King...\" he says, in disbelieving tones, still sitting forward in his chair. \"That's... not gonna lie, that's not happening. Still, though, we all have dreams,\" he says, sitting back in his chair, arms on the armrests, relaxed.  \"Worth a shot.\""},
			{"text": "As reassuring as his words are, you feel a hint of trepidation.  You finally take his offer to sit, and he leans forward again to pour you some tea.  You take the floral cup he offers you and sip at it... it's long cold.  The fire is nearly extinguished."},
			{"text": "\"So you'll train me, then?\" you ask, and he nods, \"Like you trained my mother?\""},
			{"text": "\"I... wasn't your mother's trainer, per se.  I was -a- trainer, and she purchased my services once or twice... once...\" he says, trailing off, and you feel your heart sink.  \"B-but that still counts, right? Maybe without my help, she never would have killed the Moon Bug.\""},
			{"text": "\"Moon Lord.\""},
			{"text": "\"Right, that.  If I can help her kill the Worm Lord, I can help you kill the Demon King, theoretically.  Not a doubt in my mind,\" he says, although it's plain on his face that he's doubting even the basic premise of what he's saying, even putting aside what he said earlier."},
			{"text": "\"You'll help me? Even though I can't even pay you?\" you say, gratefully, and he clicks his tongue."},
			{"text": "\"Don't have to rub it in.  Yeah, I'll help you.  Right now.  Clock's ticking,\" he says, pointing to his clockpiece standing against the wall, which is... clearly broken."},
			{"text": "\"Do you really think, if I start now, I could... maybe, one day... defeat the Demon King?\" you ask, trying to cling to hope."},
			{"text": "\"Let me think... 'she slew a great demon in a faraway land.  What became of her afterwards, few know, not even her own son' - that's you, right? Or do I have the wrong Dune Fjord slaying mama?\" he says, apparently having finally recalled something about your mother and her story."},
			{"text": "You ignore his error and focus on what he's implying.  \"My mother was great and powerful.  I'm... me,\" you say, dejected, and he stands up - you're so surprised, you stand up as well, and he grasps your shoulders."},
			{"text": "\"Well, even she had to start somewhere.  She didn't simply take up the holy sword Irathel and march off to defeat the Moon Lord half-cocked.  She had to stab thousands of inconsequential slimes and fauna before that,\" he says, reassuring you."},
			{"text": "\"My mother didn't take up the holy sword Irathel at all.  That was her cohort, the Paladin of Drepnir,\" you say, correcting him."},
			{"text": "\"Holy sword, magic bracelet, whatever.  The point is that her magical items dropped off of some less powerful creatures, and the items she used to defeat those schlubs dropped off of even less powerful creatures, maybe even people.  In a world where the only way to get more powerful is to kill and steal, you have to start small,\" he says, his eyes full of kindness."},
			{"text": "\"I don't know if I have it in me,\" you say, hesitance gnawing at you."},
			{"text": "\"That's horse manure,\" he says, slapping your shoulder, painfully, \"If your mother could slay the Goon Lord, you can slay the Demon King.  Uh, 50/50 odds, at least.  Probably,\" he says, waving his hand about noncommitally."},
			{"text": "\"You think so?\" you ask, and he... admittedly takes a second to answer."},
			{"text": "\"You're your mother's son. I'm sure you can take a life like the best of 'em.  And if you can't, a few hours bashing rats with a stick will get you up to speed,\" he says, confidently.  \"But first things first.  You'll need to pick a class.\""},
			{"text": "You blink.  \"A... class?  Like, the remedial kind, or...?\""},
			{"text": "\"No, no,\" he says, waving his hand dismissively, \"a hero class.  You know, what defines you as an adventurer.  It represents a lifetime of training, discipline, and learning, as well as your personal outlook, philosophy, and primary strategy.\""},
			{"text": "You nod along.  \"Uh... then... shouldn't I have selected my class, like, a long time ago?\""},
			{"text": "\"You'd think, right?  Anyway, just pick one.  This is important, and you shouldn't be reckless in choosing, but... I skipped lunch, and it's getting late, so, you know...\" he says, waving his hand along."},
			{"text": "\"I don't... I don't even know what the options are,\" you say, already losing your nerve."},
			{"text": "\"Oh, for the love of... alright, here I am, your glorified class selection menu.  Let's move this along.  Ready?  Here we go\", he says, holding his hands up in the approximation of a rectangle."},
			{"text": "\"WARRIOR\", he says, out loud, before pausing for effect."},
			{"text": "\"Warriors are martial adepts, boasting excellent fighting skills and physical fitness.  This is adventurer classic, but the classics are classics for a reason.\""},
			{"text": "\"Awesome!  Mom was really strong.  I like it,\" you say, and he scratches his chin, trying to avoid eye contact."},
			{"text": "\"Well, that's true, but... it doesn't really suit you.\""},
			{"text": "\"Why do you say that?\""},
			{"text": "\"Well... who's going to believe that someone that looks like you has a high STR score?\""},
			{"text": "\"That's...\""},
			{"text": "\"And besides, everyone picks Warrior.  It's like... vanilla ice cream.  You don't want to be boring, do you? Even if your mother was one, you've got to forge your own path.\""},
			{"text": "\"I... I guess you're right.\""},
			{"text": "\"Alright, next. ROGUE.\" he says, again, loudly, leaving an awkward silence lingering for a moment."},
			{"text": "\"Rogues are highly skilled, lightly armored combatants.  They represent the cream of the crop in terms of their agility. They're masters of outmaneuvering their opponents and avoiding potentially fatal blows.  Pretty nice, huh?\""},
			{"text": "\"Yeah!  I could use two weapons, and sneak behind enemies, and kill them before they even see me!  I wouldn't even have to be a good fighter.\""},
			{"text": "\"True, true... but you'd also have a bad reputation.  Would your mother really be proud if her son became a world class, back-stabbing murderer?\""},
			{"text": "\"...no, I guess not.  Fine.  Next.\""},
			{"text": "\"PALADIN. Formidable, stalwart, and holier-than-thee...\""},
			{"text": "\"Thou.\""},
			{"text": "\"Pardon?\""},
			{"text": "\"It's 'Holier-than-thou.'\""},
			{"text": "\"That doesn't seem right.  Really?\""},
			{"text": "\"I'm pretty sure.  If we go to the library, we could look it up.\""},
			{"text": "\"I mean, yeah, but... do you want to go all the way to the library just to see how people used to talk?\" he says, implying that it's a giant waste of time."},
			{"text": "\"It just sounds weird, is all,\" you say."},
			{"text": "\"...\""},
			{"text": "\"...\""},
			{"text": "\"ANYWAY, Paladin...\""},
			{"text": "\"Wouldn't the plural be 'Paladins'?\""},
			{"text": "\"PALADINS are resilient and heavily armored, and are capable of holy magicks.  Are you going to say something about how I spelled 'magick'?\""},
			{"text": "\"No... that... speaks for itself.\""},
			{"text": "\"...I'll give you a sovereign if you'll shut up and let me describe the Paladin.\""},
			{"text": "\"Done.\""},
			{"text": "{RECEIVED 1 GOLD SOVEREIGN}"},
			{"text": "\"...and so, because of this, they're the most defensive class. For some reason, there's no playable Cleric or Healer class, so they're the only healers.  They adhere to a strict code of ethics, and are sworn in by vows to uphold law, no matter the circumstance.  Are you prepared to take those vows?\""},
			{"text": "\"I'm more of a descriptivist myself, really.\""},
			{"text": "\"...\""},
			{"text": "\"RANGER. As their name suggests, they're unparalleled at ranged combat.  I could actually see you with a bow.\" he says, rubbing his chin under his beard."},
			{"text": "\"What's that supposed to mean?\""},
			{"text": "\"Nothing, you just seem like the type that would use a bow.\""},
			{"text": "\"Why do you say that?\""},
			{"text": "\"Because you're... uh...\""},
			{"text": "\"You know what?  Never mind.  I don't want to be a Ranger anyway.  Mom never used a bow.\""},
			{"text": "\"Right.  MAGE.  Mages wield the very nature of magic itself against their foes, and their power is legend, but their actual combat ability is without peer.  Because nobody's as bad at fighting as a mage.\""},
			{"text": "\"That's not like mom at all.  I think I'll pass, phenomenal cosmic power or no.\""},
			{"text": "\"That's probably a good call.  They're more of a party class, anyway.\""},
			{"text": "You sigh.  You wonder just how many classes there are... and if it will really make a difference if none of them suit you.  Maybe you should just be a warrior and try to make it work..."},
			{"text": "He doesn't say anything for a bit.  He looks like he's thinking... about what, you're not sure."},
			{"text": "\"...ENCHANT...ER.  Enchanters... can do just about everything.  High-level Enchanters are among the most powerful and revered of all adventurers.  Their stats are balanced, they can wear most equipment, and they can use both light and dark magicks. One of your mom's closest allies was an Enchanter, even.\""},
			{"text": "\"...that sounds great.  Alright, I'll be an Enchanter.\""},
			{"text": "\"Just like that?  You don't want to look at their st...\""},
			{"text": "[You are now an Enchantress] [Level 1]"},
			{"text": "\"Alright!  Class selected.  What next?\""},
			{"text": "\"Well, uh...  you should get familiar with your character information screen... uhm...\""},
			{"text": "\"Why are all of my stats so... low?\""},
			{"text": "\"They're... balanced.\""},
			{"text": "\"Wait, my Charisma is 7?!  What does that even do?\""},
			{"text": "\"Nothing, far as I can tell.  It's just, each class has one high stat.  Someone had to get the useless one.\""},
			{"text": "\"You said Enchanters were really good!\""},
			{"text": "\"I said 'high-level' Enchanters are among the most powerful and revered. Level 1 Enchanters are worse than worthless; nobody takes them seriously.  That's part of the reason why the high-level ones are respected - it takes a special individual to make the crappy starting class into something worthwhile.  Good luck.\""},
			{"text": "You feel... numb.  Dumbfounded.  Before you even know what's happening, you realize that he's led you to the door, where he then pushes you outside."},
			{"text": "\"W-wait!  What about my training?\" you ask, defiantly."},
			{"text": "\"That was it.  I'm just certified as a class-change trainer. Never got my skill training certification. Bad grades. One time, we snuck on top of the school and--\""},
			{"text": "\"THAT'S IT?  What am I supposed to do now?\" you ask, sounding more petulant than you intended."},
			{"text": "\"Now... well, first thing is getting supplies.  Better visit the Shop in town.  You'll know which one - it's the only one.  And you'll need someone to teach you magic, since an Enchantress without magic is just asking for it, but it's magic, so I ain't gotta explain... look, my tea's getting cold. Run along now.\""},
			{"text": "He slams the door shut.  You feel... different.  Certainly, you feel more in tune with the flowing of the air around you, and looking at your hands, there does seem to be a noticable... change in your appearance as well.  Supplies, he said... well, first thing's first.  Although, you suppose, this is now the second thing."},
			{"text": "As you walk away from the cottage towards the village proper, you start to wonder."},
			{"text": "To slay the Demon King... will that really improve the lives of the people you care most about?  You wonder.  You can barely remember it, but you've heard stories of what life was like under the Moon Lord's thumb... assuming it had a thumb, anyway.  The threat of the Demon King, by comparison, seems... remote."},
			{"text": "Well, your job as village layabout has come to an end, surely.  If you can give back to all the people who helped and supported you, then that's just what you're going to do."},
			{"text": "First, you set out for the village itself - knowing that the road to the Demon King's fortress, far in the northwest, beyond the mountains, will be daunting, you take your first true steps in that direction - to your first home, Nadir, and then beyond."}
		]
	},
	{
		"key": "STORY-004",
		"scriptLines": [
			{
			"background": "CABIN_BACKGROUND",
			"music": "TRAINER_MUSIC",
			"text": "You return to the cottage, but find that he's no longer there."},
			{"text": "You wait around for a while, but he doesn't return - maybe he's out on the town, or foraging for squirrels to eat."},
			{"text": "You leave, disappointed."}
		]
	},
	{
		"key": "STORY-005",
		"scriptLines": [
			{
			"background": "TOWN_BG",
			"text": "You enter the village of Nadir proper - the main street stretches before you, and you know the shop isn't far.  On your way to it, you happen across a trio of old, crusty men telling stories around a bonfire, although one of them doesn't say a word at all.  You walk past, nonchalantly, but listen in on their conversation, hiding behind a nearby retaining wall."},
			{"text": "\"Did ya hear about that adventurer boy what wandered into the orc camp down by Nagle's Crook?\" one man asks, although it's obvious from the reaction of the other two that they don't much know or care about it."},
			{"text": "\"Nah.  They kill 'em?\""},
			{"text": "\"Pahh, that'd be a borin' story, wouldnit?  Mighta been better for him, though.  Daft orcs couldn't tell 'em from a lass, so they blasted his ass six ways to sundown before he escaped.  Got back to town with enough orc jism up his butt to qualify as a caravan hisself!\""},
			{"text": "The man threw back his head in laughter, and his compatriot snickered, a grin visible beneath his mangy beard."},
			{"text": "\"Ya think that's funny?  A fresh-faced lad said he'd slay that ogre prince fella making trouble in the lowlands, and bring 'is head to the princess in exchange for her hand in joyous marriage 'n all that.\""},
			{"text": "He shakes his head, fighting back a fit of giggling.  Then he leans over and spits into a spittoon."},
			{"text": "\"Next time anyone saw 'im, he was dressed much the same as the princess whose royal pussy he'd been chasin' after - and the ogre prince was slippin' him a fat one under the skirts and up his arse.  Ever seen an ogre dick?  Me neither, but I reckon that boy ain't a happy wife.\""},
			{"text": "You feel a sinking feeling in your stomach.  Does that sort of thing really happen?  It can't be.  These old, dirty men must be telling tall baudy tales just to pass the time.  There's nothing more to it than that."},
			{"text": "\"I can do ya one better.  Hear about those shebitches that caught licker... lycra... the wolf sickness, y'know what I mean,\" he says, and you're not sure if the drunkenness has adled his brain or if it came pre-addled."},
			{"text": "\"Yeah, what about 'em?\""},
			{"text": "\"Well, rumor 'as it they've got between their legs what an alpha male wolf's got between 'is.  An' they like to pounce on unsuspecting men and give 'em what for,\" he says, pantomiming with his hands what everyone listening could picture in their heads."},
			{"text": "\"Yah, so?  How does that compare to an ogre's fat one?\""},
			{"text": "\"Well, y'see,\" he replies, leaning in, conspiratorially, but stage-whispering loud enough that you can still easily hear, \"when a dog is givin' another dog the business, they don't wan' 'em to leave before the business is concluded, y'see.  So it swells up, big as a dogfruit... an' I just got the name,\" he says, wiping his mouth in disgust.\""},
			{"text": "\"Big as a dogfruit? Oof... tha' must be 'n ordeal.\""},
			{"text": "\"Yah, let me tell ya, from one man to another, if a she bitch is lookin' frisky and ye can't fight her off, ye best off swallowin' yer tongue.\""},
			{"text": "You back away from the two men, who seem awfully amused with themselves, and check that your training sword is where you left it.  It sounds like you'll be needing it to be sharp and at the ready, because the world is a dangerous... uh... the image of a noble knight swearing to slay the ogre prince flashes in your mind, and then..."},
			{"text": "You shake your head.  The shop is just down this road.  You follow it, and spot the shop marked, well, 'Shop'."},
			{"text": "When you enter, you see that the shop has fruit laid out in baskets on tables and on counters, more fruit than anyone has ever had need for.  Since you get your food courtesy of the township, you've never had reason to step inside."},
			{"text": "Behind the counter, you see a fresh-faced girl who you've seen around town, but never spoken to."},
			{
			"music": "SHOP_MUSIC",
			"foreground": "SHOPKEEP",
			"text": "\"Hey there, what can I get for ya?\" she says, putting a basket full of apples down on the shop counter."},
			{"text": "You can't quite place her accent.  She hasn't looked over at you yet responding only to the sound of the shop door shutting behind you."},
			{"text": "\"Oh, you're new around here, aren't you?\" she asks, once she turns and sees your face."},
			{"text": "\"I've... lived here my whole life...\" you say, but she just smiles politely in response.  She wipes her hands - she'd clearly just been working in the apple grotto - and clears her throat."},
			{
			"sound": "SMUG_LAUGH",
			"text": "\"Name's Shopkeep.  You can call me Shopkeep,\" she says, full of energy. \"What would you like to buy?  Oh, and this cute thing isn't for sale,\" she says, gesturing to herself."},
			{"text": "\"I... didn't think that...\" you say, flustered, and she looks down at her dress and pulls on the hem, lifting it slightly."},
			{"text": "\"I made it myself.  It's my favorite dress.  Also my only one,\" she says, dropping the hem and shrugging. \"So, what'll it be?\""},
			{"text": "You wipe your brow.  Her dress, obviously.  It's your turn to clear your throat.  \"Hrm... what do you sell?\""},
			{"text": "\"Oh, the usual,\" she says, although you're not sure what a 'shop' usually sells, \"apples, pomegranates, dogfruit, and other seasonal fruit and spices. Wait, are you an adventurer?\", she asks, eyes suddenly wide with excitement. At the mention of 'dogfruit', your sphincter tightens."},
			{"text": "You feel a swelling of pride. \"Why, yes, yes I am,\" you say, confidently."},
			{"text": "\"Well then. I sell swords, knives, axes, hammers, maces, flails, guns, bombs... did I say knives?  Knives,\" she says, smiling sweetly, even as she kicks the display behind her, which flips around to reveal... well, exactly what she'd said.  An arsenal."},
			{"text": "Your mouth hangs agape."},
			{"text": "\"Oh, bows, also,\" she says, sensing your sudden anxiety, looking like she just remembered something, pointing over her shoulder at an array of short and longbows."},
			{"text": "\"No, no, I don't know how to... did you say bombs?  Uh... what kind of... swords do you have?\" you ask, trying to swallow your surprise."},
			{"text": "\"All kinds - longswords, shortswords, broadswords, bastardswords, single-edged, which are just knives, really, double-edged, good to wear gauntlets with those, falchions, scimitars, rapiers, mediumswords, machetes...\" she continues, listing them off without taking a breath."},
			{"text": "\"I think... uh... I think a longsword is fine.\""},
			{"text": "Her eyes light up. \"What kind?\""},
			{"text": "\"A pointy one, please,\" you say - you don't know the first thing about swords."},
			{"text": "\"Got ya!\" she says, turning on her heel to face the display of weapons... only to open a big iron chest, which you can see is actually filled to the brim with swords of all kinds - there must be dozens, thrown haphazardly inside.  She dons a pair of thick gloves and then dives in."},
			{"text": "You swallow, hard, as she searches deep in the chest... paying little mind to the fact that she's bending fully at the waist, and her skirt is not long enough to hide her panty-clad rear, which she wiggles at you in her search, either oblivious or uncaring."},
			{"text": "You wonder if she didn't measure her height properly, or if her rear wasn't quite so large when she sewed the dress... but it's hard to really think through hypothetical scenarios."},
			{"text": "The fabric stretches thin over her admirably-sized bottom, but you don't have much time to gawk before she stands back up right, arms full of blades."},
			{"text": "\"These are all pointy, good for stabbing and eviscerating, and more importantly, they're nice and light, so even weaklings can use them,\" she says, chipper as ever.  She doesn't seem to mean any insult by it, so it seems like it's just an honest appraisal of your abilities.  Which is... more insulting, probably."},
			{"text": "\"T-thanks... I guess I'll pick one...\""},
			{"text": "She drops the lot of them down on the counter - that can't be safe, or a good way to handle the merchandise - and you carefully peruse them.  There's a thin sword, clearly designed for thrusting, one that's a bit thicker, for thrusting or swinging it around, a thick one with a single edge, and a thick, double-edged one."},
		]
	},
	{
		"key": "STORY-006A",
		"scriptLines": [
			{"text": "When you finish making your selection, you hold it out from your body, feeling more confident than you've ever felt - but you still have no idea how to use it.  Being Level 1 sucks."},
			{"text": "\"Oh, no, not like that,\" she says, rounding the counter, \"here, let me show you.\""},
			{"text": "She stands behind you and grabs the sword, and you feel a lump in your throat.  Her soft form presses against your back, and your heart races."},
		]
	},
	{
		"key": "STORY-006B",
		"scriptLines": [
			{
			"background": "TOWN_BG",
			"foreground": "SHOPKEEP",
			"sound": "SMUG_LAUGH",
			"text": "\"Oh my... you're rather cute, aren't you?  A shame you're going on a journey...\" she says, and you feel your heart beating in your chest... and a stirring in your loins that isn't nearly as innocent."},
			{"text": "Her hand rests on yours, and her fingers trace up towards your wrist, when suddenly, she stops."},
			{"text": "\"Well, I'm sure you know how to use it,\" she says, and you swallow, as she rounds the counter again, her skirt trailing behind her."},
			{"text": "She returns to her position behind the counter and stares at you, smiling brightly, but silently.  You start to turn away, and she finally speaks."},
			{"text": "\"Thanks for coming!\" she says, waving to you as you leave, having procured the necessary - you hope - supplies."},
		]
	},
	{
		"key": "STORY-006C",
		"scriptLines": [
			{"text": "?!"},
		]
	},
	{
		"key": "STORY-007",
		"scriptLines": [
			{
			"foreground": "NULL",
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "With weapon in hand, you set out.  First stop - someone who will teach you magic.  You could ask the townsfolk for a suggestion... but you have at least one option in mind: Meri, a magician your mother once travelled with, who now lives as a recluse a few days east, near the foot of the Burle mountains."},
			{"text": "You leave the town, feeling more full of gumption than you ever have before."}
		]
	},
	{
		"key": "STORY-WITCH-COTTAGE",
		"scriptLines": [
			{
			"music": "TRAINER_MUSIC",
			"background": "CABIN_BACKGROUND",
			"text": "You manage to track down Meri's cottage - it being far on the opposite side of Nadir from your own humble hovel, you've never had an overwhelmingly compelling reason to come by here, and plenty of reason to stay away."},
			{"text": "Your curiosity about your mother had long since been overruled by your self-preservation, as Meri had a reputation for making boys like yourself... disappear.  Whether it was something truly sinister or simply the murmurs of an ignorant peasantry jumping to conclusions about a local witch, you didn't want to chance it."},
			{"text": "Faced with few other options now, however, you decide to give the old witch a chance - and remind yourself not to call her that to her face."},
			{"text": "Her cottage is excessively plain - but there's an air of palpable... malice to it that you can't shake off.  You warily approach the door, one hand on your sword's sheathe, the other balled in a fist against your chest, which thumps steadily and powerfully."},
			{"text": "You reach out said hand to knock, unwilling to remove your grip on your scabbard, and a hair's breadth away from the door, you hear a voice which stops you cold, as if frozen - \"come in,\" it says, merrily, inviting."},
			{"text": "You drop your fingers down, slowly, carefully, to the door handle, and, after catching your breath, you push it open."},
			{"text": "The inside of the cottage smells... rather pleasantly, actually, and it's much, much hotter than the autumn breeze outside.  As the door closes behind you, in fact, you feel an overwhelming sensation of comfort and familiarity, even though the inside of the cottage is wholly unfamiliar to you."},
			{"text": "It's a bit like you expect a witch's cottage to be - in that it surprises you entirely.  The surfaces are immaculate, the fineries are quite fine, the upholstery looks pristine and expensive, deep blacks, oak browns, and fresh blood reds - it's the last thing you would expect on the outskirts of a town like Nadir."},
			{"text": "There are, you eventually notice, some of the expected collections of a witch - tomes, less musty, but tomes nonetheless, and magic circles scrawled on the walls and floors, and great, beautiful crystals and orbs, each poisoned on top of a holder, some large, some small, delicately enough to make you anxious."},
			{
			"music": "WEREWOLF_MUSIC",
			"foreground": "MERI_SILHOUETTE",
			"text": "And then, finally, you spot her, as a shadow darts across the floor and then seems to disappear beneath her garments.  Even wearing a full-length robe, the curves of her body are visible and... otherworldly.  No doubt the work of some foul magic."},
			{"text": "She turns to face you, looking away from a spherical crystal - or is it an orb? - a smile on her lips, and a hunger in her eyes.  You smile politely at her and nod."},
			{"text": "You didn't expect her to be so... voluptuous.  In fact, you had kind of expected her to be old and grizzled by now, like your mother's class trainer - instead, she doesn't look like she's aged a day since you were a child."},
			{"text": "\"My, my.  Look who's all grown up.\", she says, her voice deep, her presence large.  Not exactly the slightness you would expect of a mage."},
			{"text": "You find it difficult to respond - something about her presence is... intimidating.  She has long, goldenrod hair, bright blue eyes, an impressive chest, and flaring hips that lead into long, lithe legs.  She strikes a powerful figure, and the way her gaze fixes on you makes it near-impossible to return."},
			{"text": "\"I remember you.  My, you look just like your mother.  Mmm... I love a man that looks anything but,\" she says, pumping her hips as she walks over to you, her heels striking a pleasant tone against her hard, wooden floor."},
			{"text": "She grabs you by the chin, and turns your head to inspect you.  You finally work up the nerve to speak.  \"I'm an... enchanter now,\" you say, and she smiles politely, releasing your chin."},
			{"text": "\"Enchantress.  But go on,\" she says, snapping her fingers, producing some phantasm of darkness that swirls around her fingertips like an ethereal bat, before she grabs hold of it and it vanishes in a cloud of nothingness."},
			{"text": "\"That's... that's why I'm here,\" you say, alluding to both your recent class change and the casual display she just put on, \"I'm interested in magic.\""},
			{"text": "She giggles silently, bringing her hand lazily up her thigh, then pointing a long, sharp-nailed finger at you, flicking it upwards in a gentle arc.  You feel an immense pressure pushing you back - your shoes slide along the floor, until your entire body is spread against her closed door, as if the pull of gravity has changed directions."},
			{"text": "\"Everyone is interested in magic,\" she says, \"but not everyone gets to meet a magician.  Aren't you interested in me?\" she asks, curling her finger back around to gesture for you to come to her - a beckoning which you literally cannot ignore."},
			{"text": "You're pulled inexorably towards her, until your close enough to smell her sweet breath, and further, until you're nestled between her breasts, your body pressed against hers, her arms slowly finding their way around your waist."},
			{"text": "\"I... I know you travelled with my mother,\" you say, looking up from her breasts to her face, as she peers down at you serenly.  She smiles.  \"Didn't you?\""},
			{"text": "She runs her hands up your chest, your neck, and clasps one around the back of your neck, and rests the other behind your head.  \"I did.  And do you think she was so oblivious to my charms?\""},
			{"text": "You swallow.  Looking into her eyes... you feel... you can't move, you can barely think.  Something is stirring beneath her robes... something... alive..."},
			{"text": "..."},
			{"text": ".."},
			{"text": "."},
			{
			"mutations": [{"saveType":"SKILL", "value":{"class": "com.majalis.character.Techniques", "value": "COMBAT_FIRE"}}],
			"text": "\"Rise and shine, boyo,\" she says, and you realize that at some point, your eyes closed... and, in fact, you're laying down on a long, cushioned seat in her cottage.  You feel your body - nothing appears to be missing - and you look around."},
			{"text": "The room is as it was before, but now that you're further in, you can see some of the strange instruments laying about, as well as a ring of iron, the height and width of a person, mounted on a wall."},
			{"text": "You also find the source of the voice, and it's her, the witch, Meri, standing in front of one of the orbs, her eyes closed, her lips curled into a smile."},
			{"text": "She's surrounded by a kind of other-worldly light, her robe lifting in some impossible updraft, but then, it subsides, and the high ringing you had heard dissipitates.  "},
			{"text": "\"You've been asleep a while.  I took the liberty of probing how awakened you are.  The answer is... not very, but enough.  The only question that remains is... what will you give me in exchange?\""},
			{"text": "You sigh.  \"I don't have money.\""},
			{"text": "She rolls her eyes.  \"I don't want money.  You have what I want,\" she says, sitting down next to you, and running her hand up your thigh."},
			{"text": "You swallow.  She nearly gets to your erection, to the point of caressing it through your pants, and stops.  "},
			{"text": "\"But... this first spell will be for free.  A spell that lets you channel magic into pure flame.  Just the kind of thing a mercenary like yourself can use,\" she says, running her finger down your chest."},
			{"text": "\"I'm not a mercenary,\" you say, and she puckers her lips."},
			{"text": "\"Bounty hunter, then?  You're so cute, you know?\" she says, leaning forward and kissing you, on the lips.  You feel... something flow into your body, down your throat, and into your chest - a warmth that spreads, and then a heat that sears."},
			{"text": "You pull away, but your throat is too burned to speak or even make a sound, and steam rises from mouth.  You tighten your fists in pain, and feel the fire spread even there, to the tips of your fingers - until it becomes unbearable, and your fists are flung open, your fingers spread, and flames begin to whip around, as if held in the palms of your hands."},
			{"text": "Panicked, you stumble backwards, thrashing around in the vain hope of extinguishing the flames on your hands - when your eyes catch Meri's gaze.  You freeze in place, although you can feel the fire rising in your throat, and you hear a simple command from Meri, though her lips never move."},
			{"text": "\"Swallow it.\""},
			{"text": "You close your fists.  You swallow as hard as you can, and the fire gets deeper, deeper inside... until it's just a heat again, sitting in your belly."},
			{"text": "In the distance, you hear Meri clapping."},
			{"text": "\"Congratulations!\" she says, smiling fakely. \"Now, you're a true spellcaster. Don't spend it all at once,\" she says, and you feel ready to pass out.  You start to stumble towards the door."},
			{"text": "Compared to the the class change, this was... substantially less pleasant.  You reach the door, and Meri doesn't even try to stop you."},
			{"text": "\"That won't be all the magic you need, you know.  But... it will get you started.  I'm sure you'll find your way back to me eventually,\" she says... and before you know it, you're standing outside of Meri's house, even though you don't recall opening the door.  Even stranger... there's fresh snow on the ground."},
			{"text": "You learned Combat Fire!"},
			{"text": "You can now use Incantation to enter a Casting stance!"}
		]
	},
	{
		"key": "STORY-WITCH-COTTAGE-VISIT",
		"scriptLines": [
			{
			"music": "TRAINER_MUSIC",
			"background": "CABIN_BACKGROUND",
			"text": "You return, hoping to perhaps learn new magicks... but the mysterious witch is nowhere to be found."}
		]
	},
	{
		"key": "STORY-FIGHT-FIRST",
		"scriptLines": [
			{"text": "The forest is quiet, but somehow unfamiliar.  The world outside of the small town where you've lived your entire life feels unfamiliar, in fact.  The trees are the same here, the ground, the air... but you can't shake the feeling that nothing is the same at all."},
			{"text": "You're finally leaving town... with a weapon in hand, and a class to your name.  You feel... unstoppable.  You'll gladly face death if it means being able to fulfill your destiny, the one that you've been ignoring for so long."},
			{"text": "You come to a small clearing in the forest... and you hear a cackling.  You reach for your scabbard.  The voice sounded... almost human.  But not quite... and the malice was unmistakable."},
			{"text": "You look around, trying to track the source - your entire body tenses, the pounding of your own pulse drumming your ears, the crunch of the soil underfoot such a burdensome distraction that you keep perfectly still.  This is it.  Your first battle."},
			{"text": "The scabbard shakes as you grip it, as if you were shaking, but that can't be.  Your mind is focused, your spirit is willing, and as soon as you see the fangs and claws, you'll know what to do - or so you think, when suddenly, a figure emerges from behind a fallen log... and you immediately recognize how it had been hiding behind it."},
			{
			"foreground": "GOBLIN",
			"text": "It's... a little green goblin.  From the proportions, it looks like a female.  She's stumbling around, laughing... there's no doubt about it - she's drunk."},
			{"text": "\"Heya! Hey! You! The boy with the fat butt!\" she says, before immediately laughing herself silly, apparently finding the reddening of your ears hilarious.  \"Why don't... you don't... why don't...\" she slurs, and then falls over, her loincloth falling out of place to give you an eyeful.  You're apparently not the only one with some junk in the trunk."},
			{"text": "You start to relax your grip on the hilt of your sword when, in a startling moment of sobriety, she kips up to her feet.  Moreover, she pulls out a small dagger and licks the blade."},
			{"text": "\"Ya didn't see that!\" she says, cutting the air clumsily."},
			{"text": "She's... pathetic.  A half pint without even a proper weapon, taking on someone twice her size... while drunk.  This couldn't be any easier."},
			{"text": "\"Wanna play with me?  Nyaha!\""},
			{"text": "Her skin's green, so it's hard to tell, but... it seems like she's blushing.  How she wasn't already blushing while drunk like juice or when she flashed her ass at you, you don't know."},
			{"text": "You ready your weapon.  There's no point in trying to argue with a bratty, maniacal half-pint.  If you can subdue her, maybe you can talk some sense into her."}
		]
	},
	{
		"key": "STORY-FIGHT-GOBLIN-VICTORY",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 2}}],
			"sound": "LOUD_LAUGH",
			"text": "She's still, unmoving... until suddenly, she explodes into frenetic action.  \"Hey, hey!  I think I sobered up!  What's for dinner?  Nyaha!\""},
			{"text": "You watch her warily as she picks up her things, barely seeming to register that she just lost a vicious battle."},
			{"text": "\"I thought you were dead!\" you cry, and she stops, and cocks her head to look at you, like you're the crazy one."},
			{"text": "\"0 HP doesn't mean 'dead', doofus, or you'd be stepping over adventurer corpses on your way to the adventurer corpse burrito stand next to the adventurer corpse disposal facility,\" she says, painting a mental image that you neither like nor appreciate."},
			{"text": "\"Then... what?\" you say, almost speechless."},
			{"text": "\"It means you can't fight anymore!  There's a pretty big gap between 'out of the fight' and 'dead'!  We don't use numbers for that.\","},
			{"text": "\"But... you're bleeding...\""},
			{"text": "\"Oh, don't worry about that.  You'll trip over as many rocks as stanching agents.  And I'm a gobbo, so I've got super healing!\" she says, demonstrating by wiping her bloody arm... only to reveal that underneath the blood, her wounds are already bloodless."},
			{"text": "You close your eyes.  It all makes sense now.  Adventurers aren't all stalwart, fearless heroes... they just don't suffer from permadeath.  You nod to yourself, silently.  You feel like you've already learned so much."},
			{"text": "\"Anyway, ya beat me!  How's it gonna be then?\""},
			{"text": "You blink twice.  \"How's... what gonna be?\""},
			{"text": "\"Nyaha!  Don't be coy!  How do you like your gobbo - stuffed or filled with cream?  Or are you one of those fey boys that wants a buttered up gobbo cock right up the ass?\""},
			{"text": "\"Huh?!\" you exclaim, flabbergasted.  You have no idea what she's talking about - is she... is she coming on to you?"},
			{"text": "\"Come on, pinkskin! Whip it out!\" she says, slapping her palm against the bulge in her loincloth, apparently indicating what, exactly, you should whip out. \"Or I'll whip mine out and give ya a big, fat GAME OVER where it counts!\""},
			{
			"foreground": "NULL",
			"text": "You... run.  You turn heel and make a break for it.  What is she talking about?  Why does she just assume..."},
			{"text": "Your thoughts can barely catch up to you, the stinging of the cuts on your face from the battle and the branches are so much more immediate than the confusion that trails you like the mist off someone emerging from a hot bath into the cool air."},
			{"text": "You can picture her... a goblin, emerging from the water, looking bashful, but confident... tumescent... and you shut your eyes to block out the image.  This proves unwise for two reasons - the first, that you can still see her in your mind's eye, and the second, that you almost immediately crash into a tree, knocking yourself to the ground."},
			{"text": "You lay on your back, thinking about what the goblin suggested.  Not only did she fully expect for you to ravage her... she even suggested... you can picture her bulge.  You doubt there was a banana hiding under her loincloth.  If she had won..."},
			{"text": "You thought that death and dismemberment were par for the course... but... was that goblin just spouting off her own twisted, warped views, or... your sphincter tightens at the thought."},
			{"text": "You close your eyes. This is going to be a long journey.  You exhale slowly, hearing the chirping of birds and the rustling of leaves in the forest... and, thankfully, not the pitter-patter of a goblin coming to make good on her promise."}
		]
	},
	{
		"key": "STORY-FIGHT-GOBLIN-DEFEAT",
		"scriptLines": [
			{
			"music": "WEREWOLF_MUSIC",
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{
			"foreground": "GOBLIN_ANAL",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "Inch by inch, it slides into your anus.  Your wrists, knees, and cheek lay against the dirt, and you disbelievingly accept it.  You lost to a level 1 goblin."},
			{"text": "Somewhere, in a far off place, brave adventurers are fighting amazing, spectacular battles against dragons, and monsters, and gods.  But, you?"},
			{"text": "You feel the warts as they slide in, and you know you're going to feel them as they slide out."},
			{
			"sound": "LOUD_LAUGH",
			"text": "\"Nyahaha!  Gonna breed your butt good!  Gonna fuck you in the ass every night, 'hero'!\""},
			{"text": "\"She\" bottoms out, and you feel them, \"her\" testicles.  Packed with enough semen to give a newly-minted adventurer's bowels a white-washing of shame."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "creampies":2}}],
			"text": "She makes good on her promise to fuck you in the ass every night.  You're a stone's-throw away from home, but rather than return with the shame, you remain the goblin's undignified, humiliated fucktoy.  She constantly reminds you of your pretensions to herodom... all the while crushing your prostate with her low-level enemy dick."},
			{"text": "You end every night with your balls coated in her semen, and never expect otherwise come the dawn."},
			{"text": "CLASS CHANGE!"},
			{"text": "Enchantress -> Goblin Fucktoy"},
			{"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "GOBBO DICK OVER."}
		]
	},
	{
		"key": "OGRE-WARN",
		"scriptLines": [
			{
			"music": "TRAINER_MUSIC",
			"text": "You come across an old, wisened man on the side of the road."},
			{"text": "\"Oagh, boy, there's an ogre thataways.\""},
			{"text": "\"What do you mean, there's an ogre 'thataways?' Surely there's more than one way through a forest.\""},
			{"text": "\"Look'n, I'm not a cartographer, y'here?  All I know is, y'wander in that direction, y'll be fartin' ogre cum till the last of yer days.  Heed m' warning or not, I don't figgy care.\""},
			{"text": "He walks away, giving you a rude gesture."}
		]
	},
	{
		"key": "STORY-OGRE",
		"scriptLines": [
			{
			"music": "WEREWOLF_MUSIC",
			"text": "You ignored the old man's warnings - there's no telling how accurate a rumor from a random stranger could possibly be.  The path has been relatively clear thus far... and quiet."},
			{"text": "The air has gotten thick - there's a scent you can pick up that's only getting stronger the more you travel on."},
			{"text": "You hear a loud thud.  Then another."},
			{"text": "The ground begins to shake with each one... whatever it is, it's absolutely huge."},
			{
			"sound": "OGRE_GROWL",
			"text": "You hear a low, deep growling... seems the old man was right after all."},
			{"text": "Is this... a meat gate?"},
			{"text": "You're extremely hesitant to continue... an ogre sounds like it's far outside your capabilities at the moment."}
		]
	},
	{
		"key": "STORY-OGRE-DEFEAT",
		"scriptLines": [
			{
			"music": "HEAVY_MUSIC",
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{
			"sound": "OGRE_GROWL",
			"text": "The ogre's massive cock bores into you as he lowers you down onto it over and over again."},
			{"text": "The length and girth of it is visible as it slides up and down in your abdomen."},
			{"text": "Your hole is stretched beyond recognition - it's unlikely it will ever return to its former shape or tightness"},
			{"text": "All the while, you feel it bubbling up your cock, which bounces uselessly in the wind."},
			{"text": "You try to resist, but to little avail - you fling your spunk into the air as you are bounced, full body, onto the ogre's massive schlong."},
			{"text": "It seems, indeed, the ogre was a meat gate... your only miscalculation was what the 'meat' entailed."},
			{
			"sound": "OGRE_GROWL",
			"text": "He roars, apparently nearing climax."},
			{"text": "You feel it pulsing within the massive cock inside of you even before you feel it glurg out inside, filling every last crevice and nook of your intestines with the ogre's salty load."},
			{"text": "He pulls you up by your hair, slowly, as you feel his totemic rod pulse within you, filling you with creamy, disgusting ogre spunk."},
			{
			"sound": "OGRE_GROWL",
			"text": "This is... not ideal."},
			{
			"foreground": "GAME_OGRE",
			"text": "As he pulls you off, a flood of ogre cum rushes out of you, and you twitch, unable to move under your own power."},
			{"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "GAME OGRE."}
		]
	},
	{
		"key": "STORY-MERCHANT",
		"scriptLines": [
			{"text": "The merchant smirks at you.  She seems to have something untoward on her mind."},
			{"text": "She offers you a look at her wares, so you take a peek."}
		]
	},
	{
		"key": "STORY-FEM",
		"scriptLines": [
			{
			"music": "GADGETEER_MUSIC",
			"foreground": "ADVENTURER",
			"text": "You come across a fellow traveller on the road, clad in ostentatious armor, riding what appears to be a giant bird."},
			{"text": "As they approach, you think they might be a woman, or a man... and by the time they're within ear-shot, you can't tell."},
			{"text": "\"I'm traveling to some dreadful place called Nadir. I'm told a powerful mage lives there that I must consult. I'll be coming back this way as soon as possible,\" they explain, unbidden."},
			{"text": "\"I'm crossing the mountains to the northeast, on a quest,\" you say, and they nod, seemingly only half-listening as they look down at you."},
			{"text": "\"Good, good. I'll have need of servants.\"   They brush their hair out of their eyes and peer at you.  \"What are you, some kind of... spellsword?\""},
			{"text": "You think about it for a moment.  \"Let's go with that.\""},
			{"text": "\"Hmph.  Magic... it'll turn against you, someday.  Where are you off to?\" they ask, as if you haven't already said."},
			{"text": "You look off, towards the mountains in the distance, barely visible through the treeline - the first major hurdle in your journey. \"I'm going to slay the Demon King.\""},
			{"text": "They nod slowly, then scoff, hiding their chuckle behind a gauntlet.  \"Are you... serious?  Alone?\""},
			{"text": "You stare daggers at them.  \"Yes.  Why?\""},
			{"text": "They draw their axe - a blinding light reflects off the blade and you shield your eyes.  \"You'll never even see the Demon King's gate. If you step foot in demon country at all, it'll be as a slave.  But...\" they say, holding up the point of the blade in your direction, \"...if you join me as a servant, you just might stand a chance.\""},
			{"text": "\"You're... you're also on a quest to slay the Demon King?\""},
			{"text": "They smile. \"Nothing so pedestrian.  But I may, while I'm on to bigger and better things, make a quick stop at the Demon King's castle.  If I happen to take their head while I'm there, you could bask in some of the residual glory.\""},
			{"text": "\"So... you don't care what happens?  You just want... a trophy?\""},
			{"text": "They sneer.  \"I'm sure you're very different.  A paragon of virtue, destined to make the world a better place.  It's purely coincidence that before you began your quest you were a miserable layabout,\" he says, bitterly.  \"Please, save your sanctimony.  Will you join me, or should I be going?\""},
			{"text": "You shake your head.  They snicker."},
			{"text": "\"Well then.  Maybe next time,\" they say, turning to leave.  You watch them disappear around a bend in the trail, and, feeling a little hurt, continue on your own way."}
		]
	},
	{
		"key": "CROSSROADS",
		"scriptLines": [
			{"text": "You come to a crossroads.  There are several signs pointing to various far-off locales, but of particular interest are the two marked \"West Pass\" and \"South Pass\".  Strangely, \"South Pass\" is to the East, and \"West Pass\" is to the North - but you can see the distant breaks in the mountains to the Northeast."},
			{"text": "The pass to the North is less traveled, but shorter - the pass to the east is a long haul, but the mountains in either case aren't particularly treacherous to cross, and the weather is mild."},
			{"text": "Which way will you go?"}
		]
	},
	{
		"key": "WEST-PASS",
		"scriptLines": [
			{"text": "The west pass.  It's... very westy.  THANKS FOR GETTING THIS FAR GAME IS DEVELOP STILL MANY LOVES IDDDDDDD"}
		]
	},
	{
		"key": "SOUTH-PASS",
		"scriptLines": [
			{"text": "The south pass.  There's a long journey ahead, but it's not done yet, so have this complimentary crab () . . ()"}
		]
	},
	{
		"key": "TOWN",
		"scriptLines": [
			{
			"background": "TRAP_BONUS",
			"text": "Whoa! Didn't expect you to get here already.  This game is still unfinished, you know?  Anyway, thanks for playing already!  If you ran into any issues, please let Majalis know, either by posting on itch.io, Patreon, or popping into our discord server!  Anyway, keep your eyes out for easter eggs for enterprising players such as yourself!"}
		]
	},
	{
		"key": "CRIER-NEW",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "CRIER", "value":1}}],
			"text": "Hear ye, hear ye!"}
		]
	},
	{
		"key": "CRIER-OLD",
		"scriptLines": [
			{"text": "You again?  Shoo!"}
		]
	},
	{
		"key": "CRIER-NEW2",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "CRIER", "value":2}}],
			"text": "Hear ye, hear ye!"}
		]
	},
	{
		"key": "CRIER-OLD2",
		"scriptLines": [
			{"text": "You again?  Shoo!"}
		]
	},
	{
		"key": "INNKEEP-01",
		"scriptLines": [
			{
			"foreground": "INNKEEPER",
			"text": "You visit the town's inn, looking for a place to spend the night and have a hearty meal, the better to brave the trail with."},
			{"text": "The embers of dusk sit on the horizon as you cross over into a shadow-filled alley, at the end of which is the entrance to the inn, a sign that reads 'Vacancy' lit by a sconce."},
			{"text": "You push open the door to a dim, diffusely lit room - the front desk ahead, with a hallway to your left.  The ceiling is low, and you can hear a thumping in the floor above, and small movements in the rooms beyond."},
			{"text": "You approach the heavy wooden desk, empty aside from a single candleholder and a block of knocking wood, and meet the innkeeper, an older man with a vaguely friendly smile, who tells you that the cost for a night alone is 10 gold coins - but, he says, he might be willing to make an exception in exchange for some... work."}
		]
	},
	{
		"key": "INNKEEP-02",
		"scriptLines": [
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": -10}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 25}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 100}}],
			"text": "You stack ten gold coins onto the front desk, and the innkeeper counts them by producing a second stack, then weighs the ten of them, to his satisfaction, before giving you the room key."},
			{"text": "You stay at the inn for the night, feeling well-rested in the morning."}
		]
	},
	{
		"key": "INNKEEP-03",
		"scriptLines": [
			{"text": "\"Hmm, don't have enough?\" he asks, rubbing his chin. \"Well, I do have some work needs be done, but... not sure a lass like you would agree to it.\""},
			{"text": "You roll your eyes.  \"I'm not a lass.  What do you need from me?\" you say, defiantly."},
			{"text": "His own eyes go wide for a moment, but then he clears his throat and returns to feigned congeniality.  He leans forward in his seat, looking you up and down. \"I'm thinkin',\" he says, and you tap your foot."},
			{"text": "You look down at yourself, then back up at him, and he furrows his brow in thought.  He seems to be considering something, but he's not sure if he's sold on the idea."},
			{"text": "\"I've got... a problem under the desk here,\" he says, making eye contact for a brief moment, \"and if you can help me with it, I'll let you have a room free of charge,\" he says, and you smile, excitedly."},
			{"text": "You nod, excitedly."},
			{"text": "\"Hmph.  A soft lad like yourself must have his pride to be out on his own,\" he says, leaning back in his chair again."},
			{"text": "You nod."},
			{"text": "\"How's about you swallow that pride?  And while you're at it, my cock?\""},
			{"text": "Your jaw drops... and then, as the heat reaches your cheeks, you close your mouth, becoming suddenly aware of how that reaction might be interpreted.  \"You... want me to...?\""},
			{"text": "He taps his finger on the desk, raising his eyebrow."},
			{"text": "You swallow."}
		]
	},
	{
		"key": "INNKEEP-04",
		"scriptLines": [ 
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "INNKEEP", "value":1}}],
			"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "A customer enters the inn.  They approach the innkeeper, his hands on the desk, beads of sweat on his brow."},
			{"text": "\"Do you have any vacancies?\" she asks, and the innkeeper grins at her."},
			{"text": "\"Like the sign says,\" he says, and then grimaces slightly.  The customer hears a faint slurping sound, but they don't see where it can be coming from."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralSex":1}}],
			"text": "Underneath the desk, you've got a mouthful of the innkeeper's stirring sausage, and you're trying to silently bring him to a finish."},
			{"text": "\"I'll need a room for myself for the night,\" you hear her ask, \"how much will that be?\""},
			{"text": "The innkeeper knocks on the desk, and you jump, surprised.  You realize, the redness coming to your cheeks, that he's subtly pointing out one possible method of payment, unbeknownst to her.  \"Ten faces,\" he says, and you roll your eyes, wishing you had that and not his junk in your mouth."},
			{"text": "You bob your head slowly up and down, trying not to make a sound, as the innkeeper chats with the customer, who is unaware that you're earning your stay just inches away from their feet."},
			{"text": "It jerks in between your lips more and more, and his voice gets curt and halting... and you feel the fear in the pit of your stomach as you realize he's about to blow with the woman still standing there, and it's unlikely you'll be able to avoid making a sound."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "oralCreampies":1}}],
			"text": "She hears an odd glorping sound, like someone trying to chug butter, and a thump from under the desk, and recoils.  You taste a sudden mouth-filling explosion of nutbutter, so everything checks out."},
			{"text": "You brace your hands against the sides of the desk as he blows in between your suckling lips, your eyes darting up at his obscured face and down at the pole in your mouth in confusion and uncertainty."},
			{"text": "Your cheeks are full, but you're careful not to make too much noise.  You wait for the sound of the customer's footsteps echoing down the hallway before you swallow it down, and his cock slips out of your lips."},
			{"text": "You emerge from under the desk and get unsteadily to your feet.  While you're wiping your mouth with your sleeve, he hands you a key, and gives you a pat on the rear.  \"Second floor.  Fourth room on the left, at the end of the hall,\" he says."},
			{"text": "You avoid eye contact as you take the key, walking briskly away down the hallway, up the stairs, and into your room."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 25}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 100}}],
			"text": "You sleep uneasily, knowing that his cum is in your stomach..."}
		]
	},
	{
		"key": "INNKEEP-07",
		"scriptLines": [
			{"text": "\"Again?  Well, a quick suck's not going to do it this time.  I've got a business to run - what say you share a bed with me for the night?\" he says, and you swallow - you know what he's offering."}
		]
	},
	{
		"key": "INNKEEP-08",
		"scriptLines": [
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "INNKEEP", "value":2}}],
			"text": "After a passionate night, you lie face-down against the bare mattress, listlessly."}
		]
	},
	{
		"key": "INNKEEP-09",
		"scriptLines": [
			{
			"text": "It was your first time, and, well... you didn't exactly keep your butt virginity intact.  You received your first creampie before midnight, and it wasn't the last."}
		]
	},
	{
		"key": "INNKEEP-10",
		"scriptLines": [
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":5, "creampies":2, "analEjaculation":3}}],
			"foreground": "KEYHOLE",
			"text": "The previous night, you similarly lay face down on the innkeeper's bed... underneath the innkeeper, who ass-blasted you on top of it."},
			{"text": "Once the last inn-goer had checked in, he'd locked the front door and snuck into his room, where you waited with bated breath."},
			{"text": "He pulled off your clothes, piece by piece, and then mounted you - slowly it creaked open, spreading audibly as it accepted his urgent cock."},
			{"text": "\"Oooh yeah, nice and dry...\" he'd said."},
			{"text": "He'd slowly pushed himself inside, making himself comfortable, while you tried to avoid too much unpleasant friction on your anal rings or walls."},
			{"text": "The bedsprings creaked as you bounced with each pounding thrust, your face thrust into the pillow as he laid into you from behind."},
			{"text": "While the other inn-goers slept soundly, having spent their 10 gold, you receive a hot semen injection in the bowels - part of the innkeeper's hospitality."},
			{"text": "He fucked you - several times, in fact - and creampied you raw each time.  Your stomach feels sore from all the filling it received."},
			{
			"foreground": "NULL",
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 15}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 100}}],
			"text": "As you lie there, face-down and butt-fucked, you feel completely emasculated.  The innkeeper's semen has dried between your cheeks, and still more is slowly bubbling out and down onto the mattress."},
			{"text": "You dress for breakfast in the morning, trying your best to avoid eye contact."}
		]
	},
	{
		"key": "INNKEEP-12",
		"scriptLines": [
			{"text": "\"Hmph, again?  You were pretty buggered last go,\" he says, giving you a wink - another customer emerges from one of the rooms and asks where they can find a blacksmith for their steed, and he takes their query, leaving you shifting awkwardly waiting to continue the conversation."}
		]
	},
	{
		"key": "INNKEEP-13",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "INNKEEP", "value":3}}],
			"text": "You feel hot all over - you know you're going to offer yourself up to him again.  When he's done with the customer, he beckons with his finger for you to follow him, and walks past you into the hallway where the first few rooms lie, with the staircase beyond."},
			{"text": "By the time you pass the second room, however, he grabs you by the shoulder, and bends you over, forcing you to brace yourself against the wall as he pulls your skirt down over your hips.  A moment later, he's inside you, in full view of anyone who happened to peek out of their room."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "He grips the nape of your neck as he thrusts it up into you, your eyes still wide in surprise at the sudden initiation.  Your cock, already stirred to life from his mention of being \"buggered\", stiffens as it flops between your legs, his poking into your rectum having a great effect."},
			{"text": "You groan and grit your teeth, bent at the waist, your hands spread on the walls, as he digs into you, his pace increasing, and your worry of being spotted simultaneously growing and being buried deeper in your belly, where it's hidden by the faster-growing need to release your lust all over the wall."},
			{"text": "You're broken out of that temporary reverie by the sound of a door-hinge creaking - someone again emerges from their room... you don't see them, but you're filled with shame, knowing that they almost certainly now know which side your bread is buttered on. That is - the backside.  The innkeeper certainly doesn't stop slipping you the sausage up the fudge-tunnel while they watch, presumably wide-eyed, his back-and-fro lurchings burying it up in your hole while you're bent over, legs spread."},
			{"text": "The hallway is otherwise quiet, so that the only sounds cutting through are his under-breath curses and grunts and the slapping of his thighs against your ass as he plows you."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1}}],	
			"text": "They don't say anything... but you do, a minced curse as the shame and sex overwhelms you and you feel yourself reaching an apex - you cum all over the wall, your knees trembling - a stain that you made, but he'll have to clean."},
			{"text": "You collapse to the ground, and the innkeeper, pulling up his own pants nonchalantly, engages the customer who had been waiting for the two of you to finish.  The innkeeper himself hasn't filled you with his cream, but you know you won't be spared of it."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 15}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 100}}],
			"text": "He brings you back to his bedchamber, again, and you are absolutely plowed all night.  You're going to be walking like a newborn deer and your hole won't close until after sundown.  You caught several anal creampies and two cumloads all over your back."}
		]
	},
	{
		"key": "INNKEEP-16",
		"scriptLines": [
			{"text": "\"If you're going to keep sharing my bed, what say you become my wife?\" he says, and you can't tell if he's joking or not... but, then again, he clearly enjoys your night-time company."}
		]
	},
	{
		"key": "INNKEEP-17",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "INNKEEP", "value":4}}],
			"text": "You feel your heart beating in your chest... why did you ever want to leave this town?  You can't remember now.  You nod, silently, and he smirks."},
			{"text": "There isn't much of a celebration - from one day to the next, you become the innkeeper's wife, and begin to fulfill your wifely duties."},
			{
			"foreground": "GAME_OVER_KEYHOLE",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":5, "creampies":2, "analEjaculation":3}}],
			"text": "You spend the rest of your days as the humble wife of an innkeeper - your nights having your pigtails pulled while he smashes your <BUTTSIZE> butt from behind."},
			{"text": "You also occasionally slip out to join one of the more handsome tenants for a night while the innkeeper mans the front desk or sleeps.  Eventually he figures it out, as just about every sheet in the inn is crusty with the semen that you spew while they fuck you, and he starts to charge extra for your services."},
			{"text": "Though you end up with a reputation as the town bicycle, this isn't unwarranted - you ARE the town bicycle, and you are ridden multiple times a day."},
			{"text": "You eventually forget what it's like to sleep in sheets that aren't sticky with your own anally-induced ejaculate, but that's just fine with you.  Every night you spend cuddling up to the innkeeper with his load bubbling out of your well-fucked hole, you can't imagine being or doing anything else."},
			{"text": "If anyone peeks through a keyhole at your inn, there's a decent chance they'll spot you, on your hands and knees, and a lock that can be opened by any key."},
			{"text": "*SPURT*"}
		]
	},
	{
		"key": "STICK",
		"scriptLines": [
			{
			"background": "STICK_BACKGROUND", 
			"text": "You encounter a stick!"},
			{"text": "It's actually rather sexy looking."},
			{"text": "There is nothing left here to do."}
		]
	},
	{
		"key": "TOWN-SHOP",
		"scriptLines": [
			{
			"background": "TOWN_BG",
			"music": "SHOP_MUSIC",
			"text": "You peruse the shop."}
		]
	},
	{
		"key": "WEAPON-SHOP",
		"scriptLines": [
			{
			"background": "TOWN_BG",
			"music": "SHOP_MUSIC",
			"text": "You peruse the shop."}
		]
	},
	{
		"key": "BANK",
		"scriptLines": [
			{
			"music": "SHOP_MUSIC",
			"background": "TOWN_BG", 
			"foreground": "TRAINER",
			"text": "You enter the bank. Here you can take out a loan, or pay down one.  <DEBT>"}
		]
	},
	{
		"key": "BANK-OVERDRAWN",
		"scriptLines": [
			{"text": "You enter the bank and instantly feel a sense of unease.  A towering mountain of a man blocks you from leaving."},
			{"text": "\"We're not running a charity. Pay up some interest, or we'll find a way to pay it for you.\""}
		]
	},
	{
		"key": "BANK-PAY-HARD",
		"scriptLines": [
			{"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "\"Sold!\""},
			{"text": "The word fills you with dread. You're standing, wearing rather little, in front of a large crowd of men - not all of them human."},
			{"text": "You don't even see who won the bid. You just know that, before long, you'll be intimately familiar with them. In particular, you're going to be taking it in the face and ass holes for the forseeable future."},
			{"text": "You were sold off. You're no longer an adventurer - and you never sit comfortably again."}
		]
	},
	{
		"key": "BANK-PAY",
		"scriptLines": [
			{
			"mutations": [{"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": -10}}, {"saveType":"DEBT", "value":{"class": "java.lang.Integer", "value": -10}}],
			"text": "You hand the coins over to the teller."}
		]
	},
	{
		"key": "BANK-PAY-50",
		"scriptLines": [
			{
			"mutations": [{"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": -50}}, {"saveType":"DEBT", "value":{"class": "java.lang.Integer", "value": -50}}],
			"text": "You hand the coins over to the teller, feeling a little nervous."}
		]
	},
	{
		"key": "BANK-BORROW",
		"scriptLines": [
			{
			"mutations": [{"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": 50}}, {"saveType":"DEBT", "value":{"class": "java.lang.Integer", "value": 50}}],
			"text": "You hand the coins over to the teller."}
		]
	},
	{
		"key": "BROTHEL",
		"scriptLines": [
			{
			"music": "SHOP_MUSIC",
			"background": "TOWN_BG", 
			"foreground": "MERI_SILHOUETTE",
			"text": "You enter the brothel. It smells... sweet. A beautiful woman leans against the wall, casually."}
		]
	},
	{
		"key": "BROTHEL-OFFER",
		"scriptLines": [
			{
			"sound": "SMUG_LAUGH",
			"text": "She looks you up and down and then smiles, stifling a slight laugh."},
			{"text": "\"One look at you tells me you're not planning to be a client,\" she says, putting her finger to her lips, \"so what is it? You want to be one of my girls?\""},
			{"text": "You pout. \"I'm not a girl,\" you say, defiantly, and she shrugs her shoulders."},
			{"text": "\"Not what I asked - and besides, you could fool me,\" she says, walking towards you. She grasps your shoulders, and then peers over them, down your back."},
			{"text": "\"W-what?  What are you looking at?\" you ask, indignantly."},
			{
			"sound": "SMUG_LAUGH",
			"text": "\"Heh. You've got a fat ass,\" she says, giving it a swat, chuckling to herself. \"You'll be able to spin plenty of gold with that... if you're willing to set aside your male pride, that is,\" she says, and leans into you, leering."},
			{"text": "You sigh. You don't have to think too hard about what she means by surrendering your male pride. If she's asking you to be \"one of her girls\", that can only mean one thing."}
		]
	},
	{
		"key": "BROTHEL-SIGN-UP",
		"scriptLines": [
			{
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "BROTHEL", "value":1}}],
			"text": "You agree to her offer. You take a fake name - one that the brothel owner assures you is the Elven word for \"heart\", but you doubt her, as she kept eyeing your rear as she said it."}
		]
	},
	{
		"key": "BROTHEL-MEMBER",
		"scriptLines": [
			{
			"foreground": "NULL",
			"text": "Now that you're a... worker, you can... entertain... clients.  You can choose to let them use your mouth, fuck you, or, for a higher price, spend the day with them."}
		]
	},
	{
		"key": "BROTHEL-ORAL",
		"scriptLines": [
			{"text": "You let the brothel owner know that your mouth is open for.. business."},
			{"text": "It doesn't take long before a gentleman arrives who's interested in... conversation. You lead him to one of the \"guest\" rooms, and then you kneel in front of him and get to work."},
			{
			"mutations": [{"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "prostitution":true, "oralSex":1, "oralCreampies":1}}],
			"text": "He finishes off in your mouth.  Without making eye contact, he leaves two gold coins on the dresser, and then leaves.  You wipe your mouth."}
		]
	},
	{
		"key": "BROTHEL-ANAL",
		"scriptLines": [
			{"text": "You let the brothel owner know that you're open for business."},
			{"text": "It doesn't take long before a gentleman arrives who's interested in laying pipe. You lead him to one of the \"guest\" rooms, where he asks you to disrobe and get on the bed."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "After climbing up on the bed, he swiftly mounts you, and then proceeds to pound you out."},
			{
			"mutations": [{"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": 5}}, {"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "prostitution":true, "creampies":1}}],
			"text": "After he finishes off inside of you, he leaves a stack of five gold coins on the bed next to you, and sheepishly collect it, his cum still dripping from your backdoor."}
		]
	},
	{
		"key": "BROTHEL-GFXP",
		"scriptLines": [
			{"text": "You let the brothel owner know that you're prepared for a long day of faux-romance."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 8}}],
			"text": "They take you out to dinner."},
			{"text": "At the end of the night, he brings you back to the town inn. You fidget nervously as he pays for the stay, avoiding eye contact with the innkeeper."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "Once in the privacy of your room, you find yourself face-down or on your knees or with your legs wrapped around him all night, being his \"girlfriend\" for a few pieces of gold."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 2}}, {"saveType":"GOLD", "value":{"class": "java.lang.Integer", "value": 5}}, {"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "prostitution":true, "analSex":3, "creampies":4}}],
			"text": "In the morning, he counts out the gold pieces and slaps them onto your upturned, bare buttcheek, which is coated in semen, mostly dried. Your hole drools your temporary boyfriend's seed as he leaves the room, and your life, forever."}
		]
	},
	{
		"key": "BROTHEL-CLASS-CHANGE",
		"scriptLines": [
			{"text": "Your class changes to Prostitute!"},
			{"text": "You no longer have any combat ability, but with a swish of your hip you can have any man eating from your fingertips... or bringing you to pound town on the cheap."},
			{"text": "You become infamous for your low prices... not that you care. Though you'll never be known for slaying the most dragons or defeating the most evil wizards, you've cum on more sheets while getting slammed than any other."}
		]
	},
	{
		"key": "NO-SKILLS",
		"scriptLines": [
			{"text": "You have no skills to select!"}

		]
	},
	{
		"key": "FORAGE-INTRO",
		"scriptLines": [
			{"text": "You forage for food."}
		]
	},
	{
		"key": "FORAGE-NIGHT",
		"scriptLines": [
			{"text": "Foraging at night poses its own dangers!"}
		]
	},
	{
		"key": "FORAGE-NIGHT-GOOD",
		"scriptLines": [
			{"text": "Luckily, things worked out!"}
		]
	},
	{
		"key": "FORAGE-0",
		"scriptLines": [
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 20}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You manage to hunt down a beast and kill it!"}
		]
	},
	{
		"key": "FORAGE-1",
		"scriptLines": [
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 12}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You find some berries to eat."}
		]
	},
	{
		"key": "FORAGE-2",
		"scriptLines": [
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 10}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You find some small lizards to eat."}
		]
	},
	{
		"key": "FORAGE-3",
		"scriptLines": [
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 8}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You catch some fish to eat."}
		]
	},
	{
		"key": "FORAGE-4",
		"scriptLines": [
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You wander around for a while, but don't find anything."}
		]
	},
	{
		"key": "FORAGE-5",
		"scriptLines": [
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}],
			"text": "You get lost!  You find it difficult to make your way back to camp."}
		]
	},
	{
		"key": "FORAGE-6",
		"scriptLines": [
			{
			"mutations": [{"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": -10}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 2}}],
			"text": "You fall in a hole!"}
		]
	},
	{
		"key": "FORAGE-7",
		"scriptLines": [
			{"text": "You get ambushed by some kind of huge bird thing!"},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex": 1, "creampies":2}}, {"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "It mates with you for several hours."}
		]
	},
	{
		"key": "FORCED-CAMP",
		"scriptLines": [
			{"text": "You're too exhausted to continue, so instead you camp to rest."},
			{"text": "You nibble on your food reserves and spend an extra night without traveling."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": -4}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 10}}],
			"text": "You restore 10 health and consume 4 food."}
		]
	},
	{
		"key": "STARVATION-INTRO",
		"scriptLines": [
			{
			"music": "WEREWOLF_MUSIC",
			"text": "Your hunger has gotten the better of you.  You're running out of strength."},
			{"text": "As you wander, your vision starts to narrow, and you start to wobble on your legs... until you collapse to your knees, falling face-first into the dirt, and blackness takes you."}			
		]
	},
	{
		"key": "STARVATION",
		"scriptLines": [
			{"text": "..."},
			{"text": ".."},
			{"text": "."},
			{"text": "You awake, face down in the dirt."},
			{"text": "Your consciousness floats in and out... and you have a sinking feeling that something is... wrong."},
			{"text": "You don't remember pulling your pants down.  Your mind is too fuzzy to know for certain... but you're pretty sure."},
			{"text": "Your face is down, but your ass is in the air."},
			{"text": "And... you can't quite place it... but something feels... off."},
			{"text": "Your... hole... is sore."},
			{"text": "You're surrounded by the footprints of some wild animal... and the stench of both wild animal and sex is in the air."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex": 1, "creampies":2}}],
			"animatedForeground": "BUTTBANG",
			"text": "A frothy white liquid is cascading down your balls and thighs, pooling onto the ground."},
			{"text": "Feeling it run down your legs, you suspect that it's the leavings of a satisfied animal, your heart sinking."},
			{"text": "The source of this waterfall of animal semen is... well, there's no polite way to say this: it's your poophole.  You apparently entertained some very confused beast while you were unconscious and... it must have thought that you were a female.  When it couldn't find a vagina to sow its seed, well..."},
			{"text": "Life... finds a way."},
			{"text": "To put it mildly - your rectum has been ransacked.  The lust of a beast has left your bowels awkwardly sore, and bloated in a way that makes it more comfortable to push out the burbling beast cum than to let it stew.  Judging by how gaped and sore you are, the beast must have mated with you at length, or possibly multiple times - or possibly you welcomed a whole pack of feral animals into your not-so-exit-only-now boyhole."},
			{"text": "You may never know exactly what happened after you lost consciousness, but all evidence points to a romantic rear rendezvous randy, rutting rectum-rummaging rascal."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "beast":true}}],
			"text": "In other words, while unconscious, you've been butt-bombed and anally inseminated by a wild animal.  Oof."}
		]
	},
	{
		"key": "STARVATION-GAME-OVER",
		"scriptLines": [
			{"text": "Your eyes are listless. You can't tell if you've just come to accept this sort of treatment... or if you now seek it, but you're no longer interested in glory."},
			{"text": "You continue to scrounge in the wilds, as you have been... only now you have no intent to return to society. You live among the beasts of the wild... and, on occasion, that means being their mistress."}
		]
	},
	{
		"key": "STARVATION-WARNING",
		"scriptLines": [
			{"text": "You've grown familiar with the sensation. Worryingly, your erection won't go down... precum drooling to the ground, even as some strange beast's seed leaks from your backdoor."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 20}}],
			"text": "You manage to scrounge up food to continue your journey, but at a hefty price."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 10}}],
			"text": "You rest to eat and restore your strength, then continue on, with slightly less dignity."},
		]
	},
	{
		"key": "STARVATION-FIRST-TIME",
		"scriptLines": [
			{"text": "You feel nasty. Experiencing that kind of indignity for the first time has left you in a state of perpetual embarrassment - you're just glad no one was around to see it."},
			{
			"mutations": [{"saveType":"FOOD", "value":{"class": "java.lang.Integer", "value": 20}}],
			"text": "You manage to scrounge up food to continue your journey, but at a hefty price."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 1}}, {"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": 10}}],
			"text": "You rest to eat and restore your strength, then continue on, with slightly less dignity."},
		]
	},
	{
		"key": "STARVATION-VIRGIN",
		"scriptLines": [
			{"text": "Congratulations, you lost your butt virginity. Err, sorry it had to be this way. I'm sure it was a handsome animal.  A... very romantic animal."},
			{"text": "Look, there's no sugar-coating this.  Your first time, not only did you take it up the ass, but it was with a dumb animal who couldn't tell the difference."}
		]
	},
	{
		"key": "ELF-BROTHEL",
		"scriptLines": [
			{
			"foreground": "ELF",
			"mutations": [{"saveType":"QUEST", "value":{"class": "com.majalis.character.PlayerCharacter$QuestFlag", "type": "ELF", "value":7}}],
			"text":  "You enter the brothel... but a certain familiar face catches your attention, as they're led off to a room with a male compatriot."},
			{"text": "You follow them, keeping an eye out for the brothel mistress, to sate your curiosity.  Sure enough, as you peek inside the room they entered, you see a rather... risque sight."},
			{"text": "Kylira is on the bed already, on their knees and elbows, face-down in the sheets... and his compatriot is behind, thrusting his hips against Kylira's ass without restraint."},
			{"text": "Seeing the proud elf being treated like a common human whore... you feel yourself getting warmer. With Kylira's muffled moans filling the space between your ears with honey, you leave the brothel, red in the ears."}			
		]
	},
]}