{"script": [
	
	{
		"key": "GADGETEER-INTRO",
		"scriptLines": [
			{
			"foreground": "GADGETEER",
			"music": "GADGETEER_MUSIC",
			"text": "You come across a travelling merchant.  Or, at least, you think she's a merchant, as she's carrying a massive sack filled with... what look like weapons, although not any kind of weapon you've come across before."},
			{"text": "\"Hey there!\" she says, waving you down, and you approach cautiously.  When you get within speaking distance, you see that her eyes are strange, somehow inhuman.  Otherwise, aside from her rather prominent figure, you don't notice anything odd about her - only about what she's carrying."},
			{"text": "\"Uh... hail.  Are you, by any chance, a merchant?\""},
			{"text": "She smirks. \"You could say that.  I'm more of a peddler.\""},
			{"text": "\"Can I... see your wares?\" you say, eyeing some of the more... exotic looking items she's carrying.  You're not sure what they're for, but your throat tightens as you stare up their length - and so does another part of you."},
			{"text": "\"Go for it!  Let me know if you see anything you like.\""}
		]
	},
	{
		"key": "GADGETEER-POSTSHOP",
		"scriptLines": [
			{"text": "\"What do you think?  Pretty cheap, huh?\" she says, and you blink, unsure.  The vast majority of what she's carrying doesn't appear to be for sale - so why is she carrying it?"},
			{"text": "\"Huh?  Oh, yeah... this is cheaper than in town... but, what about all that?\" you say, gesturing to the... rather obvious items filling her backpack and hanging from her waist."},
			{"text": "\"Wha? You mean these toys?  Oh, these aren't for sale.  They've already been sold.  Some maniac who gets off on emasculating men,\" she says, eyeing you up and down.  \"Hey,\" she says, and you look back at her, your eyes wandering towards the \"toys\"."},
			{"text": "\"What?\" you ask, and her eyes narrow.  She shifts the bag she's carrying on her back, and gives you one more once over.  "},
			{"text": "\"You seem really curious.  They're not for sale, but... maybe you'd like give to them a test-run?\" she says, licking her lips."}
		]
	},
	{
		"key": "GADGETEER-PEGGED",
		"scriptLines": [
			{"text": "You meekly nod your head - deep down, you know exactly what those toys are for.  She laughs coyly, and gestures her finger for you to turn around, dropping the bag to the floor."},
			{"text": "\"You seem so well experienced...  I don't think even my biggest toy will give you what you want. You don't just want things in your ass... you want to be -fucked-, don't you?\""},
			{"text": "You nod, again, and she smiles ear-to-ear.  She rifles through her bag - apparently this is not a toy she often has at the ready - and finally pulls out a pair of belts."},
			{"text": "The first has an obvious, blunt object affixed to it - the other instead has a interlacing rings in the same place instead.  She adorns the one with the smooth, black object, and then retrieves a vial from the bag."},
			{"text": "She coats the nub with it, smiling all the while.  \"Mmmhm, take it all off, cutey.\""},
			{"text": "You strip as quickly as you can, your hands and knees trembling.  The cool air on your skin gives you goosebumps, but she's still fully clothed - well, relatively."},
			{"text": "\"On your knees, sweetie,\" she instructs, and you drop to your knees unable to stop yourself, followed by your hands in the dirt."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "She squats behind you, steadying herself with a flat palm on your fat asscheek, and then, with a single thrust, she plants the fullness of the stiff black nub in your rectum.  She thrutsts it once, twice, three times against your prostate, and you're almost immediately a babbling, incoherent mess."},
			{"text": "With each thrust, you feel utterly emasculated - over and over again you've been violated anally, but now someone without even a cock is still treating you like a cocksleeve.  The pressure she puts on your prostate is unbearable, and you reach between your legs to stroke yourself to finish the job."},
			{"text": "She leans forward and grabs your hand, pulling it away."},
			{"text": "\"Nuh-uh!  No stroking.  Ass only,\" she says, spanking your ass to punctuate her point, followed by a deep thrust for emphasis.  \"I like my boys to cum like girls, so get to it, kay?\" she says, and you do feel it coming on... but you can't help yourself.  Again, you reach to stroke it... "},
			{"text": "She stops thrusting for a moment, and gives you another spank."},
			{"text": "\"If you won't stop stroking it...\" she warns, and you let go... but it isn't long before you can't help yourself again."},
			{"text": "She stops, completely, and then pulls out.  She unclips something from her belt, and shows it to you, rotating it in her fingers to give you a full view of it.  It's some oddly shaped golden cage."},
			{"text": "\"I'm not going to fuck your ass any more until you fit that misbehaving little noodle of yours into this cage.  So we're going to sit here and wait until it calms down,\" she says, and you warily sit on the ground, bemused."},
			{"text": "She sighs.  She sits on the ground as well, facing away from you, and fiddles with the objects in her bag.  You wait, patiently, for your erection to die down, but it's still pretty hard, even just sitting in the grass."},
			{"text": "Your ears perk up as you hear her moan softly, and you realize that she's put something down her pants... and you realize that one of the phallic objects that was hanging out of the bag is missing."},
			{"text": "She moans, and groans, and coos... and you watch, fascinating... but, slowly, but surely, you grow soft."},
			{"text": "Somehow sensing that, she stops her show, and tosses aside a foot-long object that she'd apparently been indulging herself with, before stomping back over to you, the cage in hand."},
			{"text": "\"With nothing in your ass, you eventually go soft... hm.  How embarrassing.  Oh well, in the cage it goes.  Let me not talk too much about being buttfucked or you'll blow it up again,\" she says, reaching between your legs with the cage.  "},
			{"text": "*click*"},
			{"text": "With that, she rattles the cage to make sure it's securely shut, and to demonstrate that it won't come off.  \"Sorry, useless dick.  You got the wrong owner.\""},
			{"text": "She smiles at your flaccid dick trapped within the cage, and flicks it again."},
			{"text": "\"Now where were we?  Oh yeah!\" she says, and rolls you over onto your back.  \"Hrm, I'm gonna need a bigger strap-on...\" she says, eyeing your still-open hole and your caged cock, \"one minute!\""},
			{"text": "Back to the bag she goes, before taking off the belt and retrieving from the side of the bag a massive, horse-cock shaped dildo.  She fastens the ring-belt onto herself, and then, to your horror, she fastens the fake horse cock to it."},
			{"text": "She stalks back over to where you lay, hosts your legs up, and spreads her knees as far apart as possible, so that your hole is aligned with the punishment dildo."},
			{"text": "\"Mmmmm... now I've got plenty of time to enjoy this...\" she says, and you don't know what she's talking about, but you have little time to spend figuring it out - the flared head of the dildo presses up against your recently fucked-silly sphincter, which starts to give."},
			{"text": "\"Ahh... agghhhhh...\" you groan, feeling it sink into you, inch by inch, a visible bulge appearing on your stomach as she pushes the horse-shaped and horse-sized fake cock up in your abdomen.  Your cock tries to harden, but to no avail, and your eyes water."},
			{"text": "She begins to bounce you up and down, sliding the shaft in and out, and your caged cock bounces freely with the rhythm, slapping uncomfortably downwards without any hope of becoming erect.  "},
			{"text": "It's pure torment.  Without being able to become erect, the fullness is just too much to bear, and you quickly find yourself squinting your eye, your body as limp as your noodle, your ass too full to take."},
			{"text": "She seems to enjoy watching you struggle to get a boner unsuccessfully with the fattest and longest of dildos see-sawing in and out of you, and you feel like you're going to lose your mind... but, strangely, you don't want her to stop."},
			{"text": "Soon your entire body is ablaze, a heat somewhere in the middle spreading outwards, your stomach bulging from the tremendous toy, your lips drooling and your head spinning.  You have no idea how long she fucks you, but by the end of it, you want nothing more than for her to take off the cage and let you, unequivocally, blow nut."},
			{"text": "\"Oh, the key?  I don't have it,\" you hear, a million miles off, as she slides the thing out of you, apparently having had her fill.  She begins to put her affairs in order when finally your mind returns to the world of Man.  \"I left it back home... in Pearl's Gate.\""},
			{"text": "You heart sinks into your chest.  Pearl's Gate - the exiled demonblood village - is far, far away."},
			{"text": "\"I'd be willing to retrieve it for you... if you accompanied me, of course.\""},
			{"text": "\"But... my mission...\" you say, looking down at your flaccid penis, trapped in a metal cage with no room to grow. Your quest is of such vital importance... but..."},
			{"text": "\"Oh, well, go your own way if you must. Besides, I'm sure an anal queen like you can make this work,\" she says, tapping against the cage gently with her finger. \"Of course, if you come with me, I can give you a little help with that...\""},
			{"text": "Your brain can barely understand anything - you only want to get out of the cage.  What will you do?"}
		]
	},
	{
		"key": "GADGETEER-SLAVE",
		"scriptLines": [
			{"text": "You agree to come with her, and that seems to satisfy her.  She continues to fuck your ass, your cock's cage clanking about, preventing you from being satisfied, until, eventually, she withdraws, having fully explored your well-travelled canyon."},
			{"text": "You end up travelling with the eccentric merchant... on the way to Pearl's Gate, you end up forgetting why you ever wanted anything but to be her toy.  You never end up getting erect again, although that doesn't stop you from dribbling cum out of your cage while she fucks your ass with her exotic toys.  "},
			{"text": "Having lost sight of your goal, your mission ends in failure."}
		]
	},
	{
		"key": "GADGETEER-PLUGS",
		"scriptLines": [
			{"text": "\"S-sure,\" you say, unable to resist."},
			{"text": "\"That's what I thought!\" she says, having apparently smelled the bitch on you.  She could tell you were looking for something in her bag that would feel good in your ass."},
			{"text": "\"W-what do you have...?\" you ask, and she smiles broadly."},
			{"text": "\"I've got all kinds!  This one's guaranteed to cross your eyes... this one'll make you knock-kneed, and this one's modelled after a stallion, for extra comfort.\""},
			{"text": "\"I... well... I don't know about those...\" you say, a bit of trepidation creeping into your voice."},
			{"text": "\"Hm?  You don't like taking big things up the ass?  Mmm... I don't believe you,\" she says, smugly.  \"Well, we can work our way up,\" she says, dropping the bag to the ground before grabbing one about the length of... well, a big penis, from inside, along with a clear vial."},
			{"text": "You eye her suspiciously as she pours some of the vial over the tip of the faux-phallus."},
			{"text": "\"Well?  What are you waiting for?  Drop your pants, bend over, and spread those cheeks!\" she says, chirpily, waving you over to a nearby tree, apparently for support. "},
			{"text": "She grabs a device from within her bag, but you don't see it, as you're too busy getting set up, spread legged and bent over, against the tree."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "First comes a butt plug, and not a small one - you feel it spreading you open as it enters you, and you groan.  But that doesn't last long, soon, it's out, and another, larger one has taken its place."},
			{"text": "One by one, she uses bigger and bigger butt plugs and dildos in you, always stopping just before you can properly get off.  Finally, she sighs."},
			{"text": "\"Hmmm... seems nothing's working.  Maybe you're just not a toy kinda boy,\" she says, in a flirty tone."},
			{"text": "\"What do you mean?\" you ask, still a little sore from the fore-arm length toy she'd just been jamming between your legs and up your hole."},
			{"text": "\"Maybe you... need something a little more lifelike,\" she says, and you warily check the area between her own legs, just to be sure... but you don't spot anything obvious there.  \"Not on me, silly.  I just happen to have a big toy with a pump... here, I'll show you,\" she says, bounding over to the bag, her partially uncovered breasts bouncing along with her soft tush."},
			{"text": "She withdraws from it a rather sizable toy... which looks like some kind of animal phallus.  It's attached to some kind of big opaque container, as well as hand-operated pump."},
			{"text": "\"Ta-da!\" she says, bringing the whole aparatus over in her arms.  \"It's a bull penis replica.  Nifty, huh?\" she asks, and you stare at it, unsure."},
			{"text": "\"That's... a bull's...?\" you say, having never seen one before."},
			{"text": "\"Well, a replica, but yep!  And it's going inside of you.  How does that make you feel?\" she asks, leaning in close to your face, her breath sweet and her voice full."},
			{"text": "You don't say anything.  You're mesmerized.  She lubes up the bull toy, and then spreads your cheek with one hand and begins to work it up into your anal canal with the other."},
			{"text": "Your toes curl as you feel it enter into you - the texture and shape are so different.  Your mouth is agape, unable to cope with the sensation, and your breath is ragged."},
			{"text": "\"You like the idea of someone firing off a potent load right up your ass, don't you?  Well, I say 'someone', but you'd be fine with animal, wouldn't you?  Just a mean, big, animal with a nice big cock and big full testicles, ready to offload in your asshole like a pussy.\""},
			{"text": "Your mind reels.  Is she right?  You feel the pressure building inside of you... are you really going to cum because of just the idea of a bull mating you?"},
			{"text": "\"You wanna be bred, don't you?\" she sneers, mocking you.  "},
			{"text": "\"Yes...\" you say, unable to hold back, as the fake bull penis slides in and out of you."},
			{"text": "\"Hey, didya wonder what was in this thing?\" she asks, patting the opaque container.  She grabs the pump, and starts to give it a go, and you feel the toy expanding with the liquid now filling it. \"Uh-oh... looks like Mr. Bull can't tell your fat ass from a heifer's!  He's gonna cum!\" she says, happily pumping away."},
			{"text": "\"What's... what's in it?!\" you ask, getting nervous."},
			{"text": "\"Why... it's grade-A bull semen, of course!\" she says, maniacally, just as you feel the rush of liquid inside your colon.  \"Milked the bull myself!  Wish I could see the look on your face right now...\" she says, as the runny liquid fills up your guts to the point of bloating."},
			{"text": "Needless to say, you cum.  The shock and shame of being pseudo-inseminated by a bull is too much.  You spurt all over the tree, and then collapse."},
			{"text": "\"Mmm... look at you,\" she says, as you lay, face down, in the dirt, your ass gaping open. \"You look like you just got buttfucked by a bull.  I guess, indirectly, you did.  I bet that bull had no idea where his load was going to end up, and I doubt he'd have guessed in some horny boy's ass.\""},
			{"text": "It drools out of you slowly.  You take some solace in the fact that a bull's cock didn't put it there... but being chock-full of bull semen was not on the agenda for the day."},
			{"text": "\"I won't charge you for the bull spooge.  Consider it a gift!\""},
			{"text": "She packs her things, and leaves you with your bull spooge, and a mighty sore asshole."}
		]
	},
	{
		"key": "GADGETEER-HESITANT",
		"scriptLines": [
			{"text": "\"Uh... maybe...\" you say, still hesitant."},
			{"text": "\"No need to be coy... I can tell you've been down this road before.  With a human, I hope - or do I have a monster to thank for... opening you up to new possibilities?\""},
			{"text": "You stay quiet, for a bit... you know exactly what she's offering now."}
		]
	},
	{
		"key": "GADGETEER-BALLS",
		"scriptLines": [
			{"text": "\"Mmmm, you are one confused little darling, aren't you?\" she says dropping her bag to the ground.  She grabs hold of one of the toys dangling from within, and slowly pulls it free - a long chain of balls strung together. "},
			{"text": "She directs you to a nearby tree-stump and has you lay on your back on it, while she retrieves a vial full of some strange gel from her bag of tricks."},
			{"text": "You get halfway through pulling down your pants when she hoists up your legs, and you feel her rub the first ball of many, slick with something, against your hole."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "\"One at a time,\" she says, smiling placidly... as she feeds the first one in, and then the second, and then the third..."},
			{"text": "She pops the beads in one after the other, and you feel your rectum start to fill and sag with them.  "},
			{"text": "All at once, she pulls them out, sending a charge up your spine, your hole unable to cope with the rapid expansion and contraction until the very last bead is out, at which point it remains confusedly open, convulsing slightly."},
			{"text": "And then, she brings the first to your gaping hole, and begins to feed the whole thing in again."},
			{"text": "Again, every single ball finds its way into your distended rectum, and again she pulls them all out in one go, making you cross-eyed with over-stimulation."},
			{"text": "\"Mmm, what a little slut,\" she says, noticing how your cock is dripping with anticipation for something... more.  "},
			{"text": "\"I'm... not a slut...\" you protest, but she puts a finger to your lips - and you notice that her finger is slick like the balls on the string."},
			{"text": "\"And do you know what sluts need?\" she asks, although she doesn't wait for the answer. \"Sluts need easy-to-use holes.  And what better way to make your asshole easier to fuck than with a big, fat, buttplug?\""},
			{"text": "You stare in awe as she unbuttons the hilt of the massive, shiny black thing on her hip, and she runs her fingers over it, coating it in jelly."},
			{"text": "\"That's... too big,\" you note, your voice flat, your eyes wide."},
			{"text": "\"Not with this slime goo it's not - although you'll probably be sore for a few days after having some fun with this big guy,\" she says, reaching under you to find your still slightly-open hole."},
			{"text": "She brings the plug down to it, and you feel like she's trying to push you through yourself and out the other side.  You spread your legs instinctively, throwing your head back, your teeth grit, as the big, inert plug is pushed inside."},
			{"text": "You nearly pull the bark off the stump as she slowly teases it into you, until you have no choice but to bite your knuckle as the fattest portion of it slips inside."},
			{"text": "\"There we go... all snug,\" she says, with a glint in her eye.  Your hole spasms uncomfortably around the base of the big thing lodged inside, and you try to adjust to it... but then, she grabs hold of the flared base, and begins to turn it."},
			{"text": "She twists the butt plug inside of you, spinning it over and over again, making you moan hoarsely with humiliating pleasure."},
			{"text": "\"Mmmm... how's that?  Gonna spew into the air?\" she asks, watching your cock twitch and jerk upwards with each rotation of the monstrous plug."},
			{"text": "She taps repeatedly on the plug's flared end, causing it to vibrate inside of you... and you realize that her insistence that the plug will make you anally ejaculate is anything but an idle threat."},
			{"text": "She stops twisting it, and slowly pulls it out... a quarter of the way... half of the way... and then, she pushes it back in, and you take in air which can't escape your lungs.  Then she pulls it out, again, gently... about halfway... and then back in it goes."},
			{"text": "This time, the sensation proves too much, and you thrust your hips upwards, the cum bubbling and frothing out of your untouched cock, while she keeps hold of it, twisting it inside of you like a key in a lock."},
			{"text": "You grit your teeth as you cum, your sphincter tightening around the plug - and it seems like she'll leave it comfortably in until you're done when, without warning, she yanks it out, and you accidentally fire the thickest shot of semen of your life."},
			{"text": "With the froth of cum dislodged by your sudden shot, there's a pool of cum at the base of the stump, and a line of it stretching out a few feet.  Your whole body is coated in sweat, and you shudder and convulse, but she calmly shakes off the wet plug and clips it back into place, apparently satisfied."},
			{"text": "\"There.  Now it'll be a little easier for the next lucky dick to get inside,\" she says, smirking, before taking up her big, heavy bag, and leaving you reclining on the stump."}
		]
	},
	{
		"key": "GADGETEER-CONFUSED",
		"scriptLines": [
			{"text": "You can't really see what she means by that.  Seeing your confused expression, her face falls."},
			{"text": "\"Mmm... that's disappointing,\" she says, drawing one of the smaller items from the bag, something a few inches long and not very thick, with a hilt.  It doesn't look like you could really do any damage with it.  \"Maybe you'd like to try it out, anyway?\""}
		]
	},
	{
		"key": "GADGETEER-BREAKINGIN",
		"scriptLines": [
			{"text": "Her face brightens up again, a knowing smirk finding its way to her full lips.  \"Willing to try anything once?\" she says, demurely, as she drops her bag to the ground.  "},
			{"text": "\"I... guess,\" you say, unsure why you agreed with her demands - was it her cute smile?  "},
			{"text": "\"Hands and knees, please.  Going to need to lube you up good if I'm going to get this up there,\" she says, waving the oddly shaped weapon in front of your face, before sheathing it in a small hilt on her waist."},
			{"text": "\"Up... where?\" you ask, and she rolls her eyes."},
			{"text": "\"Hands and knees, please.  The details aren't important,\" she says, running her hand down your back, before nudging you to get into position.  You drop to your knees, then your hands.  \"Pants down, please,\" she instructs."},
			{"text": "\"I'm not sure...\""},
			{"text": "\"Pants, down.\"  Her voice is still sweet, but commanding... and you sense something odd about it.  You pull your pants down, reluctantly."},
			{"text": "\"That's a good boy,\" she says, producing from her sack a vial filled with translucent goo of some kind.  \"Nothing but the finest slime oil for our little butt virgin hero,\" she continues, pulling off her glove with her teeth while clasping the vial firmly in her still-gloved hand."},
			{"text": "She twists open the vial with her ungloved hand, then pours out the gelatinous substance onto her fingers - not much more than a dollop."},
			{"text": "\"I hope you know what you're getting into... I really love it when boys do,\" she says, squatting down behind you, and you suddenly feel something cool and slippery rubbing against your balloon knot - her finger, coated in jelly."},
			{"text": "She swirls it around without waiting to hear you sigh passively, her finger stroking your hole up and down, left and right, and in a gentle circle.  "},
			{"text": "\"Normally, this is the part where I might see some resistance.... not from you, though.  You're a natural,\" she says, spreading your hole with her thumb and middle finger, her index finger poised to strike.  \"Well, girls will be girls...\" she says, and you open up your mouth to speak but nothing comes out, but something certainly comes in."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "Her finger slides into you easily, lubricated by the slime goo, all the way to the second knuckle.  You feel her flick it inside of you, like a dull thump somewhere strangely inside your own body."},
			{"text": "\"Ooh, tight.  Looks like I really lucked out - this is going to be a real waste.  Deflowering this could have been the highlight of some poor monster's whole life,\" she says, swirling her finger around, hooking it in a \"come hither\" gesture that is bringing you closer to somewhere, but you're not sure where."},
			{"text": "She starts to slide her finger in and out, and your tight sphincter squeezes onto it as she pulls it out, and is compressed inwards as she pushes it back in."},
			{"text": "\"And you're already so hard... so unnecessary,\" she says, and she's not lying.  Dangling downwards, your stiff enough to poke a hole in the ground.  \"Hmm... sorry, Mr. Hero, I'm not interested in that.  And sorry, Mr. Monster... I'm loosening him up.\""},
			{"text": "With that, you feel the pressure grow... and a second finger slips inside.  She starts to work the two fingers in and out, humming a melody to herself."},
			{"text": "\"Hmmm... getting impatient are we?  You're leaking,\" she says, referring to the steady dribble of precum you're coating the dirt with.  \"Well, me too, actually.  These toys aren't going to defile themselves.\""},
			{"text": "All at once, she pulls out both fingers, leaving you open and quivering."},
			{"text": "\"Mmmhmhm... oh, my... this toy is perfect for a virgin like you...\" she says, once again unsheathing the hand-held object that looks suspiciously like a phallus.  \"Going to plunge it right into you.  Going to lose your first time to it,\" she says, twisting it against your already-open hole, \"What. A. Waste.\""},
			{"text": "You feel ashamed... you've never done anything before... before the reality sinks in, you feel her start to push it forward.  Her ungloved, slimy hand touches the small of your back gently, instilling you with a bit of calm, even as the toy is forced upwards and inwards."},
			{"text": "She begins to twist it as she pushes it in, then back out again, then in again, holding your hip so that your full ass remains in place while she stuffs her toy in and out of it.  She seems to know exactly how to ream it in and out of you to get the greatest effect."},
			{"text": "It isn't long before you feel a heat growing within your abdomen - and your unused cock begins to twitch and jerk.   Sensing that, she speeds up her thrusts, and starts to spank your receptive rear."},
			{"text": "\"Cum! I want to see you cum!\" she says, her face looking a bit crazed.  \"You're getting fucked in the ass!  No one's even touching your cock!  But you're going to cum, aren't you?\" she says, accusingly, almost... drooling.  Her face is flushed and red, and her nipples are visible underneath her admittedly revealing top."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1}}],
			"text": "You feel a warmth spreading within you between your hips, and you struggle to maintain your focus - when suddenly, the dam breaks.  Rather than feeling like you're ejaculating, you feel like something inside of you is getting hotter and hotter, but nevertheless, your penis expels its wasted milk into the dirt."},
			{"text": "While you fill the soil with your cum, discarding it while she violates your ass with her toy, sliding it this way and that while forcing your hips to swivel and follow it, your upturned tush follows her lead."},
			{"text": "She takes note of your leavings.  \"Mmmhmhm, you came a lot for someone who was getting a fake dick shoved up their boy-butt.  Especially since it was your first time, and all.  If I squatted in that, I might get pregnant,\" she says, teasingly."},
			{"text": "You breathe heavily, having exhausted yourself from cumming anally, and she has a bit of sweat on her brow as well.  She sheathes her slime-covered fuck dagger and retrieves her bag, while you shudder and shake on your hands and knees."},
			{"text": "\"Mmm, good boy,\" she says - and as she leaves, she casually steps into the puddle of mud you left behind - leaving her footprint in it."}
		]
	},
	{
		"key": "GADGETEER-NO",
		"scriptLines": [
			{"text": "\"Hrm, fine then. You'll be the one that got away, I suppose,\" she says, shrugging, before continuing down the trail, leaving you feeling ambivalent about how things turned out."}
		]
	},
]}