{"script": [
	
	{
		"key": "GOLEM-INTRO",
		"scriptLines": [
			{
			"mutations": [{"profileSaveType":"KNOWLEDGE", "value":{"class": "java.lang.String", "value": "Golem"}}],
			"music": "ETHEREAL_MUSIC",
			"text": "In the distance, you spotted it - a statue of some kind.  Something about it... calls to you."},
			{"text": "As you approach it, you can hear a gentle humming, but even if you clap your hands to your ears, the humming persists - almost as if it's coming from within your own head."},
			{"text": "The statue's shape comes into view before the finer details; it has the rounded figure of a woman - maybe the remnant of a shrine to some kind of fertility goddess?"},
			{
			"foreground": "GOLEM_DULL",
			"text": "As you stand before it, you see that it's quite odd for a statue.  Parts of it are carved from what appears to be smoothed granite, but others are reflective like obsidian.  Most startling of all are the colorless, transparent crystals adorning its shoulders and head, and embedded in its joints."},
			{"text": "The more you look at it, the less like a statue it seems... it's far too detailed to have been simply carved and then discarded in the wild. It shows little sign of wear or decay... and something about it emanates outwards in discernable waves."}
		]
	},
	{
		"key": "GOLEM-AWARE",
		"scriptLines": [
			{"text": "You feel something within you calling you forward... as you reach a hand towards the statue, something about it reaches back, although if you were asked, you would have no words for such an eldritch sensation."},
			{"text": "A physical change, however, grips your attention instead - the crystals begin to glow with a soft, multicolored light, which grows more intense as your hand approaches."}
		]
	},
	{
		"key": "GOLEM-LEAVE",
		"scriptLines": [
			{
			"foreground": "NULL",
			"text": "You feel unsettled, and recoil your fingers.  The statue becomes dull and lifeless once more, and you prefer it that way.  Retreating slowly without showing the strange artifact your back, you make your way back to the path, leaving the idol behind."}
		]
	},
	{
		"key": "GOLEM-AWAKEN",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 10}}, {"saveType":"SKILL", "value": {"class": "com.majalis.character.Techniques", "value": "FOCUS_ENERGY"}}],
			"sound": "INCANTATION",
			"text": "Your flesh touches the stone, and at that moment, you see a kaleidoscope of colors, and your mind fills with a knowledge otherworldly in origin.  The world falls out from beneath you, and you see for miles... and then, your eyes snap open."},
			{
			"sound": "FIREBALL_SOUND",
			"foreground": "GOLEM",
			"text": "You stumble away from the statue, but even as you do, you notice the change.  All the crystals embedded in it are glowing, full of color, humming with an ethereal sound.  Without warning, the joints begin to move, and then, the statue's eyes open."},
			{"text": "Your jaw falls open at the incredible sight.  The statue's hand rises, and its fingers begin to flex, and its head turns... towards you.  It seems aware of your presence."},
			{"text": "Before you can adapt to the situation, the crystals begin to hum louder, and louder, and the statue begins to look around, as if in a panic.  The crystals give off more and more light, and you sense that you if you don't do something soon, something very bad will happen."}
		]
	},
	{
		"key": "GOLEM-DOMINATED",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "You assert your aura until it entirely engulfs the object's, a totality that renders it motionless, its crystals humming so silently as to be inaudible.  With the knowledge you gained upon touching the stone, you can discern the thing's capabilities."},
			{"text": "\"MODE: xFNjsczpsIAD error.  awaiting commands,\" it says."}
		]
	},
	{
		"key": "GOLEM-SOOTHED",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "As if wading into still water, you surround your aura with hers, until the boundaries of either slip within and without.  Your power calmly soothes her errant mana, and she once again returns to a simple animated statue, peering at you with innocent eyes."},
			{"text": "\"MODE: PASSIVE.  awaiting queries,\" she says."}
		]
	},
	{
		"key": "GOLEM-CALMED",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 1}}],
			"text": "You manage to calm her down, but she still seems to be on alert."},
			{"text": "\"MODE: ALERT.  analyzing interlocutor,\" she says."}
		]
	},
	{
		"key": "GOLEM-MISUNDERSTANDING",
		"scriptLines": [
			{"text": "\"initiating release protocol\" she says, and she begins to sway one of the crystals hanging from her hair from side to side."},			
			{"text": "Staring at the crystal as it sways, you start to feel like you're tired... and then, like you're floating... and as the seconds turn into minutes, you feel completely detached entirely."},
			{"text": "\"semen tanks contain semen from: human males, orc males, equine males, centaur males, porcine males, bulls, error, error, unknown, error, unknown.\""},
			{"text": "You don't really understand what she's saying... but something between her legs catches your interest."},						
			{
			"foreground": "GOLEM_CLOSEUP",
			"text": "Something emerges from within... of a very suggestive shape."},
			{
			"foreground": "GOLEM_FUTA",
			"text": "There's no question about it - it's a robot dildo.  Why?!"},
			{"text": "\"semen tanks at maximum capacity. requesting docking for deposit,\" she says, looking at you... expectantly?  Hard to say on a robot."}									
		]
	},	
	{
		"key": "GOLEM-HYPNOSIS",
		"scriptLines": [
			{"text": "You bend over and offer your butt-pipe as a convenient storage mechanism for her ancient, overripe, over capacity semen tanks. Her injector is primed, lubricated, and ready, and with your hands on your knees and a placid smile on your face, so are you for statue sodomy."},
			{"text": "The pistoning appendage approaches your rear hole with a specific purpose and without any second thoughts.  With machine-like precision, she aims her stone phallus facsimile at your puckered starfish, and the insertion is all but imminent."},
			{"text": "The part of you that the crystal's song hasn't managed to submerse knows that disgusting, bubbly froth of beasts and men from ages past belongs in a sewer, or at least emptied on the ground where it can't do any harm.  With her internal workings whisking it into a goop, it serves absolutely no purpose."},
			{"text": "Of course, the automate doesn't know that - an error in her construction seems to have resulted in a most unfortunate fit of unexpected behavior.  Your stomach is alreaday turning itself into knots at the prospect."},
			{"text": "She hooks her arms under yours, holding you from behind with immense strength.  You couldn't move even if you wanted to."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "As it pistons to and fro, it approaches closes and closer... until you feel it begin to jam its way up inside with industrial verve."},
			{"text": "Holding you still, and keeping her feet firmly planted, her robotic stone phallus pistons in and out of your mechanically incompatible hole."},
			{"text": "The literally unnatural ritual of having your prostate pounded by a rock robo causes your prostate to begin \"feeling the resonance\", as it were, and soon, you are on the cusp of anal ejaculation."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1}}],
			"text": "With her servos firing on all cylinders, it is not much longer before your legs begin to quake, and you begin to spew white globs of boymilk from the pleasure of being rectally rooted."},
			{"text": "She notices your ejaculation. \"designated semen apparatus leaking. will need maintenance,\" she says, apparently disregarding your semen for collection."},
			{"text": "You shudder through your orgasm, clenching your teeth even as her pistoning continues unabated.  It's obvious that she's got her own duties in mind."},	
			{"text": "\"preparing to empty semen tanks,\" she says, without inflection."}
			{"text": "You prepare to get your own semen tank filled with whatever she's got."}
			{"text": "\"emptying semen tanks,\" she says, a strangely human urgency in her otherwise monotonic voice."}
			{
			"sound": "CUM",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "creampies":1}}],
			"text": "The machine-warmed stale suds burst into your rectal cavity at the apex of each piston, mimicking the hundreds of ejaculations of men and monster past that produced such a copious slimy gift of sperm.  Your gut is quickly stuffed with the disgusting ancient remnants of male lust."},
			{
			"sound": "CUM_BUBBLING",
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "creampies":2}}],
			"text": "The golem receives no satisfaction from this, other than her simple satisfaction at having completed some routine maintenance. Your stomach looks pregnant with the weight of hundreds of centuries-old ejaculate for no other reason than her innappropriate directive."},
			{"text": "\"semen tanks empty,\" she says monotonically, as your stomach gurgles and writhes while trying to cope with the massive semen deluge that she's upended in it.  At the very least, her piston stops churning it into butter."},
			{"text": "She withdraws it, out of you, and back into herself.  Her control over you fades completely."},			
			{"text": "Immediately as she withdraws her stone instrument, with your bowels unclogged, you begin the messy work of fully flushing them of mangoo. The golem notes your \"leaking\" again, but does nothing to stop it - further proof that her insemination protocol was, in this instance, completely pointless."}			
		]
	},
	{
		"key": "GOLEM-TRIBUTE",
		"scriptLines": [
			{
			"mutations": [{"saveType":"ITEM", "value":{"class": "com.majalis.character.Item$Potion", "effect": "MANA", "magnitude": "20"}}],
			"text": "She breaks off a piece of her crystal hair and holds it out for you to take."}
		]
	},
	{
		"key": "GOLEM-GIFT",
		"scriptLines": [
			{
			"mutations": [{"saveType":"ITEM", "value":{"class": "com.majalis.character.Item$Potion", "effect": "MANA", "magnitude": "40"}}],
			"text": "She breaks off massive chunk of her crystal hair and holds it out for you to take."}
		]
	},
	{
		"key": "GOLEM-OVERDRIVE",
		"scriptLines": [
			{
			"sound": "FIREBALL_SOUND",
			"mutations": [{"saveType":"HEALTH", "value":{"class": "java.lang.Integer", "value": -20}}],
			"text": "The golem's energies surge outward!  You feel intense pain all over your body.  Then, her movements erratic, her gaze fixated on you, she attacks!"}
		]
	},
	{
		"key": "GOLEM-UNAWARE",
		"scriptLines": [
			{
			"foreground": "NULL",
			"text": "Unfortunately, though its mystery calls to you, the statue remains insert.  You puzzle it over for a few minutes before reluctantly continuing along the path that it had distracted you from."},
			{
			"mutations": [{"saveType":"TIME", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "The statue's visage remains in your mind's eye for a long while, and you end up lost in thought... and in practice. After recovering your way, you push the unusual artifact from your mind."}
		]
	},
	{
		"key": "GOLEM-SPEAK",
		"scriptLines": [
			{"text": "\"What... are you?\" you ask."},
			{"text": "She moves about deliberately, focusing her gaze on you. \"this is a magical construct. this is pleased to meet you. this is peaceful. how are you?\" she asks."},
			{"text": "\"I'm... I'm okay,\" you say, unsure of how to respond."},
			{"text": "She nods in agreement. \"how are you identified?\""},
			{"text": "I'm... you can call me... <NAME>."},
			{
			"sound": "GOLEM_ONE",
			"text": "\"this is unit 00001. this is an alpha prototype. please do not copy or sell. if there any faults, please let MYSTERA THE MAGNIFICENT know at error no connection to portal network. may I have ice cream?\" she asks, abruptly."},
			{"text": "\"Do you... do you like ice cream?\" you ask, perplexed."},
			{"text": "\"yes. this one likes ice cream. unlike this other one,\" she says, although you have no idea what she's referencing."},
			{"text": "\"How do you eat ice cream?\" you ask, seeing no visible mouth."},
			{"text": "\"very carefully,\" comes the reply."},
			{"text": "Her movements are slow, but you can sense a great power from within.  You've never encountered such a marvelous automaton before - even the wonderous artifacts of foreign merchants were toys in comparison."},
			{"text": "\"What can you... do?\" you ask, and she immediately begins to rattle off her functions."},
			{"text": "\"this one can store, concentrate, and solidify arcana for later use. this one can also store and deliver essence for breeding experiments. this one can engage in combat for defense or sparring. this one has no other directives.\""},
			{"text": "You think about what she said, trying to decide what to do."}
		]
	},
	{
		"key": "GOLEM-TOP",
		"scriptLines": [
			{"text": "\"acknowledged.\" She turns slightly towards you, and something between her thighs opens up."},
			{
			"foreground": "GOLEM_CLOSEUP",
			"text": "Something emerges from within... of a very suggestive shape."},
			{
			"foreground": "GOLEM_FUTA",
			"text": "There's no question about it - it's a robot dildo.  Is this how she means to give you... help?"},
			{"text": "She approaches you, the queer thing begin to shift in and out of her. \"this is created for master's pleasure. suitable for human male?\" she asks, and you... nod, hesitantly."},
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analSex":1}}],
			"text": "You get on your knees in front of the literal fuck-machine, and she approaches you from behind. Thankfully, the thing is self-lubricating, and she pushes it inside without issue, even as it moves rythmically in and out, twisting as it goes."},
			{"text": "With her punching your prostate with her magical toy, it takes little time for you to begin curling your toes in anticipation of an orgasm."},
			{"text": "\"collecting semen,\" she says, and from within her a strange suction device emerges and comes into view, before sinking below your body."},						
			{
			"mutations": [{"saveType":"ANAL", "value":{"class": "com.majalis.character.SexualExperience", "analEjaculation":1}}],
			"text": "She affixes the device to your cock just in time - you immediately fire off a rope of cum into it."},
			{"text": "Her semen collecting apparatus collects all your semen.  It's kind of in the name.  It's coated in a thick layer of nutslime even before you spew yours inside."},
			{
			"mutations": [{"saveType":"EXPERIENCE",  "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "You're burdened by the knowledge that some poor fool in the future is going to end up on the receiving end of your semen, but you otherwise enjoy yourself."},
		]
	},
	{
		"key": "GOLEM-SHUTDOWN",
		"scriptLines": [
			{"text": "\"acknowledged.\" She says it with a subtle inflection. She resumes the same position she'd inhabited originally."},
			{
			"foreground": "GOLEM_DULL",
			"sound": "GOLEM_SHUTDOWN",
			"text": "The golem blinks once, twice, first looking at you, and then away, and then becomes completely still, the color of her crystals fading."},
			{"text": "You sense no aura from her now, which is a bit odd.  Still, you got what you needed - and so you depart."}
		]
	},
	{
		"key": "GOLEM-FREE",
		"scriptLines": [
			{"text": "You tell her not to deactivate herself, and then leave the golem, active and unharmed.  Perhaps you will see her again someday?"}
		]
	},
	{
		"key": "GOLEM-VICTORY",
		"scriptLines": [
			{
			"mutations": [{"saveType":"EXPERIENCE", "value":{"class": "java.lang.Integer", "value": 3}}],
			"text": "The golem ceases any hostile actions - it seems like she's done fighting, although you can scarcely recognize any external damage."}
		]
	},
	{
		"key": "GOLEM-DEFEAT",
		"scriptLines": [
			{"text": "Having defeated you, the golem appears to be plotting her next course of action."},
		]
	},
]}